{"mid": [{"value": 36653}], "uuid": [{"value": "b7b59348-4657-4586-bf7a-b4d4ac868ebc"}], "vid": [{"value": 36653}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12961-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 7<br />\n<br />\nBALTIMORE, MD., OCTOBER 25, 1921<br />\n<br />\nREPRESENTATIVES OF STU- PRINCETON INVITES 71 UNI- BASKETBALL SCHEDULE IS<br />\nDENT ACTIVITIES ADDRESS<br />\nVERSITIES TO ATTEND<br />\nAWAITING SANCTION OF<br />\nSTUDENT ASSEMBLY<br />\nCONFERENCE<br />\nVARSITY CLUB<br />\nSeveral New Songs Introduced.<br />\n<br />\nris<br />\n<br />\nRE<br />\n<br />\n).<br />\n<br />\nng<br />\n<br />\nnd<br />\n<br />\nPrincipal Purpose of Coming Assembly<br />\n<br />\nProspects for a Good Team Bright.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nVIRGINIA NOSES OUT HOPKINS<br />\nIN A CLOSE, WELL-PLAYED GAME<br />\n<br />\nHOPKINS MAKES 7 FIRST DOWNS TO VIRGINIA'S 3.<br />\nis to Stimulate Discussion of<br />\nAt the mass-meeting held last<br />\nAlthough it is not certain as yet<br />\nLimitation of Armaments.<br />\nMAGILL, CALKINS AND MARKELL STAR. BLACK AND<br />\nThursday in the C. E. Hall, Dick,<br />\nwhether the financial returns from<br />\nThe<br />\nprincipal<br />\npurpose<br />\nof the the football season will permit putWood, president of the Student<br />\nBLUE OUTPLAYED VIRGINIA THROUGHOUT THE<br />\nCouncil, announced that Johns coming intercollegiate conference ting out a basket-ball team this winGAME. TOTTERDALE ELECTED CAPTAIN.<br />\nHopkins had been asked to send a of Princeton University on the ter, the management is going ahead<br />\ndelegate to the Intercollegiate Con- subject of the limitation of arma- in arranging a schedule and makVirginia was saving what she had for Saturday's game with<br />\nference on the Limitation of Arma- ments is rather to stimulate dis- ing plans for the best basket-ball Princeton, but Hopkins forced the Orange and Blue reserves in a<br />\nments to be held next Wednesday cussion of the question in the col- season Hopkins has ever had. Up hard fought game on Lambeth Field, Charlottesville, Saturday.<br />\nat Princeton. In order that the leges than to seek to influence the t,)<br />\n- the present time, games have Showing improvement and playing the best game of the season,<br />\nHopkins delegate, who will be delegates to the Washington Con- been scheduled with Virginia, St. Johns Hopkins team was a worthy equal of the mighty<br />\nVirginia<br />\nchosen by the Student Council, ference. It has been decided, John's, Dickinson, Rutgers, St. eleven, and Virginia students agree that their team was outplayed<br />\nmight know the sentiment of the therefore, that the principal em- Francis of Brooklyn, Swarthmore throughout the game. None of the afternoon's touchdowns were<br />\nrestudent body, a rising vote on the phasis will be placed upon thp ad- and several other colleges of this sultant from straight football, hut good football was much in eviquestion was held. The result was dresses which will be made to the class. The uncertainty of whether dence. Both teams were unsuccessful at the passing game, with<br />\nthe<br />\nan overwhelming majority in favor assembled delegates by men a team will be sanctioned by the exception of a beautiful completion, Foster<br />\nto Oppleman for 35 yards.<br />\nOf limitation of armaments.<br />\nprominent in public life.<br />\nVarsity Club is some hindrance to<br />\nSo the game settled to line-plungarranging<br />\nas attractive a schedule DRAMATIC CLUB ENROLLS ing and occasional punts. The backis<br />\nunderstood<br />\nIt<br />\nthat<br />\namong<br />\nWood also announced that the<br />\nthe<br />\nRECORD NUMBER OF<br />\nFreshman activities buttons would speakers will be Franklin O'Olier, as might be possible, but it is begieldsi weighed about evenly, but<br />\nbe ready by next Wednesday and first national commandant of the lieved that if a team is really put<br />\nCANDIDATES<br />\nHopkins took more ground, gainthat they will be given out at the i1merican Legion, and Major Gen- on the floor they will have some<br />\ning seven first downs to Virginia's<br />\nAspirants for Dramatic Club Turn Out<br />\nNEWS-LETTER office in the Barn, eral John F. O'Ryan, a veteran of strong opposition.<br />\nhree. Clark's punts, averaging 40<br />\nin Full.<br />\nbetween 12:30 and 1 o'clock. H. both the Spanish-American and<br />\nBauernschmidt and Owings are<br />\nyards, gave Virginia the edge in<br />\nAll the Mansfields, Atwills, and kicking. Approximately 3,000 peoDouglas Cotton, president of the the World -Wars.<br />\nthe only men left from last year's<br />\nBarrymores<br />\nof the Freshman class ple sat in the big stadium and no<br />\nStudent Activities Council, said<br />\nThe<br />\nconference<br />\ncommittee team, but several men from the<br />\ncrowded<br />\nstudio in the Barn at more enthusiasm or noise was manthe<br />\nthat not only must the Freshmen wishes to make it clear that the Medical School are still available.<br />\nmeeting<br />\nthe<br />\nthe Dramatic Club, ifested by them than was shown by<br />\nof<br />\ncome out fdr activities, but they coming conference cannot hope Of these men, Wilson, Keye and<br />\nTuesday, the 18th. the small but loyal group<br />\n12:30<br />\nP.<br />\nM.,<br />\nmust also stay out regularly or they to sway in any manner the official Sanders played on last year's team. at<br />\nof HopFifty-eight<br />\nmen, many of whom kins followers, who cheered lustily<br />\nWill be reported and their buttons assembly which convenes in From the freshman team of last<br />\nhave had previous experience in for the Black and Blue. It was<br />\ntaken away.<br />\na<br />\nWashington in November, but year there is also some very good<br />\nmaterial<br />\nin<br />\nthe<br />\nshape<br />\nof Strouse, dramatics, signed up. This is the great game from the Hopkins<br />\nEmil Smith urged all men to at- that it is rather an effort to start<br />\ngreatest number of candidates for standpoint and well worth the jourtend the first meeting of the Social collegiate discussion upon the Hutzler, Martin,Marchetti and Ashminor production in the history of ney to witness. For Virginia,<br />\na<br />\nScience Club, which will be held in topic with the possible view, ulti- ton. Promising material in the<br />\nhe<br />\nclub.<br />\nBarge and Oppleman gained ground<br />\nRoom 112, Gilman Hall, at two mately, to the expression of opin- freshman class includes Turnbull,<br />\nGilsen Engle, president of the club, nicely, while Michie evidenced his<br />\nfrom<br />\nPoly;<br />\nPanetti,<br />\nfrom<br />\nCity;<br />\nthe<br />\no'clock, on Friday. No speaker has ion in the form of a straw vote.<br />\nSkinners and Towner, from addressed the men, expressing all-South Atlantic capacity for runbeen secured for this time, but sev- In such a vote, moreover, it would<br />\nFriends,<br />\nand several other good men )1easure at seeing so many out and ning to a sure tackle under the<br />\neral very prominent men have been be useless and vain to go into any<br />\nfrom other out-of-town prep )riefly stated the purpose of the punts. For Hopkins, McGill shone<br />\nbooked for later meetings. Fenne- details concerning what measures<br />\nschools. No coach has been ap- meeting. He urged all to exert when he blocked Clarke's punt and<br />\nr/Ian announced that the Black and should be taken toward limiting<br />\npointed as yet, but it seems sure themselves to the limit and help to recovering, ran 15 yards for a<br />\nBlue Jay would not be out until the armaments. It would merely be<br />\nhe should be able to pick a nake this a successful year for the touchdown.<br />\nthat<br />\nCalkins, Spinney,<br />\nend of the month, and that a meet- an expression in favor of or<br />\nclub.<br />\nwinning<br />\nteam<br />\nfrom<br />\nthis<br />\nmaterial.<br />\nWillis<br />\nand<br />\nDarley<br />\nshowed some exing of candidates for the editorial against the principle of the limiMr. Harry Morris, '20, chairman cellent line plunging in the<br />\nthird<br />\nand business staffs will be held next tation of armaments.<br />\n)f the Alumni Council of the period.<br />\nWhen substituted for<br />\nTuesday at the barn.<br />\nThere seems to be very much<br />\nCOACH LE CATO'S CHARGES<br />\nDramatic Club, spoke of the origin Spinney in the fourth quarter,<br />\nPierce Brawner asked for more comment, most of which is favorMAKING RAPID PROGRESS<br />\nof the club, its aims, and the high Markell broke Virginia's line for<br />\nmen who were willing to support .ble, on the coming conference and<br />\nliterary quality of the plays pre- three straight first downs.<br />\nA large number, perhaps a record<br />\nthe team by going down to Vir- during the past week letters have<br />\nsented in the past years.<br />\nat<br />\nthe University, are reporting<br />\nThe game in more detail:<br />\nginia in a special coach. He then been received by President HibThree one-act playlets are to be<br />\ndaily<br />\nto<br />\nCoach<br />\nLe<br />\nCato<br />\nat<br />\nHomeVirginia won'the toss and Clarke<br />\nrequested that the students sign a ben from many of the heads of the<br />\ngiven for the purpose of discoverNood Field for track work.<br />\nkicked<br />\nwell back of the goal, givPetition to be posted—in the base- various institutions throughout<br />\ning talent among the new men.<br />\nment at Gilman Hall, asking the the East in which they congrat- Only a few members of last Those who show exceptional worth ing Hopkins the ball on her own<br />\nBoard of Trustees to rent the first ulate Princeton for having taken year's squad were lost, by gradua- in the small plays will be given 20-yard line. Hopkins was forced<br />\nto kick. Both sides were unable to<br />\nfloor of the Barn to the Homewood a leading step in the disarmament tion and the veterans are augmented parts in the major production.<br />\nby<br />\nmany<br />\nnew<br />\ngain<br />\nmen,<br />\nsome<br />\nof<br />\nand another exchange of<br />\nwhom<br />\nissue.<br />\nAll of these men thoroughly<br />\nCompany when the present lease<br />\nThe following are the plays which<br />\nalready<br />\nare<br />\nwell<br />\npunts<br />\nknown<br />\nto<br />\nfollowfollowed. Coady's punt was<br />\nexpires. \"Due to the fact that the approve of that University's stand<br />\nwill be presented in December: \"A<br />\nof<br />\ners<br />\nHopkins'<br />\ntrack<br />\nblocked<br />\nactivities.<br />\nby Hall, of Virginia, and<br />\nHomewood Company went $4,500 and are willing to co-operate to<br />\nRoad House in Arden,\" a comedy;<br />\nMichie<br />\nrecovered,<br />\nHopkins stock took a consider- 'Death and Fever. Flats,\" a tragedy<br />\nrunning to Hopin the hole on athletics last year, their utmost in setting forth the<br />\nsome move to gain more revenue policy adopted by the intercolle- able rise when Vernon Booth, for- and a tragic comedy written by Jo- kins' 2-yard line. Oppleman made<br />\nthe touchdown on the second try<br />\nfor minor sports is imperative, oi giate convention. The idea of the mer star at Delaware College, and seph Moran, '23.<br />\nseveral minor sports must be dis- student conference has become so Perkins, the Cross Country Club<br />\nBesides parts in the plays the at Hopkins' line and Hall kicked<br />\ncontinued this year. The conces- popular in collegiate circles that half-miler, signified their intention candidates have opportunity to try goal. The remainder of the quarsion at the Barn gives an income many distant institutions to which of casting their lot with the Black out for the positions of assistant ter holds little interest. After some<br />\nof eight or nine thousand dollars,\" invitations had not been sent have nd Blue.<br />\nbusiness manager and assistant attempts at end running and an exchange of punts, we find Virginia<br />\nBrawner said, \"and as this comes already written the Princeton<br />\nManager \"Bill\" Fortney has not property men.<br />\nfrom the students there is no rea- Disarmament Committee inquir- completed the schedule, but rare<br />\nThe prospects of the club for the with the ball on her own 25-yard<br />\nson why it should be given to an ing just what the nature of the treats; are promised followers of coming year are exceptionally line. When Clarke attempted to<br />\noutsider, when it could be turned meeting will be.<br />\nthis branch of Hopkins activities. bright. Miss Clementine Walter, kick out of danger, Magill broke<br />\nthrough and succeeded in not only<br />\nback to support student activities.\"<br />\nAmong those who have ex- Present indications point to the the one person who has been mainly<br />\nblocking the punt, but recovered the<br />\nGil. Engel and Joe Thompson pressed their hearty approbation most successful track season ever responsible for the great success ball<br />\nand raced across the intervenof the past productions, has anof the movement are Pres. Alder- experienced at J. H. U.<br />\nthen took charge of the meeting<br />\ning<br />\n18 yards for Hopkins' lone<br />\nman of the University of Virginia, The candidates for the cross- nounced her intention of again filland outlined several stunts that will<br />\ntouchdown.<br />\nCalkins kicked goal.<br />\ning the chair of coach. Miss Walter<br />\nPres. H. A. Garfield of Williams country teams are taking<br />\ndaily<br />\nSoon<br />\nafter<br />\nplay<br />\nwas resumed, Hopbe pulled before the St. John's College, Pres. W.H. P. Faunce<br />\ns a graduate of the Sargent School,<br />\nof \"jaunts\" of six miles<br />\nkins intercepted one of the many<br />\nor so through also of the Paris School of<br />\ngame. Several new songs were Brown, Pres. H. P. Judson of the<br />\nDramatic<br />\nOrange and Blue passes and had the<br />\nintroduced and one written and University of Chicago and Dean the University grounds. Captain Art.<br />\nball<br />\non Virginia's 35-yard line, but<br />\nsung by \"Buck\" Wilkinson, made a Walter T. Marvin of Rutgers Col- Mullikin and Hazeltine were the '['he painting of the scenery and an<br />\nattempted<br />\ndrop kick failed. The<br />\nonly members of last year's squad designing will again be in the able<br />\nbig hit. A locomotive yell by Joe lege.<br />\nhalf<br />\nended<br />\nin<br />\na 7-7 tie.<br />\nhands of Mr. Badillio.<br />\nWe are interested to find in this to be lost by graduation, which<br />\nThompson also proved a big sucToward<br />\nthe<br />\nlast of the third quarAs yet the club has not decided<br />\nlist the name of our own presiden, leaves a promising nucleus for this<br />\ncess.<br />\nter,<br />\nthe<br />\nHopkins backs gave an exupon any specific play for its main<br />\nFrank J. Goodnow, of Johns Hop- year's team.<br />\nproduction. The delay in the de- cellent exhibition of line plunging.<br />\nkins. As reported recently in the<br />\nMany of the new candidates are cision is due to the fact that the Carrying the ball in turns, Willis,<br />\nEvening Sun, President Goodshowing good form and promise to club is waiting to see just what roles Spinney, Calkins and Darley gained<br />\nA meeting of the candidates now expressed<br />\nhimself as being<br />\nthrough the big Virginia line a tocan be filled by the Freshmen.<br />\nfor the Editorial and Art Staffs heartily in favor of the whole plan develop into likely material.<br />\ntal of 55 yards before the ball was<br />\nTry-outs<br />\nfor<br />\nthe<br />\ninformal<br />\nplays<br />\nAccording to present indications,<br />\nof the Black and Blue Jay will and he called attention to<br />\ntaken over on -Virginia's 20-yard<br />\nthe fact<br />\nwill<br />\nbegin<br />\nnext<br />\nweek,<br />\nand<br />\nin<br />\nas<br />\nbe held at 12.30 today in the that the sum of money invested in the cross-country team will acquit much<br />\nas the material appears to be line.<br />\na great warship like the battle- themselves with credit in the diffi- very rich in ability their presentabalcony of the Barn.<br />\nThe fourth quarter opened with<br />\nship Maryland would be sufficient cult schedule which Manager Fort- tion on the night of December 1st Virginia in possession of the ball<br />\nContinued on page 3, col. 2<br />\nney is arranging for them.<br />\nwill be a great success.<br />\nContinued on page 4, col. 5<br />\n11.111.,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br />\n<br />\n2<br />\n<br />\nOf course the vast majority<br />\nthat voted in favor of disarmaFOUNDED 1897.<br />\nThe Social Science Club held a A Column in Which the Correspondents ment was thoroughly informed of<br />\nAre Allowed Latitude, But Shoulprinciples involved in the forthpromising and well-attended meetder the Responsibility.<br />\n$2.50<br />\nSubscription<br />\ncoming<br />\ndiscussion at Washington.<br />\ning Friday. Comprehensive plans<br />\nAll letters intended for publication<br />\non<br />\nink<br />\nid<br />\nwritten<br />\nconcise,<br />\nbe<br />\nmust<br />\nall who voted \"aye\" had<br />\nCertainly<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at v\\ ere discussed and an interesting<br />\nregular letter size paper, on one side<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nof<br />\nAct<br />\nunder<br />\nthe<br />\nonly.<br />\nMd.,<br />\nmatter due consideragiven<br />\nBaltimore,<br />\nprogram arranged for the present<br />\nNu attention will be paid to anonyan<br />\nas<br />\nJohns<br />\nsigned<br />\nof<br />\nMimes<br />\nstudents<br />\nbut<br />\nletters,<br />\nwere<br />\nand<br />\nprepared to give<br />\ntion<br />\nmous<br />\nPublished semi-weekly from October to June by the<br />\nyear. The meeting closed after a<br />\nevidence of good faith will not be<br />\nHopkins University.<br />\nprinted if request is made that they be logical reasons for desiring disspirited and informal discussion of<br />\nomitted.<br />\nBusiness communications should be addressed to the BUSINESS MAN- disarmament.<br />\nThe publication of a letter is not to armament. Surely they did not<br />\ncommunications<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nUNIVERSITY;<br />\nbe taken as an indorsement of its views<br />\nAGER, JOHNS HOPKINS<br />\n\"The News-Letter, which invites the vote for disarmament simply beby<br />\na<br />\nis<br />\nClub<br />\nScience<br />\nSocial<br />\nThe<br />\nEDITOR.<br />\nshould be sent to the MANAGING<br />\nfreest discussion of matters of general<br />\ncause in their ingenuous ignorance<br />\nsubtreating<br />\ninterest.<br />\norganization,<br />\nserious<br />\nHomewood 100<br />\nTelephone<br />\njects of social, economic and po- AN ADVOCATE FOR DISARMAMENT of the selfish policies of politicians<br />\nBusiness Manager:<br />\nand the duplicity of statesmen,<br />\nEditor-in-Chief:<br />\nlitical significance. The object of Editor of the News-Letter.<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nthey<br />\nwere bamboozled by a sugpotent<br />\nall<br />\nwith<br />\ndeal<br />\nto<br />\nis<br />\nthe club<br />\nDear Sir:<br />\nActing Managing Editor:<br />\nphrase!<br />\nary<br />\ncatchpenny<br />\nenmanner,<br />\nunbiased<br />\ntopics in an<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nEducation tends to broaden a<br />\n\"nay\" need<br />\nvoted<br />\nThe<br />\nfew<br />\nwho<br />\ninformation<br />\ndeavoring to obtain all<br />\nGLOVER P. FALLON, '23.<br />\nman's view of the world and its not be considered. They were too<br />\nAssociate Editors:<br />\npro or con on a subject, and draw<br />\nEDWARD G. HUEY, '22.<br />\nAdvertising Manager:<br />\naffairs and movements. An ed- obviously R. 0. T. C. propaganELI FRANK, JR., '22.<br />\nconclusions free from prejudice.<br />\nDONALD K. VANNEMAN, '23.<br />\nucated person can look upon these dists.<br />\nThe club, though organized priJunior Editors:<br />\nAssistant Business Managers:<br />\nthings from an advantageous<br />\nThe writer, who did not vote,<br />\nCHARLES C. MARBURY, '22.<br />\nmqrily for those students interested<br />\nBERNARD C. HEARN, '23.<br />\nviewpoint and can express his confesses that he knows nothing<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nin political science, political econJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nopinion intelligently and with about disarmament other than<br />\nFITZGERALD DUNNING, '24.<br />\nCRAIG E. TAYLOR, '24.<br />\nomy, and history, is opened to<br />\nsome confidence. Under modern what he has learned from the<br />\neveryone. The club is composed of<br />\nconditions the university is the sometimes authentic fables in the<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nprofessors and graduate students, as<br />\ntemple of learning and it is from newspapers. He believes none but<br />\nwell as undergraduates, and matters<br />\nthere that we expect our superior diplomats of, say, twenty years'<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nof public interest are studied in a<br />\npeople to come.<br />\nexperience are qualified to submit<br />\nco-operative manner. Excellent opIn European universities these opinions on this great issue.<br />\n1921<br />\n25,<br />\nBALTIMORE, MD., OCTOBER<br />\nportunity is thus afforded to all<br />\nexpectations have been fulfilled;<br />\nHe believes moreover, that the<br />\nstudents interested •in the more<br />\nall the cultural and humanitarian opinion of the student body of<br />\nlife<br />\nTHE PRINCETON CONFERENCE<br />\nnational<br />\nof<br />\nquestions<br />\nserious<br />\nmovements have been started and Johns Hopkins is fully as valuable<br />\nstudy advantageously these probto<br />\nled to a great extent by university as that formulated by any college<br />\nIn a short while the leading colleges of the country will send<br />\nlems with men of similar tastes.<br />\nmen. Gradually the American uni- to be represented at the Princerepresentatives to the Princeton conference to discuss the momentous<br />\nThe club, besides conducting disversities are also attaining this ton assembly. The conference,<br />\nissue of the day—Limitation of Disarmaments.<br />\ncussion groups, arranges lecttires<br />\nof authority in American therefore, should evoke a volume<br />\nposition<br />\nwill<br />\ninflumeeting<br />\nIt is not thought that the outcome of this<br />\nby men of prominence. The secrestatement is proved of childish blather scarce equalled<br />\nThis<br />\naffairs.<br />\nence to any great extent the delegates to the international conference tary is now negotiating with Mr.<br />\nconveniton of col- in the history of a<br />\ncoming<br />\nthe<br />\nby<br />\nin Washington. It will, however, serve to cast a shadow of coming Daniel Willard, Senators France<br />\ncountry noted<br />\nthe disarmament for the blather of its<br />\non<br />\nstudents<br />\nlege<br />\nevents. The college man of today is the leader of tomorrow and will and Borah, Mr. Plumb and Dr.<br />\ngreat men.<br />\nshape the destinies of the nation in days to come. We should watch Morse, having already secured sev- question at Princeton.<br />\nAfter the puerile Princeton<br />\nThe disarmament question is pow-wow and the wool-pulling<br />\nthis conference of college leaders with deep interest, as a prophecy eral to address the club. Following<br />\nthe world in the face and wrangling of the<br />\nstaring<br />\nof our nation's future policy in international affairs.<br />\nlearned landeach lecture, the club discusses the<br />\nit is the college men who are best grabbers at Washington<br />\nwarfare<br />\nmain points of the address.<br />\nequipped to answer it. It is they will be resumed at the<br />\nold stand<br />\nThe principle study of the club<br />\nwho appreciate the importance of as usual.<br />\nTHE BAND AND THE R. 0. T. C.<br />\nthis year will be disarmament and<br />\npeace in the advancement of civiCriticus.<br />\nAt last our R. 0. T. C. unit bids fair to become complete. Al- railroad problems, and taxation ad- lization and I am sure that they<br />\njustment.<br />\nready a model government battalion, with the addition of the student<br />\nwill realize that it is only disarmaband, we shall have an organization that will stand an \"A-No.1\"<br />\nment that will bring about a sem- Editor of Johns Hopkins NEWSPHYSICAL TRAINING GAINING IN<br />\nLETTER.<br />\nchance of rating first this year on the coveted distinguished list.<br />\nblance of peace at least for the<br />\nPOPULARITY<br />\nSir: Why is it that in reDear<br />\nthat<br />\nplan<br />\nnew<br />\nany<br />\nfor<br />\nopen<br />\nMajor Garey always has his eyes<br />\npresent time.<br />\nthere is such a conspicyears<br />\ncent<br />\ntraining,<br />\nthat<br />\nirksome<br />\nPhysical<br />\nbest<br />\nthe<br />\nbe<br />\nwill tend to better the unit, and this new idea seems to<br />\nFor Disarmament.<br />\nof University emabsence<br />\nunder<br />\nnow<br />\nis<br />\nwell<br />\nuous<br />\nire<br />\nprovoker,<br />\nhis<br />\n0.<br />\nR.<br />\nthat he has yet sprung, for at the same time that he helps<br />\nof<br />\nrooting secnumber<br />\nthe<br />\nin<br />\nHopkins<br />\nthe<br />\nblems<br />\nway,<br />\ngreat<br />\ndespite<br />\nfin4nT. C. unit he is materially aiding the band by giving them the<br />\nblack and<br />\nthe<br />\nfirst<br />\nabsences<br />\nthat<br />\nIt<br />\nduring<br />\nthe<br />\ntrue<br />\ntion?<br />\nis<br />\nrecorded<br />\ncial support of the United States Goyernment.<br />\nBELIEVES SHERMAN WAS RIGHT<br />\nweek. Now, however, the attendblue caps of the freshmen give a<br />\nance is more nearly up to par, due To the Editor of the News-Letter. decided note of color and spirit to<br />\nno doubt to the drastic punishment Sir:<br />\nthe stands, but how about some penCOME ONE, COME ALL<br />\nAssembly<br />\nthe<br />\nnants. Everybody present at the<br />\nI was present at<br />\noutlined by Dean Latane to be<br />\nThe editors learn with sorrow of the consternation caused upon meted out to those who cut the last Thursday when the invitation Hopkins-Dickinson game could not<br />\nthe Goucher campus by Article 19 of the Hopkins Credo which ap- course.<br />\nto the Princeton Disarmament help but notice the enormous red<br />\npeared in a recent issue. Dame Rumor hath it that sundry and variThe men in the class have been Conference was read and accepted. and white banner that opposing<br />\nous groups of beautious maidens gathered together with wails of detailed into three sections or Now, sir, while I think their mo- rooters had stretched across their<br />\nprotest concerning the way they had been slandered.<br />\nsquads. The few Juniors taking tive is admirable, I believe that stand. Also, several smaller DickWe are from Missouri and our office is open from 12:30 to 4 the course and the Sophomores the idea of preventing wars by inson pennants were noticed. Now<br />\nhow about a few pennants in the<br />\nmake up one section, while the re- disarmament is hopeless.<br />\nevery Tuesday and Friday.<br />\nmaining two are composed entirely<br />\nI am sure that you will agree future, especially at the St.<br />\nof Freshmen.<br />\nwith me, and I am particularly John's game. If the fellows think<br />\nSTUDENT RELIEF WORK<br />\nIn spite of the almost universal sure that the members of the R. that it is beneath their dignity to<br />\ngrumbling, the men go through the 0. T. C. will, when. I tell you carry pennants, then let them proLast week in an article in the News-Letter something was told<br />\nexercise with vim and vigor, very that General Sherman sure said a cure some and let the girls wave<br />\nof the urgent need and the great opportunity presented by the Stu- few<br />\ncases of downright rebellion mouthful. But the way to prevent them. Besides, it is the fellow's<br />\ndent Relief work. It is an opportunity that should not be allowed to<br />\nhaving developed. And, needless war is to be ready to fight when place to yell, and girls with weak<br />\ngo unused. The time to help a fellow and have him appreciate it is<br />\nto say to those familiar with the the time comes, not by laying goices can do the waving. If any of<br />\nwhen he is down. This is really the position of a vast number of army<br />\nofficers in charge of the class, down all means of defense to do he men do not know where to get<br />\nEuropean students today. They are struggling but the odds are these have been<br />\npromptly squelched. that is to invite war.<br />\n. H .U. penpants they might try<br />\nheavy and a little timely aid will be of great help to them and produce<br />\nMany men have escaped physical<br />\nYes, let us have peace by all kndy-Landy and Co., where a coma lasting impression of the friendship that the other students of the training by trying for athletic means (Freshmen and Sopho)lete stock is carried. Anyway, get<br />\nworld hold toward them.<br />\nteams, but for anyone not in earnest mores please note), but let us also them somewhere, and let's see a<br />\nDr. Friedrich Hertz, of the State Department of Austria, writes this is merely a leap from the fry- be prepared to keep that peace, bunch of them waving at the St.<br />\nas follows in regard to the work done last year by the Student Friend- ing pan into the fire; for accurate for a satisfactory agreement on John's game.<br />\nship Fund: \"Thousands of hopeful young people are being saved records of the attendance at the universal disarmament will never<br />\nBLACK AND BLUE.<br />\nthrough your work from extreme misery which otherwise would field are kept, and no trifling is be reached in this world.<br />\nprobably break their mental and moral energy. If they should suc- countenanced.<br />\nA GOOD SUGGESTION<br />\nAnti-Disarmament.<br />\ncumb this wOuld mean the disappearance of forces indispensable for<br />\nBut in the final analysis, no one<br />\nEditor of the NEWS-LETTER:<br />\nany reconstruction in our country. It is a wonderful manifestation seems to have any definite comFor several years<br />\nDEAR SIR:<br />\nof a truly Christian spirit for bringing about reconciliation and plaint against P. T., and on the surbeen criticism of<br />\nalways<br />\nhas<br />\nhere<br />\nA<br />\nREALLY<br />\nVOTE<br />\nWAS THE<br />\nbrotherly co-operation.\"<br />\nface, at least, the grouching appears<br />\nlie manner in which class elections<br />\nTHOUGHTFUL ONE<br />\nThis is the cool estimate of a man who is used to the realities of attributable to a natural inclination<br />\nheld. Some of the classes<br />\nTo the Editor of the Johns Hop- are<br />\nlife,—not a dreamer or sentimentalist. He simply sees that his coun- to \"kick.\"<br />\nhold their elections by standing vote<br />\nkins News-Letter.<br />\ntry is in desperate straits and that this work is an important factor<br />\nand some by ballot; some require<br />\nin its salvaging. Can't we realize that the salvation of these countries, First Attorney—Your Honor,<br />\nthe<br />\nthat<br />\nopinion<br />\nof<br />\nthe nominations a week before the elecNow<br />\nthough far away in distance, is intimately connected with the future unfortunately I am opposed by an student body on the disarmament tion, while others have both nomof our own land ?\"<br />\nunmitigated scoundrel.<br />\nquestion has been ascertained the inations and the election at the same<br />\nOur own Alma Mater owes a tremendous debt to many of the<br />\nSecond Attorney—My learned local delegates to the Princeton meeting. In my class, nominations<br />\ninstitutions that are being aided, not only for preserving and trans- friend is such a notorious liar—<br />\nconference will be able to speak are made one week and the followmitting the learning of the past, but for training many of the present Judge (sharply)—The counsel for our college with fully as high ing week elections are held by a<br />\nmembers of the faculty.<br />\nwill kindly confine their remarks to a degree of intelligence as was standing vote on each man. This<br />\nLet's do something to repay that debt and help in the recon- such matters as are in dispute.— manifested by the said student nethod undoubtedly produces perVirginia Reel.<br />\nContinued on page 4, col. 3<br />\nbody in making the decision.<br />\nstruction of the world.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\nSOCIAL SCIENCE CLUB HOLDS<br />\nINITIAL MEETING<br />\n<br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br />\n<br />\nWho's Who at J. H. U.<br />\n<br />\nBILL SCHMEISSER ADDRESSES<br />\nLACROSSE CANDIDATES<br />\n<br />\n3<br />\n<br />\nCOTILLON BOARD TO ARRANGE<br />\nFOOTBALL TEA DANCES<br />\n<br />\niORTMAN'S<br />\n\"Queen<br />\n<br />\nMt. Vernon 4999<br />\n<br />\nAt a meeting of the Cotillon<br />\nQuality\" Home Made<br />\nLacrosse practice is now being Board<br />\nheld on last Thursday it<br />\nChocolates<br />\nheld three days a week at Homewas decided to take over and con- VISIT OUR ICE CREAM PARLORS<br />\nwood under the guidance of \"Bill\"<br />\n1921-1922<br />\nduct the football tea dances inau518 N. CHARLES ST.<br />\nCommercial Photography<br />\nSchmeisser and Captain \"Joe\" Zol- gurated<br />\nby<br />\nthe<br />\nInterfraternity<br />\nOMICRON DELTA KAPPA<br />\nler at 4:30 o'clock. All of the old<br />\nCircuit Photography<br />\nBoard. The first of these dances<br />\nPresident, Joseph C. Thompson; men not playing football have reFlash Lights<br />\nViews<br />\nwill be held after the Haverford<br />\nCharles and 22nd Sts.<br />\nSecretary, Robert C. Hall; Mem- ported and in addition many new<br />\nEnlargements<br />\ngame on November 5 and will be Delicious Sodas and Sundaes Groups<br />\nbers, Douglas Cotton, Andrew men of promising calibre are out<br />\nKODAK FINISHING<br />\nfollowed by similar functions after<br />\nThe Best of Candies<br />\nfor the team. Schmeisser appeared<br />\nXnecht, Davidge Rowland.<br />\nthe St. John's and Washington<br />\nPrompt & Efficient Service<br />\n325 N. Howard St.<br />\nat practice last Wednesday and<br />\nSTUDENT COUNCIL<br />\nand Lee games. The University<br />\nPresident, Richard M. Wood; talked to the candidates, giving orchestra will furnish the music<br />\nSecretary, Gilson Engel; Seniors, them some of the rudiments of the and punch will be served. An adRobert Hall, Gilson Engel, Andrew game. It is essential that every mission of 50 cents per couple will<br />\nST: PAUL & 24th STS.<br />\n1 W. University Parkway<br />\nICriecht ; Juniors, John Marchant, man hoping to make the team re- be charged and to keep the C. E.<br />\nC. D. Wolfe, Prop.<br />\nDonald Vanneman ; Sophomores, port regularly for practice, as the Hall from being overcrowded the<br />\nOpposite J. H. U. Athletic Field<br />\nfall practice in stickwork is a very<br />\nEdward Morrison.<br />\nticket sale will be limited to one DELICIOUS SODAS & SUNDAES DRUG STORE for J. H. U. BOYS<br />\nimportant part of the work. There<br />\nMade With<br />\nATHLETIC BOARD<br />\nhundred tickets. It is absolutely<br />\npositions for new men and the<br />\nPHONE, HOMEWOOD 2121<br />\nJersey Special Ice Cream<br />\nPresident, Andrew H. Knecht; are<br />\nasserted that every man intending<br />\n\"The Velvet Finish\"<br />\nopen to every one. It is<br />\nare<br />\nplaces<br />\nSecretary, S. Atherton Middleton.<br />\nto attend these dances purchase<br />\nurged by Captain Zoller and Mantheir tickets in advance as no one KODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\nVARSITY SEAL VOTING COUNCIL<br />\nager Hensel that all new men stick will<br />\nbe admitted without a ticket. Whitman's Chocolates and Bon Bons<br />\nChairman, H. Douglas Cotton;<br />\nfor the Boys<br />\nout for their respective jobs, as<br />\nThese tickets will be on sale by<br />\nSecretary, Frederick W. Lipps.<br />\nevery job is open.<br />\nmembers of the board and will be<br />\nFOOTBALL<br />\nOUR ALMA MATER SONG<br />\nORDERS RECEIVED FOR<br />\navailable<br />\nin a few days.<br />\n, Manager.<br />\nCaptain,<br />\nVERITAS VOS LIBERABIT<br />\nPRINCETON INVITES 71 UNIFurther<br />\nplans<br />\nwere<br />\nmade<br />\nfor<br />\nCOGGINS'<br />\n1-1. Pierce Brawner.<br />\nTruth guide our University,<br />\nVERSITIES TO ATTEND<br />\nChristmas<br />\nthe<br />\nCotillon<br />\nAnd<br />\nfrom<br />\nwhich<br />\nwill<br />\nall<br />\nerror<br />\nkeep<br />\nher<br />\nfree;<br />\nTransfer<br />\nand Baggage Express<br />\nCONFERENCE<br />\nLACROSSE<br />\nLet wisdom yield her choicest treasure,<br />\nbe<br />\nheld<br />\neither<br />\nthe<br />\n22nd<br />\nor<br />\n23rd<br />\nAnd<br />\nof<br />\nfreedom<br />\nreach<br />\nher<br />\nfullest<br />\n•<br />\nmeasure;<br />\nAUTOMOBILE<br />\nSERVICE<br />\nCaptain, Joseph Zoller ; Manager,<br />\nContinued from page 1, col. 5<br />\nOh, let her watchword ever be<br />\nDecember.<br />\nIt<br />\nis<br />\ncertain<br />\nnot<br />\nwhat<br />\nThe<br />\n.truth<br />\nof<br />\nGod<br />\nwill<br />\nmake<br />\nPHONE,<br />\nyou<br />\nfree,<br />\nHOMEWOOD<br />\n2645-W<br />\nnoward Hensel.<br />\nto endow nearly three universities<br />\nWill make you free!<br />\nthe subscription to this will be<br />\nthe size of Johns Hopkins. This,<br />\nBASEBALL<br />\nLet knowledge grow from more to more,<br />\nas yet, but this will be decided at And<br />\nscholars versed in deepest lore,<br />\nCaptain, Andrew H. - Knecht; he believes, is a fine illustration the next<br />\nTheir<br />\nsouls for light forever burning,<br />\nmeeting when further Send forth<br />\ntheir fire, unlock their learning', \"Say you,\" yelled his Satanic Mato bring home to the public, the<br />\nManager, Edward G. Huey.<br />\nAnd<br />\nlet<br />\ntheir<br />\nfaithful teaching be<br />\njesty' as a newly arrived soul saunplans are made.<br />\nThe truth alone can make us free,<br />\nenormous expenditures being<br />\nTRACK<br />\nCan make us free!<br />\ntered casually across the red-hot<br />\nShe (to fair friend)—I'm not The truth shall crown her sons with fame, cinders. towards him, \"what do you<br />\nCaptain, Joseph C. Thompson; made throughout the world to<br />\nTheir lives inspire with nobler aim,<br />\nmaintain armaments. Dr. Good- going with Harry any more:<br />\nManager, William R. Fortney.<br />\nTheir names make known throughout our mean by acting like that? Do you<br />\nborders,<br />\nnow also believes that it is a very<br />\nFair Friend—Why not?<br />\nAs learning's guide and wisdom's wardens; think you own Hell?\"<br />\nBASKET-BALL<br />\nThen<br />\nlet their watchword ever be<br />\nwise thing to start a pro-disarma- She—He knows too many naughThe truth for aye shall keep us free,<br />\nCaptain,<br />\n; Manager,<br />\n\"I ought_ to,\" replied the adShall keep us free.<br />\nment movement among young ty songs.<br />\nJ. Brentnall Powell.<br />\nWM. L. DEVRIES. dressed gentlemen in a grieved<br />\ncollege men and he is glad to find<br />\nFair Friend—Does he sing them?<br />\nMOTTO..<br />\nSWIMMING<br />\nthat the movement has proved<br />\nThe motto of the University, \"Veritas yoice,\" my wife was giving it to Me<br />\nShe—No, but he's always whist- vos.<br />\nliberabit,\"<br />\nmay<br />\nbe found in John 8:32. -ight along.\"--Woo Doo.<br />\nCaptain, Paul Buhrer ; Manager, interesting to Hopkins men es\"The truth shall make you free.\"<br />\nling them.—Exchange.<br />\n1)avidge Rowland.<br />\npecially.<br />\nThe Student Council has apTENNIS<br />\npointed<br />\nas the Hopkins delegates<br />\nCaptain and Manager, Wilson<br />\nr-)uffy.<br />\nthe<br />\nto<br />\nPrinceton Conference two<br />\ncapable men, Gilson Engel and<br />\nCROSS COUNTRY TEAM<br />\nWilliam Randall. They will repCaptain, W. H. Somerville.<br />\nresent our interests there and tell<br />\nNEWS-LETTER<br />\nof the almost unanimous vote in<br />\nEditor-in-Chief — H. Douglas<br />\nfavor of the disarmament prinCotton; Business Manager, Fredciple which was voiced at Thurserick W. Lipps.<br />\nday's assembly.<br />\nHULLABALOO<br />\nThe list of 71 universities which<br />\n. Editor-in-Chief, R. Dorsey Wathave been invited to send deleBusiness Manager, Edward gates to Princeton is as follows:<br />\n('• Huey.<br />\nAllegheny, Amherst, Boston,<br />\nBLACK AND BLUE:<br />\nTAY<br />\nBrown, Bucknell, Carnegie Tech,<br />\n‘ Editor-in-Chief, Lawrence B. Catholic University, Clark, Colenneman ; Business Manager, H. gate, University of Chicago, Columbia, Cornell, Dartmouth, Dela1)ouglas Cotton.<br />\nware, Dickinson, Drexel Institute,<br />\nDAILY BULLETIN<br />\nTHE TURKISH CIGARETTE<br />\nEditor, H. Douglas Cotton; Bus- Episcopal Divinity School, FordInes Manager, Donald K. Vanne- ham, Franklin and Marshall, General<br />\nEvery day MURADS are held<br />\nTheological<br />\nSeminary,<br />\nGeorge Washington, Georgetown,<br />\nhigher<br />\nin the estimation of the men<br />\nDRAMATIC CLUB<br />\nHamilton, Hartford Theological<br />\nwho smoke them.<br />\nPresident—Gilson Engel; Secre- Seminary,<br />\nHarvard<br />\nDivinity<br />\ntary, Eli Frank, Jr.<br />\nSchool, Harvard, Haverford, HoThey are the standard of Taste.<br />\nMUSICAL CLUB<br />\nbart, Holy. Cross.<br />\nThey never disappoint—never<br />\n7.* President, R. Waldo Hambleton ; Johns Hopkins, Lafayette, Lebiusiness Manager, Hugh Small- high, Manhattan, Maryland Colfail—never<br />\nchange—<br />\n---mva<br />\nwood.<br />\nlege, Maryland University, Mas\"<br />\n1<br />\nThey are 100% pure Turkish tosachusetts Tech., Middlebury,<br />\nBAND •<br />\nbacco—ofthe finest varieties grown.<br />\nMuhlenburg, City College of New<br />\nDirector, Emil Smith.<br />\n.........7.<br />\nYork, New York University,<br />\ni:t....21,7\":471.1<br />\nDEBATING COUNCIL<br />\nESPECIALL1.0.14FOR T<br />\nYou are proud to smoke them<br />\n.IIIIIIIIIIIII<br />\nPreSident, R. Dorsey Watkins; Pennsylvania College, Pennsyl...<br />\nMADE<br />\nEXPERIEVIC<br />\nPRE<br />\n....<br />\nz<br />\nvania Military College, Penn<br />\nin any company—on any occasion.<br />\nIIISCRIWIIKTING AtIO<br />\nSecretary, Lawrence<br />\nGRADE:7_<br />\nB. Fenneman.<br />\nHIGH<br />\nww.<br />\nState, University of PennsylvaSMOKER Of CIGARETTES-'TURKISH<br />\nINTERFRATERNITY BOARD<br />\nThey are the largest selling highnia, Pittsburgh, Pratt Institute,<br />\nPresident, Gilson E. Engel; Sec- Rensselaer Polytechnic<br />\nIheblendm<br />\n..,...,,,,,..,..4d ,,,firt.,.„... ,...,<br />\nInstitute,<br />\ngrade<br />\ncigarette in the world.<br />\nIsexcatio<br />\nretarY, Richard M. Wood.<br />\nRhode Island State, Rochester<br />\nThe cigarette smokers ofAmerica<br />\niiiiiiiiiiiiiiiiiiiii<br />\nRutgers.<br />\nY. M. C. A.<br />\nif, -gip*<br />\nInstitute,<br />\nNStevens<br />\nSusquehanDO prefer Quality to Quantity.<br />\nII<br />\nPresident, Leroy Baughman;<br />\nSecretary,<br />\nPaul Stevens; General na, Swarthmore, Syracuse, TemS.ecretary,<br />\nCharles S. Sydnor ; As ple University, Trinity, Tufts,<br />\n\"Judge for Yourself !<br />\n\"<br />\n41stant General Secretary, Vertrees Union, Villa Nova, Virginia,<br />\nWashington and Jefferson, WashWYekoff.<br />\nington<br />\nand Lee, Wesleyan, Yale,<br />\nZIONIST SOCIETY.<br />\nAndover<br />\nTheological Sem;nary.<br />\nPresident, M. H. Rosenfeld;<br />\nS<br />\necretary, A. L. Finesinger.<br />\nMr. Slow (at the wheel)—You<br />\nmust be cold, don't you need someITPPe---What is a hypocrite?<br />\nthing around you?<br />\n.Stares—He is a man that goes<br />\nMiss Speed—Yes, dear, but let's<br />\nto<br />\n&darks\";<br />\n11114Years with a smile on his face.— wait until we get a little further out<br />\nPunch Bowl.<br />\nin the country.—Mink.<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nThe College Drug Store R.G.Loy.& Company<br />\n<br />\nMURAD<br />\n<br />\n20<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nATTENTION ALUMNI!<br />\n<br />\nIt's time for a<br />\n<br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br />\n<br />\nbeXatteri4<br />\nCt<br />\nH.St OSCAR G.1-5Nri<br />\n‘j41'.1<br />\nOWN ERS<br />\n<br />\n.7%<br />\n<br />\n°<br />\nr4P*<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPriniers of the<br />\n•<br />\nJohns Hopkins News-Letter<br />\n<br />\nCollege Literature<br />\n<br />\nThe News-Letter, as you know, is edited and published bY<br />\nthe students; it gives the University news, and it gives all of it.<br />\nDuring the last few years in which the University has been<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to give advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\nfor the benefit of those unable to attend. We know you are interested in Hopkins' activities, in the progress of the dorms, in<br />\nthe football team, lacrosse team, debating team, Dramatic Club,<br />\netc. Perhaps you were a member of one of our championship<br />\nlacrosse teams—at any rate, you cherish fond memories of your<br />\ncollege days, and you have an interest in the activities of today<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br />\nName<br />\n<br />\nFALL SUIT<br />\n<br />\nWe're ready<br />\n$30 up<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\n<br />\nURNER BROTHERS<br />\nIII E. BALTIMORE STREET<br />\n<br />\nHess Shoes<br />\n<br />\nLEMMERT<br />\n<br />\nWYMAN<br />\n<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\n<br />\nBALTIMORE<br />\n<br />\nDANCES<br />\n<br />\nTelephone St. Paul 6987<br />\n<br />\nAddress<br />\nBLACK AND BLUE JAY TO APPEAR very fine cellist, who is to play in<br />\nSHORTLY<br />\nthe orchestra, but there are places<br />\n<br />\nThe first issue of the Black and for<br />\n<br />\nTHE COLLEGIATE DICTIONARY<br />\n<br />\nseveral<br />\n<br />\nmore.<br />\n<br />\nPlayers of<br />\nwoodwinds are also in demand. Musicians who have conflicts with physical training should attend rehearsals after the physical training hour,<br />\nand after a few weeks it is hoped<br />\nthey will be given an opportunity<br />\nto devote more time to the rehearsals.<br />\n<br />\nWORK ON HULLABALOO STARTED Blue Jay will be<br />\npublished in a few stringed, bass, flute, and<br />\n<br />\nWithin the next few days a roll<br />\nALLOWANCE—See Quicksilver.<br />\nBLOWOUT—A small body of men of the Senior class will be posted<br />\nSyn., in the basement of Gilman Hall.<br />\nsurrounded by liquor.<br />\nThe editor of this year's Hullabaloo,<br />\nHeadache.<br />\nR. Dorsey Watkins, requests that<br />\nCHORUS—Outside research.<br />\nCLASS—Indirect cause of inter- all Seniors will carefully look this<br />\nover and make any corrections or<br />\nrupted sleep.<br />\nthat may be necessary.<br />\nadditions<br />\ncause.<br />\nCLOCK--Direct<br />\nimportant, for this roll<br />\nvery<br />\nis<br />\nThis<br />\npass;<br />\nCOURSE-1. Those that you<br />\nas a Hullabaloo<br />\nboth<br />\nserve<br />\nwill<br />\n2. The rni..en ones.<br />\nrecord.<br />\nclass<br />\na<br />\nand<br />\nCUT—To sleep. Overcut: See<br />\nAll men who are trying out for<br />\nDean.<br />\nDATE-1. Another evening gone. the art and editorial staffs of the<br />\n2. Something to be added in the Hullabaloo must hand in their contributions to Watkins by next<br />\nterm bill for Dad.<br />\nDICTIONARY — Reference good Thursday at the latest.<br />\nThe official photographer for the<br />\nfor $20 from Father.<br />\nthis year will be Mrs.<br />\nreceipt.<br />\n'Hullabaloo<br />\nDIPLOMA—The paternal<br />\nHamilton street, who<br />\nprof.<br />\n5<br />\na<br />\nBennett,<br />\nFLUNK—To displease<br />\nindividual and group<br />\nboth<br />\nGAMES-1. Those that you lose .vill take<br />\nIndividual photoat; 2. Those that the team wins. )hotographs.<br />\nGRIND—A bird who thinks col- graphs are being taken now and<br />\nlege is a Preparation for Life's orders for these may be secured<br />\nfrom E. G. Huey.<br />\nBattles.<br />\n<br />\ndays. The business staff has announced its intention of following<br />\nlast year's policy in allowing students to obtain subscriptions for<br />\nfriends at greatly reduced rates.<br />\nThose desiring to take advantage<br />\nof this offer should hand in their<br />\nfriends' addresses, together with<br />\ntheir own, to Box 545, or to NEWSLETTER office. The price is $1.25<br />\nfor six issues, which is due January 1st.<br />\n<br />\nVIRGINIA NOSES OUT HOPKINS<br />\nIN A CLOSE, WELL-PLAYED<br />\nGAME<br />\nContinued from page 1, col. 5<br />\n<br />\nALL BY OURSELVES ON THE<br />\nGRIDIRON<br />\n<br />\nAll by ourselves on the gridiron,<br />\nOut here on Homewood Field;<br />\nPep, power and teamwork are<br />\nqualities,<br />\nBut we've more than these<br />\nTouchdown specialties—rah!<br />\n<br />\nTrick plays and those forward<br />\npasses—<br />\nLOVE—See Cynic.<br />\nthey always go through.<br />\nOur<br />\nstunts,<br />\nPASS—To do work satisfactorily.<br />\nA GOOD SUGGESTION<br />\nto put that ball right<br />\ngoing<br />\nWe're<br />\nPROF-1. Those that are prejuContinued from page 2,col. 5<br />\nSt.John's goal line.<br />\nof<br />\nback<br />\ndiced; 2. Those that pass you.<br />\nthen nine<br />\nand<br />\nninety<br />\nScore<br />\nTeach a Lesson in Style<br />\nPROHIBITION—Cause of the H. fi ectly fair results, but still it lacks<br />\nFor J. H. U.—year team!<br />\nC. L.*<br />\nThey possess the \"dash\" that<br />\n.he element of secrecy that an elecappeals to college men, toned<br />\n—ANONYMOUS.<br />\nSTUDE—One who does his best -ion by ballot gives. I believe there<br />\ndown to distinctiveness. And<br />\nabout it, Volstead notwithstand- are conditions and circumstances<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\ning.<br />\ninder which a man feels compelled<br />\nORCHESTRA REHEARSE<br />\nN. HESS' SONS<br />\nTHEME—Something that some o vote for one man when he really<br />\nAt the initial rehearsal of the<br />\none else has pulled a B on that's Ashes another.<br />\n8 E. BALTIMORE ST.<br />\nCollege Orchestra in the Barn last<br />\ngood enough for you.<br />\nIt seems to me that the election Wednesday afternoon, a goodly<br />\nTHESIS—The reason you didn't<br />\nf Athletic Association officers in showing of fiddlers and several<br />\ntake the course.<br />\nspring is one after which those pianists made their appearance, beVACATION—Au excuse for see- the<br />\nclasses that have not already done sides several last year's members<br />\nMADE TO ORDER<br />\ning New York.<br />\nso, should model their elections. of the brass section. The practice<br />\nAND<br />\n\\VORK—A good word for home<br />\nThis would bring about a great sav- was immediately gotten under way<br />\ncorrespondence. See Fiction.<br />\nFINISHED CLOTHES<br />\ning of time and would make the and the results proved very encour*High Cost of Liquor.<br />\nelections much more systematic and aging to, Emil Smith, the director.<br />\nPLAZA BUILDING<br />\n—Ohio Wesleyan Mirror.<br />\nbusiness-like. Class elections should<br />\nThe members of the violin section<br />\nL. V.—Yes—<br />\n19 and 21 EAST FAYETTE ST.<br />\nbe standardized and the Student will all retain places ill the orchesC. F.—Bigamy.—Dirge.<br />\nCouncil should require that this tra if they attend rehearsals reg\"Is he lazy?\"<br />\nprinciple of vote by ballot be incor- ularly, but there must necessarily<br />\nSHOES<br />\n\"Lazy? Say, that fellow rides in<br />\nporated into the constitution of each be try-outs for the pianist's chair.<br />\na Ford car in order to save the effpr<br />\nincoming Freshman class.<br />\nIt is, therefore, desired that more<br />\nfort of knocking the ashes off his<br />\nplayers come out. Should the band<br />\nUNIVERSITY MEN<br />\nYours truly,<br />\ncigar.—Gargoyle.<br />\nreceive the government support<br />\nFor Sport Wear<br />\nFor Dress<br />\nR. B. that is hoped for, the pianists who<br />\nSmart Styles—Best Leathers<br />\nfail to make the place in the or Moderate Prices<br />\nHe—Saw Minnie with her new<br />\nchestra will be given first opporDuke.<br />\nme,<br />\ntickle<br />\nMaybelle—You<br />\ntunity to learn a band instrument<br />\nbathing suit under her arm.<br />\na<br />\nwhat<br />\nword,<br />\nDuke—My<br />\nThe<br />\nplay in the College Band.<br />\nand<br />\nstyle?—<br />\nlatest<br />\nthe<br />\nHim—Is that<br />\nschool boasts this year of a<br />\nThe<br />\nrequest.—Puppet.<br />\nstrange<br />\nChaparral.<br />\n19 W. LEXINGTON ST.<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\n<br />\nOf the Better Class<br />\n<br />\non Hopkins' 18-yard line. Dunn<br />\nand Oppleman worked the ball to<br />\nthe two-yard line. Foster carried<br />\nthe ball over for a second touchdown and Hall made his first failure of the season at goal kicking.<br />\nHopkins needed a touchdown and<br />\ngoal to win and immediately started<br />\nafter it. Markell, who substituted<br />\nfor Spinney when he was injured,<br />\nstarted the line plunging and had<br />\ncarried the ball to Virginia's 35yard line before Virginia gaine'l<br />\nthe ball on a pass, caught by Burge.<br />\nHopkins had lost her last chance<br />\nand the remaining short time<br />\navailed nothing.<br />\nAfter the game, \"Bill\" Totterdale<br />\nwas elected captain in place of<br />\n\"Bill\" Wood, who is now at West<br />\nPoint. Totterdale has been acting<br />\ncaptain this season and his choice is<br />\na popular one.<br />\nThe lineup :<br />\nHopkins<br />\nVirginia.<br />\nMiddleton<br />\nL.E<br />\nDavis<br />\nWesterman<br />\nL.T.<br />\nHall<br />\nMagill<br />\nL.G<br />\nShackelford<br />\nTotterdale<br />\nC.<br />\nHankins<br />\nLandy<br />\nR.G.<br />\nWard<br />\nKnecht<br />\nR.T<br />\nClarke<br />\nRich<br />\nRE.<br />\nMichie<br />\nDarley<br />\nQ.B<br />\nCarrington<br />\nR.H.B<br />\nCalkins<br />\nRinehart<br />\nL.H.B.<br />\nCoady<br />\nOppelman<br />\nWillis<br />\nF.B<br />\nDunn<br />\nScore by Periods<br />\nTotal<br />\nVirginia<br />\n7 0 0 6-13<br />\nJohns Hopkins<br />\n0 7 0 0— 7<br />\nSubstitutes—Virginia: Burge for<br />\nRinehart, Blackford for Ward, Cutchin<br />\nfor Shackleford, Stephenson for<br />\nMichie, Hayes for Hall; Hopkins—<br />\nSpinney for Coady, Markell for Spinney.<br />\nTouchdowns — Oppleman, Foster<br />\nMagill. Goals from Touchdown—Hall,<br />\nCalkins.<br />\nReferee—Hoban (Dartmouth). Umpire—Cosgrove (Cornell). Head Linesmen—Sanford (Dartmouth), and Haywood (South Carolina). Time of<br />\nPeriods-15 and 12 mniutes.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 7<br /><br />\nBALTIMORE, MD., OCTOBER 25, 1921<br /><br />\nREPRESENTATIVES OF STU- PRINCETON INVITES 71 UNI- BASKETBALL SCHEDULE IS<br />\nDENT ACTIVITIES ADDRESS<br />\nVERSITIES TO ATTEND<br />\nAWAITING SANCTION OF<br />\nSTUDENT ASSEMBLY<br />\nCONFERENCE<br />\nVARSITY CLUB<br />\nSeveral New Songs Introduced.<br /><br />\nris<br /><br />\nRE<br /><br />\n).<br /><br />\nng<br /><br />\nnd<br /><br />\nPrincipal Purpose of Coming Assembly<br /><br />\nProspects for a Good Team Bright.<br /><br />\nPRICE 5 CENTS<br /><br />\nVIRGINIA NOSES OUT HOPKINS<br />\nIN A CLOSE, WELL-PLAYED GAME<br /><br />\nHOPKINS MAKES 7 FIRST DOWNS TO VIRGINIA'S 3.<br />\nis to Stimulate Discussion of<br />\nAt the mass-meeting held last<br />\nAlthough it is not certain as yet<br />\nLimitation of Armaments.<br />\nMAGILL, CALKINS AND MARKELL STAR. BLACK AND<br />\nThursday in the C. E. Hall, Dick,<br />\nwhether the financial returns from<br />\nThe<br />\nprincipal<br />\npurpose<br />\nof the the football season will permit putWood, president of the Student<br />\nBLUE OUTPLAYED VIRGINIA THROUGHOUT THE<br />\nCouncil, announced that Johns coming intercollegiate conference ting out a basket-ball team this winGAME. TOTTERDALE ELECTED CAPTAIN.<br />\nHopkins had been asked to send a of Princeton University on the ter, the management is going ahead<br />\ndelegate to the Intercollegiate Con- subject of the limitation of arma- in arranging a schedule and makVirginia was saving what she had for Saturday's game with<br />\nference on the Limitation of Arma- ments is rather to stimulate dis- ing plans for the best basket-ball Princeton, but Hopkins forced the Orange and Blue reserves in a<br />\nments to be held next Wednesday cussion of the question in the col- season Hopkins has ever had. Up hard fought game on Lambeth Field, Charlottesville, Saturday.<br />\nat Princeton. In order that the leges than to seek to influence the t,)<br />\n- the present time, games have Showing improvement and playing the best game of the season,<br />\nHopkins delegate, who will be delegates to the Washington Con- been scheduled with Virginia, St. Johns Hopkins team was a worthy equal of the mighty<br />\nVirginia<br />\nchosen by the Student Council, ference. It has been decided, John's, Dickinson, Rutgers, St. eleven, and Virginia students agree that their team was outplayed<br />\nmight know the sentiment of the therefore, that the principal em- Francis of Brooklyn, Swarthmore throughout the game. None of the afternoon's touchdowns were<br />\nrestudent body, a rising vote on the phasis will be placed upon thp ad- and several other colleges of this sultant from straight football, hut good football was much in eviquestion was held. The result was dresses which will be made to the class. The uncertainty of whether dence. Both teams were unsuccessful at the passing game, with<br />\nthe<br />\nan overwhelming majority in favor assembled delegates by men a team will be sanctioned by the exception of a beautiful completion, Foster<br />\nto Oppleman for 35 yards.<br />\nOf limitation of armaments.<br />\nprominent in public life.<br />\nVarsity Club is some hindrance to<br />\nSo the game settled to line-plungarranging<br />\nas attractive a schedule DRAMATIC CLUB ENROLLS ing and occasional punts. The backis<br />\nunderstood<br />\nIt<br />\nthat<br />\namong<br />\nWood also announced that the<br />\nthe<br />\nRECORD NUMBER OF<br />\nFreshman activities buttons would speakers will be Franklin O'Olier, as might be possible, but it is begieldsi weighed about evenly, but<br />\nbe ready by next Wednesday and first national commandant of the lieved that if a team is really put<br />\nCANDIDATES<br />\nHopkins took more ground, gainthat they will be given out at the i1merican Legion, and Major Gen- on the floor they will have some<br />\ning seven first downs to Virginia's<br />\nAspirants for Dramatic Club Turn Out<br />\nNEWS-LETTER office in the Barn, eral John F. O'Ryan, a veteran of strong opposition.<br />\nhree. Clark's punts, averaging 40<br />\nin Full.<br />\nbetween 12:30 and 1 o'clock. H. both the Spanish-American and<br />\nBauernschmidt and Owings are<br />\nyards, gave Virginia the edge in<br />\nAll the Mansfields, Atwills, and kicking. Approximately 3,000 peoDouglas Cotton, president of the the World -Wars.<br />\nthe only men left from last year's<br />\nBarrymores<br />\nof the Freshman class ple sat in the big stadium and no<br />\nStudent Activities Council, said<br />\nThe<br />\nconference<br />\ncommittee team, but several men from the<br />\ncrowded<br />\nstudio in the Barn at more enthusiasm or noise was manthe<br />\nthat not only must the Freshmen wishes to make it clear that the Medical School are still available.<br />\nmeeting<br />\nthe<br />\nthe Dramatic Club, ifested by them than was shown by<br />\nof<br />\ncome out fdr activities, but they coming conference cannot hope Of these men, Wilson, Keye and<br />\nTuesday, the 18th. the small but loyal group<br />\n12:30<br />\nP.<br />\nM.,<br />\nmust also stay out regularly or they to sway in any manner the official Sanders played on last year's team. at<br />\nof HopFifty-eight<br />\nmen, many of whom kins followers, who cheered lustily<br />\nWill be reported and their buttons assembly which convenes in From the freshman team of last<br />\nhave had previous experience in for the Black and Blue. It was<br />\ntaken away.<br />\na<br />\nWashington in November, but year there is also some very good<br />\nmaterial<br />\nin<br />\nthe<br />\nshape<br />\nof Strouse, dramatics, signed up. This is the great game from the Hopkins<br />\nEmil Smith urged all men to at- that it is rather an effort to start<br />\ngreatest number of candidates for standpoint and well worth the jourtend the first meeting of the Social collegiate discussion upon the Hutzler, Martin,Marchetti and Ashminor production in the history of ney to witness. For Virginia,<br />\na<br />\nScience Club, which will be held in topic with the possible view, ulti- ton. Promising material in the<br />\nhe<br />\nclub.<br />\nBarge and Oppleman gained ground<br />\nRoom 112, Gilman Hall, at two mately, to the expression of opin- freshman class includes Turnbull,<br />\nGilsen Engle, president of the club, nicely, while Michie evidenced his<br />\nfrom<br />\nPoly;<br />\nPanetti,<br />\nfrom<br />\nCity;<br />\nthe<br />\no'clock, on Friday. No speaker has ion in the form of a straw vote.<br />\nSkinners and Towner, from addressed the men, expressing all-South Atlantic capacity for runbeen secured for this time, but sev- In such a vote, moreover, it would<br />\nFriends,<br />\nand several other good men )1easure at seeing so many out and ning to a sure tackle under the<br />\neral very prominent men have been be useless and vain to go into any<br />\nfrom other out-of-town prep )riefly stated the purpose of the punts. For Hopkins, McGill shone<br />\nbooked for later meetings. Fenne- details concerning what measures<br />\nschools. No coach has been ap- meeting. He urged all to exert when he blocked Clarke's punt and<br />\nr/Ian announced that the Black and should be taken toward limiting<br />\npointed as yet, but it seems sure themselves to the limit and help to recovering, ran 15 yards for a<br />\nBlue Jay would not be out until the armaments. It would merely be<br />\nhe should be able to pick a nake this a successful year for the touchdown.<br />\nthat<br />\nCalkins, Spinney,<br />\nend of the month, and that a meet- an expression in favor of or<br />\nclub.<br />\nwinning<br />\nteam<br />\nfrom<br />\nthis<br />\nmaterial.<br />\nWillis<br />\nand<br />\nDarley<br />\nshowed some exing of candidates for the editorial against the principle of the limiMr. Harry Morris, '20, chairman cellent line plunging in the<br />\nthird<br />\nand business staffs will be held next tation of armaments.<br />\n)f the Alumni Council of the period.<br />\nWhen substituted for<br />\nTuesday at the barn.<br />\nThere seems to be very much<br />\nCOACH LE CATO'S CHARGES<br />\nDramatic Club, spoke of the origin Spinney in the fourth quarter,<br />\nPierce Brawner asked for more comment, most of which is favorMAKING RAPID PROGRESS<br />\nof the club, its aims, and the high Markell broke Virginia's line for<br />\nmen who were willing to support .ble, on the coming conference and<br />\nliterary quality of the plays pre- three straight first downs.<br />\nA large number, perhaps a record<br />\nthe team by going down to Vir- during the past week letters have<br />\nsented in the past years.<br />\nat<br />\nthe University, are reporting<br />\nThe game in more detail:<br />\nginia in a special coach. He then been received by President HibThree one-act playlets are to be<br />\ndaily<br />\nto<br />\nCoach<br />\nLe<br />\nCato<br />\nat<br />\nHomeVirginia won'the toss and Clarke<br />\nrequested that the students sign a ben from many of the heads of the<br />\ngiven for the purpose of discoverNood Field for track work.<br />\nkicked<br />\nwell back of the goal, givPetition to be posted—in the base- various institutions throughout<br />\ning talent among the new men.<br />\nment at Gilman Hall, asking the the East in which they congrat- Only a few members of last Those who show exceptional worth ing Hopkins the ball on her own<br />\nBoard of Trustees to rent the first ulate Princeton for having taken year's squad were lost, by gradua- in the small plays will be given 20-yard line. Hopkins was forced<br />\nto kick. Both sides were unable to<br />\nfloor of the Barn to the Homewood a leading step in the disarmament tion and the veterans are augmented parts in the major production.<br />\nby<br />\nmany<br />\nnew<br />\ngain<br />\nmen,<br />\nsome<br />\nof<br />\nand another exchange of<br />\nwhom<br />\nissue.<br />\nAll of these men thoroughly<br />\nCompany when the present lease<br />\nThe following are the plays which<br />\nalready<br />\nare<br />\nwell<br />\npunts<br />\nknown<br />\nto<br />\nfollowfollowed. Coady's punt was<br />\nexpires. \"Due to the fact that the approve of that University's stand<br />\nwill be presented in December: \"A<br />\nof<br />\ners<br />\nHopkins'<br />\ntrack<br />\nblocked<br />\nactivities.<br />\nby Hall, of Virginia, and<br />\nHomewood Company went $4,500 and are willing to co-operate to<br />\nRoad House in Arden,\" a comedy;<br />\nMichie<br />\nrecovered,<br />\nHopkins stock took a consider- 'Death and Fever. Flats,\" a tragedy<br />\nrunning to Hopin the hole on athletics last year, their utmost in setting forth the<br />\nsome move to gain more revenue policy adopted by the intercolle- able rise when Vernon Booth, for- and a tragic comedy written by Jo- kins' 2-yard line. Oppleman made<br />\nthe touchdown on the second try<br />\nfor minor sports is imperative, oi giate convention. The idea of the mer star at Delaware College, and seph Moran, '23.<br />\nseveral minor sports must be dis- student conference has become so Perkins, the Cross Country Club<br />\nBesides parts in the plays the at Hopkins' line and Hall kicked<br />\ncontinued this year. The conces- popular in collegiate circles that half-miler, signified their intention candidates have opportunity to try goal. The remainder of the quarsion at the Barn gives an income many distant institutions to which of casting their lot with the Black out for the positions of assistant ter holds little interest. After some<br />\nof eight or nine thousand dollars,\" invitations had not been sent have nd Blue.<br />\nbusiness manager and assistant attempts at end running and an exchange of punts, we find Virginia<br />\nBrawner said, \"and as this comes already written the Princeton<br />\nManager \"Bill\" Fortney has not property men.<br />\nfrom the students there is no rea- Disarmament Committee inquir- completed the schedule, but rare<br />\nThe prospects of the club for the with the ball on her own 25-yard<br />\nson why it should be given to an ing just what the nature of the treats; are promised followers of coming year are exceptionally line. When Clarke attempted to<br />\noutsider, when it could be turned meeting will be.<br />\nthis branch of Hopkins activities. bright. Miss Clementine Walter, kick out of danger, Magill broke<br />\nthrough and succeeded in not only<br />\nback to support student activities.\"<br />\nAmong those who have ex- Present indications point to the the one person who has been mainly<br />\nblocking the punt, but recovered the<br />\nGil. Engel and Joe Thompson pressed their hearty approbation most successful track season ever responsible for the great success ball<br />\nand raced across the intervenof the past productions, has anof the movement are Pres. Alder- experienced at J. H. U.<br />\nthen took charge of the meeting<br />\ning<br />\n18 yards for Hopkins' lone<br />\nman of the University of Virginia, The candidates for the cross- nounced her intention of again filland outlined several stunts that will<br />\ntouchdown.<br />\nCalkins kicked goal.<br />\ning the chair of coach. Miss Walter<br />\nPres. H. A. Garfield of Williams country teams are taking<br />\ndaily<br />\nSoon<br />\nafter<br />\nplay<br />\nwas resumed, Hopbe pulled before the St. John's College, Pres. W.H. P. Faunce<br />\ns a graduate of the Sargent School,<br />\nof \"jaunts\" of six miles<br />\nkins intercepted one of the many<br />\nor so through also of the Paris School of<br />\ngame. Several new songs were Brown, Pres. H. P. Judson of the<br />\nDramatic<br />\nOrange and Blue passes and had the<br />\nintroduced and one written and University of Chicago and Dean the University grounds. Captain Art.<br />\nball<br />\non Virginia's 35-yard line, but<br />\nsung by \"Buck\" Wilkinson, made a Walter T. Marvin of Rutgers Col- Mullikin and Hazeltine were the '['he painting of the scenery and an<br />\nattempted<br />\ndrop kick failed. The<br />\nonly members of last year's squad designing will again be in the able<br />\nbig hit. A locomotive yell by Joe lege.<br />\nhalf<br />\nended<br />\nin<br />\na 7-7 tie.<br />\nhands of Mr. Badillio.<br />\nWe are interested to find in this to be lost by graduation, which<br />\nThompson also proved a big sucToward<br />\nthe<br />\nlast of the third quarAs yet the club has not decided<br />\nlist the name of our own presiden, leaves a promising nucleus for this<br />\ncess.<br />\nter,<br />\nthe<br />\nHopkins backs gave an exupon any specific play for its main<br />\nFrank J. Goodnow, of Johns Hop- year's team.<br />\nproduction. The delay in the de- cellent exhibition of line plunging.<br />\nkins. As reported recently in the<br />\nMany of the new candidates are cision is due to the fact that the Carrying the ball in turns, Willis,<br />\nEvening Sun, President Goodshowing good form and promise to club is waiting to see just what roles Spinney, Calkins and Darley gained<br />\nA meeting of the candidates now expressed<br />\nhimself as being<br />\nthrough the big Virginia line a tocan be filled by the Freshmen.<br />\nfor the Editorial and Art Staffs heartily in favor of the whole plan develop into likely material.<br />\ntal of 55 yards before the ball was<br />\nTry-outs<br />\nfor<br />\nthe<br />\ninformal<br />\nplays<br />\nAccording to present indications,<br />\nof the Black and Blue Jay will and he called attention to<br />\ntaken over on -Virginia's 20-yard<br />\nthe fact<br />\nwill<br />\nbegin<br />\nnext<br />\nweek,<br />\nand<br />\nin<br />\nas<br />\nbe held at 12.30 today in the that the sum of money invested in the cross-country team will acquit much<br />\nas the material appears to be line.<br />\na great warship like the battle- themselves with credit in the diffi- very rich in ability their presentabalcony of the Barn.<br />\nThe fourth quarter opened with<br />\nship Maryland would be sufficient cult schedule which Manager Fort- tion on the night of December 1st Virginia in possession of the ball<br />\nContinued on page 3, col. 2<br />\nney is arranging for them.<br />\nwill be a great success.<br />\nContinued on page 4, col. 5<br />\n11.111.,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br /><br />\n2<br /><br />\nOf course the vast majority<br />\nthat voted in favor of disarmaFOUNDED 1897.<br />\nThe Social Science Club held a A Column in Which the Correspondents ment was thoroughly informed of<br />\nAre Allowed Latitude, But Shoulprinciples involved in the forthpromising and well-attended meetder the Responsibility.<br />\n$2.50<br />\nSubscription<br />\ncoming<br />\ndiscussion at Washington.<br />\ning Friday. Comprehensive plans<br />\nAll letters intended for publication<br />\non<br />\nink<br />\nid<br />\nwritten<br />\nconcise,<br />\nbe<br />\nmust<br />\nall who voted \"aye\" had<br />\nCertainly<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at v\\ ere discussed and an interesting<br />\nregular letter size paper, on one side<br />\n1879.<br />\n3,<br />\nNovember<br />\nCongress,<br />\nof<br />\nAct<br />\nunder<br />\nthe<br />\nonly.<br />\nMd.,<br />\nmatter due consideragiven<br />\nBaltimore,<br />\nprogram arranged for the present<br />\nNu attention will be paid to anonyan<br />\nas<br />\nJohns<br />\nsigned<br />\nof<br />\nMimes<br />\nstudents<br />\nbut<br />\nletters,<br />\nwere<br />\nand<br />\nprepared to give<br />\ntion<br />\nmous<br />\nPublished semi-weekly from October to June by the<br />\nyear. The meeting closed after a<br />\nevidence of good faith will not be<br />\nHopkins University.<br />\nprinted if request is made that they be logical reasons for desiring disspirited and informal discussion of<br />\nomitted.<br />\nBusiness communications should be addressed to the BUSINESS MAN- disarmament.<br />\nThe publication of a letter is not to armament. Surely they did not<br />\ncommunications<br />\nother<br />\nand<br />\narticles<br />\nall<br />\nUNIVERSITY;<br />\nbe taken as an indorsement of its views<br />\nAGER, JOHNS HOPKINS<br />\n\"The News-Letter, which invites the vote for disarmament simply beby<br />\na<br />\nis<br />\nClub<br />\nScience<br />\nSocial<br />\nThe<br />\nEDITOR.<br />\nshould be sent to the MANAGING<br />\nfreest discussion of matters of general<br />\ncause in their ingenuous ignorance<br />\nsubtreating<br />\ninterest.<br />\norganization,<br />\nserious<br />\nHomewood 100<br />\nTelephone<br />\njects of social, economic and po- AN ADVOCATE FOR DISARMAMENT of the selfish policies of politicians<br />\nBusiness Manager:<br />\nand the duplicity of statesmen,<br />\nEditor-in-Chief:<br />\nlitical significance. The object of Editor of the News-Letter.<br />\nH. DOUGLAS COTTON,'22<br />\nFREDERICK W. LIPPS, '22.<br />\nthey<br />\nwere bamboozled by a sugpotent<br />\nall<br />\nwith<br />\ndeal<br />\nto<br />\nis<br />\nthe club<br />\nDear Sir:<br />\nActing Managing Editor:<br />\nphrase!<br />\nary<br />\ncatchpenny<br />\nenmanner,<br />\nunbiased<br />\ntopics in an<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR., '23<br />\nEducation tends to broaden a<br />\n\"nay\" need<br />\nvoted<br />\nThe<br />\nfew<br />\nwho<br />\ninformation<br />\ndeavoring to obtain all<br />\nGLOVER P. FALLON, '23.<br />\nman's view of the world and its not be considered. They were too<br />\nAssociate Editors:<br />\npro or con on a subject, and draw<br />\nEDWARD G. HUEY, '22.<br />\nAdvertising Manager:<br />\naffairs and movements. An ed- obviously R. 0. T. C. propaganELI FRANK, JR., '22.<br />\nconclusions free from prejudice.<br />\nDONALD K. VANNEMAN, '23.<br />\nucated person can look upon these dists.<br />\nThe club, though organized priJunior Editors:<br />\nAssistant Business Managers:<br />\nthings from an advantageous<br />\nThe writer, who did not vote,<br />\nCHARLES C. MARBURY, '22.<br />\nmqrily for those students interested<br />\nBERNARD C. HEARN, '23.<br />\nviewpoint and can express his confesses that he knows nothing<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nin political science, political econJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nopinion intelligently and with about disarmament other than<br />\nFITZGERALD DUNNING, '24.<br />\nCRAIG E. TAYLOR, '24.<br />\nomy, and history, is opened to<br />\nsome confidence. Under modern what he has learned from the<br />\neveryone. The club is composed of<br />\nconditions the university is the sometimes authentic fables in the<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nprofessors and graduate students, as<br />\ntemple of learning and it is from newspapers. He believes none but<br />\nwell as undergraduates, and matters<br />\nthere that we expect our superior diplomats of, say, twenty years'<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nof public interest are studied in a<br />\npeople to come.<br />\nexperience are qualified to submit<br />\nco-operative manner. Excellent opIn European universities these opinions on this great issue.<br />\n1921<br />\n25,<br />\nBALTIMORE, MD., OCTOBER<br />\nportunity is thus afforded to all<br />\nexpectations have been fulfilled;<br />\nHe believes moreover, that the<br />\nstudents interested •in the more<br />\nall the cultural and humanitarian opinion of the student body of<br />\nlife<br />\nTHE PRINCETON CONFERENCE<br />\nnational<br />\nof<br />\nquestions<br />\nserious<br />\nmovements have been started and Johns Hopkins is fully as valuable<br />\nstudy advantageously these probto<br />\nled to a great extent by university as that formulated by any college<br />\nIn a short while the leading colleges of the country will send<br />\nlems with men of similar tastes.<br />\nmen. Gradually the American uni- to be represented at the Princerepresentatives to the Princeton conference to discuss the momentous<br />\nThe club, besides conducting disversities are also attaining this ton assembly. The conference,<br />\nissue of the day—Limitation of Disarmaments.<br />\ncussion groups, arranges lecttires<br />\nof authority in American therefore, should evoke a volume<br />\nposition<br />\nwill<br />\ninflumeeting<br />\nIt is not thought that the outcome of this<br />\nby men of prominence. The secrestatement is proved of childish blather scarce equalled<br />\nThis<br />\naffairs.<br />\nence to any great extent the delegates to the international conference tary is now negotiating with Mr.<br />\nconveniton of col- in the history of a<br />\ncoming<br />\nthe<br />\nby<br />\nin Washington. It will, however, serve to cast a shadow of coming Daniel Willard, Senators France<br />\ncountry noted<br />\nthe disarmament for the blather of its<br />\non<br />\nstudents<br />\nlege<br />\nevents. The college man of today is the leader of tomorrow and will and Borah, Mr. Plumb and Dr.<br />\ngreat men.<br />\nshape the destinies of the nation in days to come. We should watch Morse, having already secured sev- question at Princeton.<br />\nAfter the puerile Princeton<br />\nThe disarmament question is pow-wow and the wool-pulling<br />\nthis conference of college leaders with deep interest, as a prophecy eral to address the club. Following<br />\nthe world in the face and wrangling of the<br />\nstaring<br />\nof our nation's future policy in international affairs.<br />\nlearned landeach lecture, the club discusses the<br />\nit is the college men who are best grabbers at Washington<br />\nwarfare<br />\nmain points of the address.<br />\nequipped to answer it. It is they will be resumed at the<br />\nold stand<br />\nThe principle study of the club<br />\nwho appreciate the importance of as usual.<br />\nTHE BAND AND THE R. 0. T. C.<br />\nthis year will be disarmament and<br />\npeace in the advancement of civiCriticus.<br />\nAt last our R. 0. T. C. unit bids fair to become complete. Al- railroad problems, and taxation ad- lization and I am sure that they<br />\njustment.<br />\nready a model government battalion, with the addition of the student<br />\nwill realize that it is only disarmaband, we shall have an organization that will stand an \"A-No.1\"<br />\nment that will bring about a sem- Editor of Johns Hopkins NEWSPHYSICAL TRAINING GAINING IN<br />\nLETTER.<br />\nchance of rating first this year on the coveted distinguished list.<br />\nblance of peace at least for the<br />\nPOPULARITY<br />\nSir: Why is it that in reDear<br />\nthat<br />\nplan<br />\nnew<br />\nany<br />\nfor<br />\nopen<br />\nMajor Garey always has his eyes<br />\npresent time.<br />\nthere is such a conspicyears<br />\ncent<br />\ntraining,<br />\nthat<br />\nirksome<br />\nPhysical<br />\nbest<br />\nthe<br />\nbe<br />\nwill tend to better the unit, and this new idea seems to<br />\nFor Disarmament.<br />\nof University emabsence<br />\nunder<br />\nnow<br />\nis<br />\nwell<br />\nuous<br />\nire<br />\nprovoker,<br />\nhis<br />\n0.<br />\nR.<br />\nthat he has yet sprung, for at the same time that he helps<br />\nof<br />\nrooting secnumber<br />\nthe<br />\nin<br />\nHopkins<br />\nthe<br />\nblems<br />\nway,<br />\ngreat<br />\ndespite<br />\nfin4nT. C. unit he is materially aiding the band by giving them the<br />\nblack and<br />\nthe<br />\nfirst<br />\nabsences<br />\nthat<br />\nIt<br />\nduring<br />\nthe<br />\ntrue<br />\ntion?<br />\nis<br />\nrecorded<br />\ncial support of the United States Goyernment.<br />\nBELIEVES SHERMAN WAS RIGHT<br />\nweek. Now, however, the attendblue caps of the freshmen give a<br />\nance is more nearly up to par, due To the Editor of the News-Letter. decided note of color and spirit to<br />\nno doubt to the drastic punishment Sir:<br />\nthe stands, but how about some penCOME ONE, COME ALL<br />\nAssembly<br />\nthe<br />\nnants. Everybody present at the<br />\nI was present at<br />\noutlined by Dean Latane to be<br />\nThe editors learn with sorrow of the consternation caused upon meted out to those who cut the last Thursday when the invitation Hopkins-Dickinson game could not<br />\nthe Goucher campus by Article 19 of the Hopkins Credo which ap- course.<br />\nto the Princeton Disarmament help but notice the enormous red<br />\npeared in a recent issue. Dame Rumor hath it that sundry and variThe men in the class have been Conference was read and accepted. and white banner that opposing<br />\nous groups of beautious maidens gathered together with wails of detailed into three sections or Now, sir, while I think their mo- rooters had stretched across their<br />\nprotest concerning the way they had been slandered.<br />\nsquads. The few Juniors taking tive is admirable, I believe that stand. Also, several smaller DickWe are from Missouri and our office is open from 12:30 to 4 the course and the Sophomores the idea of preventing wars by inson pennants were noticed. Now<br />\nhow about a few pennants in the<br />\nmake up one section, while the re- disarmament is hopeless.<br />\nevery Tuesday and Friday.<br />\nmaining two are composed entirely<br />\nI am sure that you will agree future, especially at the St.<br />\nof Freshmen.<br />\nwith me, and I am particularly John's game. If the fellows think<br />\nSTUDENT RELIEF WORK<br />\nIn spite of the almost universal sure that the members of the R. that it is beneath their dignity to<br />\ngrumbling, the men go through the 0. T. C. will, when. I tell you carry pennants, then let them proLast week in an article in the News-Letter something was told<br />\nexercise with vim and vigor, very that General Sherman sure said a cure some and let the girls wave<br />\nof the urgent need and the great opportunity presented by the Stu- few<br />\ncases of downright rebellion mouthful. But the way to prevent them. Besides, it is the fellow's<br />\ndent Relief work. It is an opportunity that should not be allowed to<br />\nhaving developed. And, needless war is to be ready to fight when place to yell, and girls with weak<br />\ngo unused. The time to help a fellow and have him appreciate it is<br />\nto say to those familiar with the the time comes, not by laying goices can do the waving. If any of<br />\nwhen he is down. This is really the position of a vast number of army<br />\nofficers in charge of the class, down all means of defense to do he men do not know where to get<br />\nEuropean students today. They are struggling but the odds are these have been<br />\npromptly squelched. that is to invite war.<br />\n. H .U. penpants they might try<br />\nheavy and a little timely aid will be of great help to them and produce<br />\nMany men have escaped physical<br />\nYes, let us have peace by all kndy-Landy and Co., where a coma lasting impression of the friendship that the other students of the training by trying for athletic means (Freshmen and Sopho)lete stock is carried. Anyway, get<br />\nworld hold toward them.<br />\nteams, but for anyone not in earnest mores please note), but let us also them somewhere, and let's see a<br />\nDr. Friedrich Hertz, of the State Department of Austria, writes this is merely a leap from the fry- be prepared to keep that peace, bunch of them waving at the St.<br />\nas follows in regard to the work done last year by the Student Friend- ing pan into the fire; for accurate for a satisfactory agreement on John's game.<br />\nship Fund: \"Thousands of hopeful young people are being saved records of the attendance at the universal disarmament will never<br />\nBLACK AND BLUE.<br />\nthrough your work from extreme misery which otherwise would field are kept, and no trifling is be reached in this world.<br />\nprobably break their mental and moral energy. If they should suc- countenanced.<br />\nA GOOD SUGGESTION<br />\nAnti-Disarmament.<br />\ncumb this wOuld mean the disappearance of forces indispensable for<br />\nBut in the final analysis, no one<br />\nEditor of the NEWS-LETTER:<br />\nany reconstruction in our country. It is a wonderful manifestation seems to have any definite comFor several years<br />\nDEAR SIR:<br />\nof a truly Christian spirit for bringing about reconciliation and plaint against P. T., and on the surbeen criticism of<br />\nalways<br />\nhas<br />\nhere<br />\nA<br />\nREALLY<br />\nVOTE<br />\nWAS THE<br />\nbrotherly co-operation.\"<br />\nface, at least, the grouching appears<br />\nlie manner in which class elections<br />\nTHOUGHTFUL ONE<br />\nThis is the cool estimate of a man who is used to the realities of attributable to a natural inclination<br />\nheld. Some of the classes<br />\nTo the Editor of the Johns Hop- are<br />\nlife,—not a dreamer or sentimentalist. He simply sees that his coun- to \"kick.\"<br />\nhold their elections by standing vote<br />\nkins News-Letter.<br />\ntry is in desperate straits and that this work is an important factor<br />\nand some by ballot; some require<br />\nin its salvaging. Can't we realize that the salvation of these countries, First Attorney—Your Honor,<br />\nthe<br />\nthat<br />\nopinion<br />\nof<br />\nthe nominations a week before the elecNow<br />\nthough far away in distance, is intimately connected with the future unfortunately I am opposed by an student body on the disarmament tion, while others have both nomof our own land ?\"<br />\nunmitigated scoundrel.<br />\nquestion has been ascertained the inations and the election at the same<br />\nOur own Alma Mater owes a tremendous debt to many of the<br />\nSecond Attorney—My learned local delegates to the Princeton meeting. In my class, nominations<br />\ninstitutions that are being aided, not only for preserving and trans- friend is such a notorious liar—<br />\nconference will be able to speak are made one week and the followmitting the learning of the past, but for training many of the present Judge (sharply)—The counsel for our college with fully as high ing week elections are held by a<br />\nmembers of the faculty.<br />\nwill kindly confine their remarks to a degree of intelligence as was standing vote on each man. This<br />\nLet's do something to repay that debt and help in the recon- such matters as are in dispute.— manifested by the said student nethod undoubtedly produces perVirginia Reel.<br />\nContinued on page 4, col. 3<br />\nbody in making the decision.<br />\nstruction of the world.<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nSOCIAL SCIENCE CLUB HOLDS<br />\nINITIAL MEETING<br /><br />\nTHE NEWS LETTER'S<br />\nMAILBAG<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br /><br />\nWho's Who at J. H. U.<br /><br />\nBILL SCHMEISSER ADDRESSES<br />\nLACROSSE CANDIDATES<br /><br />\n3<br /><br />\nCOTILLON BOARD TO ARRANGE<br />\nFOOTBALL TEA DANCES<br /><br />\niORTMAN'S<br />\n\"Queen<br /><br />\nMt. Vernon 4999<br /><br />\nAt a meeting of the Cotillon<br />\nQuality\" Home Made<br />\nLacrosse practice is now being Board<br />\nheld on last Thursday it<br />\nChocolates<br />\nheld three days a week at Homewas decided to take over and con- VISIT OUR ICE CREAM PARLORS<br />\nwood under the guidance of \"Bill\"<br />\n1921-1922<br />\nduct the football tea dances inau518 N. CHARLES ST.<br />\nCommercial Photography<br />\nSchmeisser and Captain \"Joe\" Zol- gurated<br />\nby<br />\nthe<br />\nInterfraternity<br />\nOMICRON DELTA KAPPA<br />\nler at 4:30 o'clock. All of the old<br />\nCircuit Photography<br />\nBoard. The first of these dances<br />\nPresident, Joseph C. Thompson; men not playing football have reFlash Lights<br />\nViews<br />\nwill be held after the Haverford<br />\nCharles and 22nd Sts.<br />\nSecretary, Robert C. Hall; Mem- ported and in addition many new<br />\nEnlargements<br />\ngame on November 5 and will be Delicious Sodas and Sundaes Groups<br />\nbers, Douglas Cotton, Andrew men of promising calibre are out<br />\nKODAK FINISHING<br />\nfollowed by similar functions after<br />\nThe Best of Candies<br />\nfor the team. Schmeisser appeared<br />\nXnecht, Davidge Rowland.<br />\nthe St. John's and Washington<br />\nPrompt &amp; Efficient Service<br />\n325 N. Howard St.<br />\nat practice last Wednesday and<br />\nSTUDENT COUNCIL<br />\nand Lee games. The University<br />\nPresident, Richard M. Wood; talked to the candidates, giving orchestra will furnish the music<br />\nSecretary, Gilson Engel; Seniors, them some of the rudiments of the and punch will be served. An adRobert Hall, Gilson Engel, Andrew game. It is essential that every mission of 50 cents per couple will<br />\nST: PAUL &amp; 24th STS.<br />\n1 W. University Parkway<br />\nICriecht ; Juniors, John Marchant, man hoping to make the team re- be charged and to keep the C. E.<br />\nC. D. Wolfe, Prop.<br />\nDonald Vanneman ; Sophomores, port regularly for practice, as the Hall from being overcrowded the<br />\nOpposite J. H. U. Athletic Field<br />\nfall practice in stickwork is a very<br />\nEdward Morrison.<br />\nticket sale will be limited to one DELICIOUS SODAS &amp; SUNDAES DRUG STORE for J. H. U. BOYS<br />\nimportant part of the work. There<br />\nMade With<br />\nATHLETIC BOARD<br />\nhundred tickets. It is absolutely<br />\npositions for new men and the<br />\nPHONE, HOMEWOOD 2121<br />\nJersey Special Ice Cream<br />\nPresident, Andrew H. Knecht; are<br />\nasserted that every man intending<br />\n\"The Velvet Finish\"<br />\nopen to every one. It is<br />\nare<br />\nplaces<br />\nSecretary, S. Atherton Middleton.<br />\nto attend these dances purchase<br />\nurged by Captain Zoller and Mantheir tickets in advance as no one KODAKS CAMERAS SUPPLIES Buy an (H) Pipe made special<br />\nVARSITY SEAL VOTING COUNCIL<br />\nager Hensel that all new men stick will<br />\nbe admitted without a ticket. Whitman's Chocolates and Bon Bons<br />\nChairman, H. Douglas Cotton;<br />\nfor the Boys<br />\nout for their respective jobs, as<br />\nThese tickets will be on sale by<br />\nSecretary, Frederick W. Lipps.<br />\nevery job is open.<br />\nmembers of the board and will be<br />\nFOOTBALL<br />\nOUR ALMA MATER SONG<br />\nORDERS RECEIVED FOR<br />\navailable<br />\nin a few days.<br />\n, Manager.<br />\nCaptain,<br />\nVERITAS VOS LIBERABIT<br />\nPRINCETON INVITES 71 UNIFurther<br />\nplans<br />\nwere<br />\nmade<br />\nfor<br />\nCOGGINS'<br />\n1-1. Pierce Brawner.<br />\nTruth guide our University,<br />\nVERSITIES TO ATTEND<br />\nChristmas<br />\nthe<br />\nCotillon<br />\nAnd<br />\nfrom<br />\nwhich<br />\nwill<br />\nall<br />\nerror<br />\nkeep<br />\nher<br />\nfree;<br />\nTransfer<br />\nand Baggage Express<br />\nCONFERENCE<br />\nLACROSSE<br />\nLet wisdom yield her choicest treasure,<br />\nbe<br />\nheld<br />\neither<br />\nthe<br />\n22nd<br />\nor<br />\n23rd<br />\nAnd<br />\nof<br />\nfreedom<br />\nreach<br />\nher<br />\nfullest<br />\n•<br />\nmeasure;<br />\nAUTOMOBILE<br />\nSERVICE<br />\nCaptain, Joseph Zoller ; Manager,<br />\nContinued from page 1, col. 5<br />\nOh, let her watchword ever be<br />\nDecember.<br />\nIt<br />\nis<br />\ncertain<br />\nnot<br />\nwhat<br />\nThe<br />\n.truth<br />\nof<br />\nGod<br />\nwill<br />\nmake<br />\nPHONE,<br />\nyou<br />\nfree,<br />\nHOMEWOOD<br />\n2645-W<br />\nnoward Hensel.<br />\nto endow nearly three universities<br />\nWill make you free!<br />\nthe subscription to this will be<br />\nthe size of Johns Hopkins. This,<br />\nBASEBALL<br />\nLet knowledge grow from more to more,<br />\nas yet, but this will be decided at And<br />\nscholars versed in deepest lore,<br />\nCaptain, Andrew H. - Knecht; he believes, is a fine illustration the next<br />\nTheir<br />\nsouls for light forever burning,<br />\nmeeting when further Send forth<br />\ntheir fire, unlock their learning', \"Say you,\" yelled his Satanic Mato bring home to the public, the<br />\nManager, Edward G. Huey.<br />\nAnd<br />\nlet<br />\ntheir<br />\nfaithful teaching be<br />\njesty' as a newly arrived soul saunplans are made.<br />\nThe truth alone can make us free,<br />\nenormous expenditures being<br />\nTRACK<br />\nCan make us free!<br />\ntered casually across the red-hot<br />\nShe (to fair friend)—I'm not The truth shall crown her sons with fame, cinders. towards him, \"what do you<br />\nCaptain, Joseph C. Thompson; made throughout the world to<br />\nTheir lives inspire with nobler aim,<br />\nmaintain armaments. Dr. Good- going with Harry any more:<br />\nManager, William R. Fortney.<br />\nTheir names make known throughout our mean by acting like that? Do you<br />\nborders,<br />\nnow also believes that it is a very<br />\nFair Friend—Why not?<br />\nAs learning's guide and wisdom's wardens; think you own Hell?\"<br />\nBASKET-BALL<br />\nThen<br />\nlet their watchword ever be<br />\nwise thing to start a pro-disarma- She—He knows too many naughThe truth for aye shall keep us free,<br />\nCaptain,<br />\n; Manager,<br />\n\"I ought_ to,\" replied the adShall keep us free.<br />\nment movement among young ty songs.<br />\nJ. Brentnall Powell.<br />\nWM. L. DEVRIES. dressed gentlemen in a grieved<br />\ncollege men and he is glad to find<br />\nFair Friend—Does he sing them?<br />\nMOTTO..<br />\nSWIMMING<br />\nthat the movement has proved<br />\nThe motto of the University, \"Veritas yoice,\" my wife was giving it to Me<br />\nShe—No, but he's always whist- vos.<br />\nliberabit,\"<br />\nmay<br />\nbe found in John 8:32. -ight along.\"--Woo Doo.<br />\nCaptain, Paul Buhrer ; Manager, interesting to Hopkins men es\"The truth shall make you free.\"<br />\nling them.—Exchange.<br />\n1)avidge Rowland.<br />\npecially.<br />\nThe Student Council has apTENNIS<br />\npointed<br />\nas the Hopkins delegates<br />\nCaptain and Manager, Wilson<br />\nr-)uffy.<br />\nthe<br />\nto<br />\nPrinceton Conference two<br />\ncapable men, Gilson Engel and<br />\nCROSS COUNTRY TEAM<br />\nWilliam Randall. They will repCaptain, W. H. Somerville.<br />\nresent our interests there and tell<br />\nNEWS-LETTER<br />\nof the almost unanimous vote in<br />\nEditor-in-Chief — H. Douglas<br />\nfavor of the disarmament prinCotton; Business Manager, Fredciple which was voiced at Thurserick W. Lipps.<br />\nday's assembly.<br />\nHULLABALOO<br />\nThe list of 71 universities which<br />\n. Editor-in-Chief, R. Dorsey Wathave been invited to send deleBusiness Manager, Edward gates to Princeton is as follows:<br />\n('• Huey.<br />\nAllegheny, Amherst, Boston,<br />\nBLACK AND BLUE:<br />\nTAY<br />\nBrown, Bucknell, Carnegie Tech,<br />\n‘ Editor-in-Chief, Lawrence B. Catholic University, Clark, Colenneman ; Business Manager, H. gate, University of Chicago, Columbia, Cornell, Dartmouth, Dela1)ouglas Cotton.<br />\nware, Dickinson, Drexel Institute,<br />\nDAILY BULLETIN<br />\nTHE TURKISH CIGARETTE<br />\nEditor, H. Douglas Cotton; Bus- Episcopal Divinity School, FordInes Manager, Donald K. Vanne- ham, Franklin and Marshall, General<br />\nEvery day MURADS are held<br />\nTheological<br />\nSeminary,<br />\nGeorge Washington, Georgetown,<br />\nhigher<br />\nin the estimation of the men<br />\nDRAMATIC CLUB<br />\nHamilton, Hartford Theological<br />\nwho smoke them.<br />\nPresident—Gilson Engel; Secre- Seminary,<br />\nHarvard<br />\nDivinity<br />\ntary, Eli Frank, Jr.<br />\nSchool, Harvard, Haverford, HoThey are the standard of Taste.<br />\nMUSICAL CLUB<br />\nbart, Holy. Cross.<br />\nThey never disappoint—never<br />\n7.* President, R. Waldo Hambleton ; Johns Hopkins, Lafayette, Lebiusiness Manager, Hugh Small- high, Manhattan, Maryland Colfail—never<br />\nchange—<br />\n---mva<br />\nwood.<br />\nlege, Maryland University, Mas\"<br />\n1<br />\nThey are 100% pure Turkish tosachusetts Tech., Middlebury,<br />\nBAND •<br />\nbacco—ofthe finest varieties grown.<br />\nMuhlenburg, City College of New<br />\nDirector, Emil Smith.<br />\n.........7.<br />\nYork, New York University,<br />\ni:t....21,7\":471.1<br />\nDEBATING COUNCIL<br />\nESPECIALL1.0.14FOR T<br />\nYou are proud to smoke them<br />\n.IIIIIIIIIIIII<br />\nPreSident, R. Dorsey Watkins; Pennsylvania College, Pennsyl...<br />\nMADE<br />\nEXPERIEVIC<br />\nPRE<br />\n....<br />\nz<br />\nvania Military College, Penn<br />\nin any company—on any occasion.<br />\nIIISCRIWIIKTING AtIO<br />\nSecretary, Lawrence<br />\nGRADE:7_<br />\nB. Fenneman.<br />\nHIGH<br />\nww.<br />\nState, University of PennsylvaSMOKER Of CIGARETTES-'TURKISH<br />\nINTERFRATERNITY BOARD<br />\nThey are the largest selling highnia, Pittsburgh, Pratt Institute,<br />\nPresident, Gilson E. Engel; Sec- Rensselaer Polytechnic<br />\nIheblendm<br />\n..,...,,,,,..,..4d ,,,firt.,.„... ,...,<br />\nInstitute,<br />\ngrade<br />\ncigarette in the world.<br />\nIsexcatio<br />\nretarY, Richard M. Wood.<br />\nRhode Island State, Rochester<br />\nThe cigarette smokers ofAmerica<br />\niiiiiiiiiiiiiiiiiiiii<br />\nRutgers.<br />\nY. M. C. A.<br />\nif, -gip*<br />\nInstitute,<br />\nNStevens<br />\nSusquehanDO prefer Quality to Quantity.<br />\nII<br />\nPresident, Leroy Baughman;<br />\nSecretary,<br />\nPaul Stevens; General na, Swarthmore, Syracuse, TemS.ecretary,<br />\nCharles S. Sydnor ; As ple University, Trinity, Tufts,<br />\n\"Judge for Yourself !<br />\n\"<br />\n41stant General Secretary, Vertrees Union, Villa Nova, Virginia,<br />\nWashington and Jefferson, WashWYekoff.<br />\nington<br />\nand Lee, Wesleyan, Yale,<br />\nZIONIST SOCIETY.<br />\nAndover<br />\nTheological Sem;nary.<br />\nPresident, M. H. Rosenfeld;<br />\nS<br />\necretary, A. L. Finesinger.<br />\nMr. Slow (at the wheel)—You<br />\nmust be cold, don't you need someITPPe---What is a hypocrite?<br />\nthing around you?<br />\n.Stares—He is a man that goes<br />\nMiss Speed—Yes, dear, but let's<br />\nto<br />\n&amp;darks\";<br />\n11114Years with a smile on his face.— wait until we get a little further out<br />\nPunch Bowl.<br />\nin the country.—Mink.<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nThe College Drug Store R.G.Loy.&amp; Company<br /><br />\nMURAD<br /><br />\n20<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 25, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nATTENTION ALUMNI!<br /><br />\nIt's time for a<br /><br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br /><br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br /><br />\nbeXatteri4<br />\nCt<br />\nH.St OSCAR G.1-5Nri<br />\n‘j41'.1<br />\nOWN ERS<br /><br />\n.7%<br /><br />\n°<br />\nr4P*<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPriniers of the<br />\n•<br />\nJohns Hopkins News-Letter<br /><br />\nCollege Literature<br /><br />\nThe News-Letter, as you know, is edited and published bY<br />\nthe students; it gives the University news, and it gives all of it.<br />\nDuring the last few years in which the University has been<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to give advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\nfor the benefit of those unable to attend. We know you are interested in Hopkins' activities, in the progress of the dorms, in<br />\nthe football team, lacrosse team, debating team, Dramatic Club,<br />\netc. Perhaps you were a member of one of our championship<br />\nlacrosse teams—at any rate, you cherish fond memories of your<br />\ncollege days, and you have an interest in the activities of today<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br />\nName<br /><br />\nFALL SUIT<br /><br />\nWe're ready<br />\n$30 up<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br /><br />\nURNER BROTHERS<br />\nIII E. BALTIMORE STREET<br /><br />\nHess Shoes<br /><br />\nLEMMERT<br /><br />\nWYMAN<br /><br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br /><br />\nBALTIMORE<br /><br />\nDANCES<br /><br />\nTelephone St. Paul 6987<br /><br />\nAddress<br />\nBLACK AND BLUE JAY TO APPEAR very fine cellist, who is to play in<br />\nSHORTLY<br />\nthe orchestra, but there are places<br /><br />\nThe first issue of the Black and for<br /><br />\nTHE COLLEGIATE DICTIONARY<br /><br />\nseveral<br /><br />\nmore.<br /><br />\nPlayers of<br />\nwoodwinds are also in demand. Musicians who have conflicts with physical training should attend rehearsals after the physical training hour,<br />\nand after a few weeks it is hoped<br />\nthey will be given an opportunity<br />\nto devote more time to the rehearsals.<br /><br />\nWORK ON HULLABALOO STARTED Blue Jay will be<br />\npublished in a few stringed, bass, flute, and<br /><br />\nWithin the next few days a roll<br />\nALLOWANCE—See Quicksilver.<br />\nBLOWOUT—A small body of men of the Senior class will be posted<br />\nSyn., in the basement of Gilman Hall.<br />\nsurrounded by liquor.<br />\nThe editor of this year's Hullabaloo,<br />\nHeadache.<br />\nR. Dorsey Watkins, requests that<br />\nCHORUS—Outside research.<br />\nCLASS—Indirect cause of inter- all Seniors will carefully look this<br />\nover and make any corrections or<br />\nrupted sleep.<br />\nthat may be necessary.<br />\nadditions<br />\ncause.<br />\nCLOCK--Direct<br />\nimportant, for this roll<br />\nvery<br />\nis<br />\nThis<br />\npass;<br />\nCOURSE-1. Those that you<br />\nas a Hullabaloo<br />\nboth<br />\nserve<br />\nwill<br />\n2. The rni..en ones.<br />\nrecord.<br />\nclass<br />\na<br />\nand<br />\nCUT—To sleep. Overcut: See<br />\nAll men who are trying out for<br />\nDean.<br />\nDATE-1. Another evening gone. the art and editorial staffs of the<br />\n2. Something to be added in the Hullabaloo must hand in their contributions to Watkins by next<br />\nterm bill for Dad.<br />\nDICTIONARY — Reference good Thursday at the latest.<br />\nThe official photographer for the<br />\nfor $20 from Father.<br />\nthis year will be Mrs.<br />\nreceipt.<br />\n'Hullabaloo<br />\nDIPLOMA—The paternal<br />\nHamilton street, who<br />\nprof.<br />\n5<br />\na<br />\nBennett,<br />\nFLUNK—To displease<br />\nindividual and group<br />\nboth<br />\nGAMES-1. Those that you lose .vill take<br />\nIndividual photoat; 2. Those that the team wins. )hotographs.<br />\nGRIND—A bird who thinks col- graphs are being taken now and<br />\nlege is a Preparation for Life's orders for these may be secured<br />\nfrom E. G. Huey.<br />\nBattles.<br /><br />\ndays. The business staff has announced its intention of following<br />\nlast year's policy in allowing students to obtain subscriptions for<br />\nfriends at greatly reduced rates.<br />\nThose desiring to take advantage<br />\nof this offer should hand in their<br />\nfriends' addresses, together with<br />\ntheir own, to Box 545, or to NEWSLETTER office. The price is $1.25<br />\nfor six issues, which is due January 1st.<br /><br />\nVIRGINIA NOSES OUT HOPKINS<br />\nIN A CLOSE, WELL-PLAYED<br />\nGAME<br />\nContinued from page 1, col. 5<br /><br />\nALL BY OURSELVES ON THE<br />\nGRIDIRON<br /><br />\nAll by ourselves on the gridiron,<br />\nOut here on Homewood Field;<br />\nPep, power and teamwork are<br />\nqualities,<br />\nBut we've more than these<br />\nTouchdown specialties—rah!<br /><br />\nTrick plays and those forward<br />\npasses—<br />\nLOVE—See Cynic.<br />\nthey always go through.<br />\nOur<br />\nstunts,<br />\nPASS—To do work satisfactorily.<br />\nA GOOD SUGGESTION<br />\nto put that ball right<br />\ngoing<br />\nWe're<br />\nPROF-1. Those that are prejuContinued from page 2,col. 5<br />\nSt.John's goal line.<br />\nof<br />\nback<br />\ndiced; 2. Those that pass you.<br />\nthen nine<br />\nand<br />\nninety<br />\nScore<br />\nTeach a Lesson in Style<br />\nPROHIBITION—Cause of the H. fi ectly fair results, but still it lacks<br />\nFor J. H. U.—year team!<br />\nC. L.*<br />\nThey possess the \"dash\" that<br />\n.he element of secrecy that an elecappeals to college men, toned<br />\n—ANONYMOUS.<br />\nSTUDE—One who does his best -ion by ballot gives. I believe there<br />\ndown to distinctiveness. And<br />\nabout it, Volstead notwithstand- are conditions and circumstances<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\ning.<br />\ninder which a man feels compelled<br />\nORCHESTRA REHEARSE<br />\nN. HESS' SONS<br />\nTHEME—Something that some o vote for one man when he really<br />\nAt the initial rehearsal of the<br />\none else has pulled a B on that's Ashes another.<br />\n8 E. BALTIMORE ST.<br />\nCollege Orchestra in the Barn last<br />\ngood enough for you.<br />\nIt seems to me that the election Wednesday afternoon, a goodly<br />\nTHESIS—The reason you didn't<br />\nf Athletic Association officers in showing of fiddlers and several<br />\ntake the course.<br />\nspring is one after which those pianists made their appearance, beVACATION—Au excuse for see- the<br />\nclasses that have not already done sides several last year's members<br />\nMADE TO ORDER<br />\ning New York.<br />\nso, should model their elections. of the brass section. The practice<br />\nAND<br />\n\\VORK—A good word for home<br />\nThis would bring about a great sav- was immediately gotten under way<br />\ncorrespondence. See Fiction.<br />\nFINISHED CLOTHES<br />\ning of time and would make the and the results proved very encour*High Cost of Liquor.<br />\nelections much more systematic and aging to, Emil Smith, the director.<br />\nPLAZA BUILDING<br />\n—Ohio Wesleyan Mirror.<br />\nbusiness-like. Class elections should<br />\nThe members of the violin section<br />\nL. V.—Yes—<br />\n19 and 21 EAST FAYETTE ST.<br />\nbe standardized and the Student will all retain places ill the orchesC. F.—Bigamy.—Dirge.<br />\nCouncil should require that this tra if they attend rehearsals reg\"Is he lazy?\"<br />\nprinciple of vote by ballot be incor- ularly, but there must necessarily<br />\nSHOES<br />\n\"Lazy? Say, that fellow rides in<br />\nporated into the constitution of each be try-outs for the pianist's chair.<br />\na Ford car in order to save the effpr<br />\nincoming Freshman class.<br />\nIt is, therefore, desired that more<br />\nfort of knocking the ashes off his<br />\nplayers come out. Should the band<br />\nUNIVERSITY MEN<br />\nYours truly,<br />\ncigar.—Gargoyle.<br />\nreceive the government support<br />\nFor Sport Wear<br />\nFor Dress<br />\nR. B. that is hoped for, the pianists who<br />\nSmart Styles—Best Leathers<br />\nfail to make the place in the or Moderate Prices<br />\nHe—Saw Minnie with her new<br />\nchestra will be given first opporDuke.<br />\nme,<br />\ntickle<br />\nMaybelle—You<br />\ntunity to learn a band instrument<br />\nbathing suit under her arm.<br />\na<br />\nwhat<br />\nword,<br />\nDuke—My<br />\nThe<br />\nplay in the College Band.<br />\nand<br />\nstyle?—<br />\nlatest<br />\nthe<br />\nHim—Is that<br />\nschool boasts this year of a<br />\nThe<br />\nrequest.—Puppet.<br />\nstrange<br />\nChaparral.<br />\n19 W. LEXINGTON ST.<br />\nLOMBARD and SOUTH STREETS<br /><br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br /><br />\nOf the Better Class<br /><br />\non Hopkins' 18-yard line. Dunn<br />\nand Oppleman worked the ball to<br />\nthe two-yard line. Foster carried<br />\nthe ball over for a second touchdown and Hall made his first failure of the season at goal kicking.<br />\nHopkins needed a touchdown and<br />\ngoal to win and immediately started<br />\nafter it. Markell, who substituted<br />\nfor Spinney when he was injured,<br />\nstarted the line plunging and had<br />\ncarried the ball to Virginia's 35yard line before Virginia gaine'l<br />\nthe ball on a pass, caught by Burge.<br />\nHopkins had lost her last chance<br />\nand the remaining short time<br />\navailed nothing.<br />\nAfter the game, \"Bill\" Totterdale<br />\nwas elected captain in place of<br />\n\"Bill\" Wood, who is now at West<br />\nPoint. Totterdale has been acting<br />\ncaptain this season and his choice is<br />\na popular one.<br />\nThe lineup :<br />\nHopkins<br />\nVirginia.<br />\nMiddleton<br />\nL.E<br />\nDavis<br />\nWesterman<br />\nL.T.<br />\nHall<br />\nMagill<br />\nL.G<br />\nShackelford<br />\nTotterdale<br />\nC.<br />\nHankins<br />\nLandy<br />\nR.G.<br />\nWard<br />\nKnecht<br />\nR.T<br />\nClarke<br />\nRich<br />\nRE.<br />\nMichie<br />\nDarley<br />\nQ.B<br />\nCarrington<br />\nR.H.B<br />\nCalkins<br />\nRinehart<br />\nL.H.B.<br />\nCoady<br />\nOppelman<br />\nWillis<br />\nF.B<br />\nDunn<br />\nScore by Periods<br />\nTotal<br />\nVirginia<br />\n7 0 0 6-13<br />\nJohns Hopkins<br />\n0 7 0 0— 7<br />\nSubstitutes—Virginia: Burge for<br />\nRinehart, Blackford for Ward, Cutchin<br />\nfor Shackleford, Stephenson for<br />\nMichie, Hayes for Hall; Hopkins—<br />\nSpinney for Coady, Markell for Spinney.<br />\nTouchdowns — Oppleman, Foster<br />\nMagill. Goals from Touchdown—Hall,<br />\nCalkins.<br />\nReferee—Hoban (Dartmouth). Umpire—Cosgrove (Cornell). Head Linesmen—Sanford (Dartmouth), and Haywood (South Carolina). Time of<br />\nPeriods-15 and 12 mniutes.<br /><br />"}], "field_media_file": [{"target_id": 37543, "display": null, "description": null, "target_type": "file", "target_uuid": "93f4330d-fdb5-4bff-8b0b-88aa1f6c1c20", "url": "http://digital.library.jhu.edu/system/files/2022-03/12961-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12961, "target_type": "node", "target_uuid": "b5231760-4272-4ddb-9576-08766ed971af", "url": "/node/12961"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f4547272-34df-46c3-8689-346387a8440c"}]}