{"mid": [{"value": 36899}], "uuid": [{"value": "dda30e8a-ea0d-4288-950e-26a9c7505d67"}], "vid": [{"value": 36899}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13084-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No. 12<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\ntt<br />\nis<br />\n<br />\nHOPKINS,3 ST.JOHN'S 0<br />\n<br />\nr-<br />\n<br />\nDR. HOLLANDER ADDRESSES SIXTEEN FOREIGN NATIONS STUDENT BODY SHOWS PEP<br />\nTHURSDAY ASSEMBLY ON<br />\nREPRESENTED IN STUAT TRADITIONAL BON\"BUSINESS FORECASTING\"<br />\nDENT BODY AT HOPFIRE AND PARADE<br />\nKINS<br />\nTells of Valuable Development in EcoSt. John's Cremated. Torchlight Panomic Field. Mr. Ball to Be Presented with Clock<br />\n<br />\nY. M. C. A. Compiles Statistics of Foreign Students in All University<br />\nDepartments<br />\n<br />\nrade Held Downtown. Student<br />\nBody Marches to Field<br />\n<br />\nBLACK AND BLUE HARD PRESSED<br />\nTO WIN OVER ST. JOHN'S TEAM<br />\n<br />\nDr. Jacob H. Hollander, Profes\"Pep\" ran riot, and spirit overIn the figures recently given out flowed when the Student Body Annapolis Squad Makes More 'Trouble Than<br />\nsor of Political Economy at this<br />\nExpected for Hopkins in Annual Contest<br />\nUniversity, discussed at last Thurs- by the Registrar's Office, it is inter- celebrated the annual St. John's<br />\nesting to note that although the today's assembly recent attempts to<br />\nSt. John's gave the Black and Blue football enthusiasts a reason<br />\nday activities last Friday and<br />\ntal registration of the University<br />\nevolve a reliable system of business has become greater, several of the Saturday. Beginning early Fri- for holding their breath last Saturday afternoon when the Annapolis,<br />\nforecasting and told'of the success departments have fallen off in at- day morning boxes began to pile eleven held the strong J. H. U. machine to a 3-0 score. A scant<br />\neight thousand spectators saw the game which was one of the most<br />\nthat has thus far been achieved. In tendance. Of course, in order that up for St. John's crematory pyre,<br />\nthrilling contests that has been staged at Homewood this fall, a large<br />\nexplanation of his subject, he said the total be increased there must and by the time of the midday<br />\npart of the general football-loving public having gone to the Armythat \"Business Forecasting,\" al- have been a 'growth in other de- cheer practice there was<br />\nquite a Fleet game at the Stadium. The teams were more evenly matched<br />\nthough a science, does- more than partments and this is shown in<br />\nrespectable pile on hand. Not con- than had been thought before the game, with St. John's having a<br />\nconsider the present relations of the following paragraphs.<br />\ntent with this, two trucks, slight advantage in weight.<br />\nfacts; to accomplish its purpose, The Graduate School of Arts<br />\nmanned by students, scoured the<br />\nThe local team, although fahowever, forecasting must include and Sciences, in the collegiate year<br />\ncity for additional combustibles TICKETS FOR STATE GAME vored to win,<br />\nat no time had their<br />\nprevision. It has as its-object the 1922-23 had 213 full time students<br />\nand by 7.30 P. M. there was the NOW ON SALE AT OFFICE<br />\nopponents under their power. Startpreditting of business conditions in and 54 part time students, a total<br />\nlargest bonfire pile in the history OF GRADUATE MANAGER<br />\ngeneral.<br />\nof 267. This year an increase of of the University ready<br />\nHopkins<br />\nto Hold West Side of Grand, ing the game with a poor kick-off,<br />\nto have stand for<br />\nContest on Thanksgiving<br />\nThe increase in the range of bus- 49 is shown; one more full time the toroh applied.<br />\nthe Hopkins squad met difficulty<br />\nHopkins<br />\niness with the size of big corpora- scholar and 48 more taking part<br />\nrooters will view the all<br />\nThe students began to gather<br />\nthrough he battle and from<br />\ntions makes business forecasting time courses.<br />\nearly and when the Band marched game with the University of the start it was evident to the aunot only desirable, but actually necThe Department of Medicine on the field at 7.15 fully two- Maryland from the west side of dience<br />\nthat the game was to be a<br />\nessary for social as well as eco- which consists of candidates for the thirds of the undergraduate body the Stadium as was decided by a close<br />\none. During the first period<br />\nnomic reasons. The effects of \"bad degree of Doctor of Medicine has was on hand. The torch was then committee which made arrangeneither side was able to make any<br />\ntimes\" upon the condition of society decreased its enrollment, last year applied, and the roaring flames ments for the big Thanksgiving<br />\nsubstantial advances against the<br />\nmust be considered just as much as there were 336 \"meds\" and this drove the crowd back a distance contest. The west side of the huge<br />\nother although Dugan's charges<br />\nthe purely economic effects.<br />\nyear there are 30 less.<br />\nof fifty yards; the black night be- bowl is the shady side, so the through the line looked threatenIt is a historical fact that good<br />\nThe School of Hygiene and Pub- came as light as day, and the stu- J. H. U. supporters will be able ing to<br />\nthe J. H. U.lads. Fortunatetimes and bad times have succeeded lic Health has gained 11 students. dents were blistered, as they fol- to see the game without being ly<br />\nfor Coach Van Orman's<br />\neach other with surprising regular- Last year there were 105 full time lowed the band around the fire. obliged to shade their eyes from<br />\ncharges, Dugan's teammates were<br />\nity. Especially after 1800, Dr. Hol- and 21 part time students, and this<br />\nSt. John's effigy, in the cos- the sun all afternoon. Tickets for not able to complete<br />\nthe distance<br />\nlander said, crashes came at inter- year there are 98 full time and 49 tume of a football warrior, was the battle are on sale now at sevleft by his fierce dashes -for the<br />\nvals tantalizingly close to ten year part time; totals of 136 and 147 for consumed by the flames almost at eral places in the city, the early<br />\nnecessary ten-yard interval, thus<br />\nperiods. There were irregularities 1922-23 and 1923-24, respectively. once, and dropped into the in- sale being made so the fans can<br />\nforcing Darley to kick to Hopkins<br />\nin the intervals, however, and herePassing now to departments more ferno to the sound of the \"Hulla- secure tickets without standing in<br />\nrepeatedly. Turnbull punted the<br />\nin lay the difficulties to be sur- familiar to most of the undergrads baloo\". The funeral march line for hours as is usually the<br />\nball back as often as Darley, as<br />\nmounted. All sorts of fantastic so- there is an increase of five in the around the fire continued until case when the sale is late.<br />\nthe Black and Blue backs also<br />\nlutions were suggested, based on College of Arts and Sciences. There the flames had nearly died away, Although the price of a seat ana<br />\ncould not make the required ten<br />\nPopular superstitions, proverbs, or were, in 1922-23, 351 full time stu- and then with the Band playing admission at the Stadium will be<br />\nyards when they needed it. The<br />\nsome equally unsubstantial founda- dents and three part time. This \"Johnny Hopkins on to Victory,\" two dollars, rooters on both sides<br />\ntwo kickers displayed equal abiltion. There were, however, two year there, are 354 of the former and the excited crowd snake- will be admitted to reserved seats<br />\nity, causing the ball to pivot<br />\ndancing from one side of Charles for one dollar apiece. The best<br />\ntheories worthy of special atten- and five of the latter.<br />\naround<br />\nthe center line throughout<br />\ntion.<br />\nFrom Gilman Hall to the Engi- street to the other, the line of seats in the stands, those in secthe quarter.<br />\nThe first theory was based on the neering Building. Here, in the march for the center of the city tions I and J, have been reserved<br />\nToward the end of the first<br />\nbelief that business prosperity and School of Engineering, a large de- was taken up. Flaring red torches for the rooting section thus makquarter<br />\nMaxwell intercepted a<br />\nhamper crops go hand in hand. To crease is found. Where there were were' lit, and an escort for the ing two inducements for fans to<br />\nlong<br />\npass<br />\nfrom Darley running to<br />\nPredict business conditions, one 269 full time men and one taking skeleton of St. John's, which join the cheering sections. Hopthe<br />\n30-yard<br />\nline. Three times the<br />\nmust be able to predict the size of a part time course last year, there somebody had obviously rescued kins must get a good start to have.<br />\nthe crops. Bumper crops, in turn, are now only 230 full time engi- from the flames, was formed, as large a crowd of active rooters Hopkins quarterback tested the<br />\narmed with gasoline torches.<br />\ndepend on natural conditions, which neers and two part time men.<br />\nas the College Parkers, for Curly opposing line without avail, finally<br />\nThe<br />\nfirst<br />\npause<br />\nwas<br />\nmade<br />\nat<br />\nare just as hard to predict. The<br />\nIn the School of Business EcoByrd has already ordered four calling on Doug Turnbull to try a<br />\nGoucher<br />\nfor<br />\na<br />\nfew<br />\ngirls<br />\nsongs;<br />\nand<br />\nforces of nature which produce con- nomics, the \"baby\" of the Univerthousand reserved seats, which he placement kick. Several St. John's<br />\nparade<br />\nthe<br />\nthen<br />\nproceeded<br />\ndown<br />\nditions favorable to agrizniture were sity, we find a substantial increase,<br />\nintends to sell to the students and players broke through the line in<br />\ntime to block the kick, Schacht reCharles<br />\nstreet<br />\nto<br />\nFranklin,<br />\nfrom<br />\nmudied in an attempt to find a re- the attendance having jumped from<br />\nalumni of his institution.<br />\ncovering<br />\nto<br />\nthere<br />\nHoward,<br />\nthe ball the minute it<br />\nto<br />\nBaltimore,<br />\nto<br />\nliable indicator of weather 'condi- 19 last year to 45 this year, more<br />\nIn order that Hopkins men can<br />\ntouched<br />\nSun<br />\nSquare,<br />\nVernon<br />\nthe<br />\nto<br />\nMt.<br />\nPlace.<br />\nground._ On the next<br />\ntions. Such theories as the sun than doubling the attendance.<br />\nget their tickets without difficulty<br />\nplay<br />\nThe<br />\na<br />\nyelling<br />\nconstant,<br />\nSt.<br />\nwas<br />\ninterJohn's<br />\nplayer pulled the<br />\nspots and planetary theories were<br />\nIn the College for Teachers we<br />\nthe athletic office at Homewood<br />\nbrought forward. They were<br />\nfind a drop; from 1,066 (which rupted only by singing of Hop- has taken over the principal Balti- pigskin out of the air when TayCued, however, because it is a com- most of us associate with William kins songs. When the leaders' in- more agency for them. These tick- lor tried a forward pass to Rich,<br />\nbination of natural force;, not a the Conqueror) to 1,027 enrolled vention failed, the crowei took up ets are available at any time at the carrying it 20 yards up the field.<br />\na staccato shout; \"Oh; Beat St.<br />\nsingle force, that determines the for 1923-24.<br />\nA. A. office, Spalding's and Al- Following a good punt by TurnJohn's!<br />\nOh!<br />\n!\"<br />\nJohn's<br />\nSt.<br />\nin<br />\nBeat<br />\nof the weather.<br />\nbaugh's. The graduate manager bull, Darley made the initial first<br />\nIn Social Economics the full<br />\nan<br />\nendless<br />\nrepetition.<br />\nDr.<br />\nsaid.<br />\n\"The second theory,\"<br />\nhas expressed a desire that all down of the game, circling the end<br />\ntimers are included under the gradSun<br />\nAt<br />\nprocession<br />\nSquare<br />\nthe<br />\naxiom<br />\nHollander, \"makes use of the<br />\nmembers of the undergraduate of the line for 15 yards just as- the<br />\nuate department but in the part<br />\nstopped<br />\nfor<br />\nsecond<br />\ntime.<br />\nthe<br />\nBy<br />\n'Don't laugh too much, or you'll time students there is an increase<br />\nbody help dispose of the several quarter ended.<br />\nnow<br />\neveryone<br />\nwas<br />\nnearly<br />\nexhaustcry.' Humanity cannot go ahead on from seven last year to 22.this.<br />\nWith the ball on the 30-yard<br />\nthousand seats that are on sale<br />\nan even keel, at a constant pace.\" In the Evening Courses there is ed by constant yelling, singing, on the campus. The one dollar line at the opening of the second<br />\nThe speaker went to to say that, an increase in both the Technical<br />\nContinued on page 2 col. 5<br />\nseats are limited to students, grad- period, Darley dropped back for<br />\nas a result of this tendency of hu- Courses and in Business Economics.<br />\nuate students and members of the an attempt to kick a field goal,<br />\nmanity, business had its laughing In the former there is an increase<br />\nwhich failed by a dangerously<br />\nfaculty.<br />\nPeriods and crying periods. At- of 60 over last year's enrollment of<br />\nSeveral prominent men in the close margin. Turnbull puntea on<br />\ntempts to ascertain the duration of 615, and in the latter there are 302<br />\nstate have been invited to attend the next play putting the ball out<br />\nthese periods were unsuccessful, so registered this year as against 262<br />\nthe Thanksgiving Day game. The of danger. A succession of exthe second theory also went by the last year.?<br />\nMayor of Baltimore, and Governor changes lasted until the end of the<br />\nboard.<br />\nIn the courses given last summer<br />\nRitchie are expected to view the quarter, when after two long forDuring the war, a group of bril- the attendance dropped from 785 to<br />\ncontest, dividing their time be- ward passes the Johnnies were<br />\nliant economists was formed for 753, a decrease of 32.<br />\ntween either side of the grand- again within dropkicking distance.<br />\nadvisory purposes. These men atThe total attendance for this<br />\nstand. Thus the official guests can Darley was hurried in his second<br />\ntacked the problem by the empirical year, making allowances for, those<br />\nsnend half their time supporting attempt,to score and consequently<br />\nTICKETS $1<br />\neither side.<br />\nContinued on page 3, col. 2<br />\nContinued on Page 3, col. I<br />\nContinued on page 4, col. 3<br />\n<br />\nBuy your<br />\nTicket for<br />\nU. of Maryland<br />\nGame now!<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nMayb©<br />\n<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nWe received a deep and bitter<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\ndisappointment not long ago—all<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nINFANT PRODIGY AT HOPKINS BEATS N. Y. U.'S<br />\nYOUNGEST IN YOUTH<br />\nWilliam Taft Feldman Only Fourteen<br />\nYears Old, is One of Bright Men<br />\nin Freshman Class<br />\n<br />\nRecently an article appeared in<br />\nthe weekly paper of the University<br />\nof New York stating that their \"infant prodigy\" was one of the<br />\nyoungest in the country. The article stated that the miracle child of<br />\nthe metropolitan institution would<br />\nnot reach the age of fifteen until<br />\nthe first of December and then<br />\nwent on to say that he was a schol-<br />\n<br />\n‘‘.<br />\n<br />\nC,,,<br />\nCORONA<br />\nHave you<br />\nseen it?<br />\n<br />\nthe deeper and much more bitter<br />\nPublished semi-weekly from October to June by the students of Johns because we were at first mistakenHopkins University.<br />\nly overjoyed. A clipping from<br />\n\"The Dartmouth\" was the cause.<br />\n41Something new in portable<br />\nBusiness communications should be addressed to the BUSINESS MAN- At first glance we saw \"Darttypewriters.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\ncapsports<br />\nmajor<br />\nfour<br />\nmouth's<br />\nshould be sent to the MANAGING EDITOR.<br />\n41It writes nearly all lantains have . . . combined marks<br />\nguages.<br />\nthe<br />\nIn<br />\n3.3.\"<br />\nto<br />\naveraging<br />\n.<br />\n.<br />\n.<br />\nHomewood 100<br />\nTelephone<br />\n41Has 90 characters.<br />\nmidst of our heartfelt approval we astic genius and so forth.<br />\nnoticed that Dartmouth's grades<br />\nSee Fred Rich, College<br />\nHopkins has done better than the<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nRepresentative<br />\nbegin at the other end of the scale. New York School in this respect.<br />\nJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nAll four men at present are above<br />\nThe infant prodigy at Homewood<br />\n118 W. FAYETTE ST.<br />\nManaging Editor<br />\nthe Phi Beta Kappa requirement.<br />\nAdvertising Manager<br />\nwill attain the mature age of fifteen<br />\nBALTIMORE, MD.<br />\nWILLIAM G. DEAN, JR., '24<br />\nA dull sickening thud—cherished<br />\nhe<br />\n1924,<br />\nFITZGERALD DUNNING, '24<br />\nMarch,<br />\nof<br />\nfourth<br />\non the<br />\ndreams shattered—an idol with<br />\nAssistant Managing Editor<br />\nis a scholastic genius, and what is<br />\nCirculation Manager<br />\nfeet of clay smashed.<br />\nT. REESE MARSH, '24<br />\nmore he is a perfectly normal and<br />\n* *<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\n\"Sham,\" \"Bells,\" and \"Forbidden quite likable boy.<br />\nWilliam Taft Feldman is the<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25<br />\nFruit\" are the titles of three oneJOHN W. PARSONS, '25<br />\nHome- name of Hopkins' youngest candi\"The<br />\nby<br />\nD. MILES MARRIAN,'25<br />\npresented<br />\nplays<br />\nact<br />\nBENJAMIN T. ROME,'25<br />\nG. DONALD GIESKE,'25<br />\nwood Playshop\" on November 2d date for the degree of Bachelor of<br />\nJunior Editors<br />\nJOHN T. DIXON, '24<br />\nArts. To those who know him<br />\nand 3d.<br />\nA. J. McKAY, '26<br />\nW. EDWARD THOMsEN, JR., '26<br />\n(he's called \"Prod\" for<br />\n\"Prod\"<br />\na<br />\nis<br />\nplay,<br />\nopening<br />\n\"Sham,\" the<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE TOVELL, '24<br />\nof prodigy) is a very<br />\nERNEST A. STRATHMAN, '26<br />\nform<br />\nshort<br />\nmodern<br />\nthe<br />\nclever comedy satirizing<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. HISS, '26<br />\nman. He got his<br />\nyoung<br />\npromising<br />\ntendency toward superficiality.<br />\nJ. JACKSON KIDD, '26<br />\nEDWARD O. MICHEL, '26<br />\nat the Baltieducation<br />\nCHARLES G. HUTZLER, '24<br />\npreparatory<br />\nT. STRAN SUMMERS, '25<br />\nBy far the most absorbing of the<br />\nhe first<br />\nwhere<br />\nCollege,<br />\ngroup was Arthur D. Kaufman's more City<br />\nteachers<br />\nhis<br />\nof<br />\ntragic picture of immigrant life, drew the attention<br />\nMember Southern Intercollegiate Newspaper Association<br />\n\"Bells.\" Miss Loewenson, as the and classmates by fulfilling the restruggling mother, gave a truly fine quirements for. graduation in three<br />\nNeatly combed,'well-('pt hair is a<br />\nperformance. The character of Al- years with an average of something<br />\nMd.<br />\nbusiness and social asset.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nSTACOMB makes the hair stay combed<br />\nexander, the weak-minded son, vic- over 90. That was not \"Prod's\"<br />\nin any style you like even after it has<br />\ntim of Old World hardships, was only intellectual attainment, for he<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nand<br />\nfall<br />\nthis<br />\nHomewood<br />\nto<br />\nexcepcame<br />\nthis<br />\nWith<br />\n1923<br />\n13,<br />\nconvincing.<br />\nnot<br />\nBALTIMORE, MD., NOVEMBER<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\ntion the play was excellent and won a Hopkins scholarship in the<br />\nfor free trial tube.<br />\na<br />\nagainst<br />\nexaminations<br />\ncompetitive<br />\namateurof<br />\ntrace<br />\na<br />\ngiven without<br />\nTubes-35c Jars-75c<br />\nIT CAN BE DONE<br />\nishness. Even under the inevitable large group of fellows a great deal<br />\nInsist on STACOMB—in the black,<br />\nHopkins did not breathe a sigh of relief after the St. John's game<br />\nyellow and gold package.<br />\ncomparison, to older than himself. At this rate the<br />\n\"Humoresque<br />\nFor sale at your druggist or wherever<br />\ngathobstacle<br />\nlast<br />\nhis<br />\ncleared<br />\nhas<br />\nwho<br />\nhurdler<br />\nthe<br />\nAs<br />\nlast Saturday.<br />\ntoilet goods are sold.<br />\nof this type are sub- Black and Blue youngster should<br />\nplays<br />\nwhich<br />\nStandard Laboratories, Inc.<br />\ners together his reserve resources for a final dash to the finish, Johns<br />\njected, \"Bells\" suffers but little, for stand a good chance of going Phi<br />\n750 Stanford Avenue Los Angeles, California<br />\nseafor<br />\nthe<br />\ntraining<br />\nintensive<br />\nweeks'<br />\ntwo<br />\nto<br />\ndown<br />\nsettled<br />\nHopkins<br />\nSend coupon for Free Trial Tube.<br />\nits note of undiluted tragedy suited Beta Kappa when that august - ------,<br />\nson's climax, the game with the University of Maryland on Thanksof<br />\nits<br />\nSTANDARD LABORATOP.IES,Inn,<br />\nits length capitally. What three body confers the. distinction<br />\n750 Stanford Ave., Los Angeles, California. Dept. 1<br />\ngiving Day.<br />\nPlease aced me free trial tube.<br />\nacts of stark hopelessness would do membership several years hence.<br />\nwonderful<br />\nher<br />\nand<br />\nPenn<br />\nof<br />\ndefeat<br />\nMaryland's<br />\nto<br />\nSport fans point<br />\nName<br />\nOther organizations will have<br />\nto the theme we won't venture to<br />\nAddress<br />\nstand against Yale and predict a dire fate for Hopkins on Thanksgiv_<br />\nto cast favorable glances in<br />\ncause<br />\npredict.<br />\nof<br />\ntype<br />\nthe<br />\nrealize<br />\nWe<br />\npredictions.<br />\nno<br />\ning Day. We are making<br />\nA burlesque on the conventional his direction before long. \"Prod\"<br />\nteam that we are to meet. We realize that comparative scores show<br />\nSTUDENT BODY SHOWS PEP AT<br />\ntheme entitled \"Forbidden is a candidate for the NEWS-LETTER<br />\nromantic<br />\nTRADITIONAL BONFIRE<br />\nMaryland a victor by a considerable margin. We recall, however,<br />\nAND PARADE<br />\ninitial offering and a clever cub reporter is the<br />\nthe<br />\nbrought<br />\nFruit\"<br />\nuncomfortable<br />\nTiger<br />\nPrinceton<br />\nthe<br />\nthe fighting spirit which caused<br />\nfrom page 1<br />\nbelongs.<br />\nContinued<br />\nhe<br />\nrange<br />\nwhich<br />\nto<br />\nThe<br />\nclose.<br />\nclassification<br />\na<br />\nthe season to<br />\nmoments. We recall the airtight defense which has prevented visit- of<br />\n•<br />\nsudpo<br />\nfeel<br />\nthe<br />\nwill<br />\nwhile<br />\nclass<br />\nfreshman<br />\nThe<br />\ncomedy to tragedy,<br />\nand snake-dancing, which had<br />\ning teams from crossing the Hopkins goal line this season. We re- from<br />\npermember's\"<br />\ntheir<br />\n\"infant<br />\npainlessly<br />\nof<br />\ntency<br />\nand<br />\nneatly<br />\nlasted for the three miles march<br />\nden,<br />\nwas<br />\nhas<br />\nwhich<br />\nalertness<br />\ncall the knowledge of fundamentals and uncanny<br />\nhe<br />\nup<br />\nif<br />\naukeeps<br />\nthe<br />\nyears<br />\nBut no one that heard<br />\nfuture<br />\nto<br />\nleast<br />\nin<br />\npen<br />\nat<br />\ndowntown.<br />\nformed—painless<br />\nball\"<br />\nand<br />\nthe<br />\nmade the present Hopkins team famous for \"following<br />\nthat he has started. the cheers here would have<br />\nwork<br />\ngood<br />\nthe<br />\ndience.<br />\ntaking advantage of breaks.<br />\n***<br />\nFeldman's schedule marks him as guessed that fact. After a cheer<br />\nWe defy the dopesters and say \"it can be done.\" The team, howjournal a student of the classics as he in- ,for the Sun, the crowd \"ran<br />\ntheatrical<br />\nthe<br />\n\"Variety,\"<br />\nmore<br />\never, will have to fight harder and will have to follow the ball<br />\nconducting the latest New York cludes Greek and Latin among his wild\" to Mt. Vernon Place. After<br />\nclosely than it ever has before. Everything, in the next two weeks,<br />\ntwist—\"batting averages\" of the studies.<br />\nMathematics, English a final yell for \"Van Orman's<br />\nshould be subordinated to preparing for the Maryland game. Maryon<br />\nbased<br />\ncritics<br />\ndramatic<br />\nleading<br />\nR. 0. T. C. are his team,\" the Friday activities were<br />\nand<br />\nI,<br />\nComp.<br />\nland looks good. We feel, however, that a fighting Hopkins eleven,<br />\nsuccess<br />\nthe<br />\nto<br />\nas<br />\nprophecies<br />\nended.<br />\ntheir<br />\nsubjects.<br />\nother<br />\nthoroughly determined and thoroughly mad, can spring a surprise.<br />\ncalls<br />\nreview,<br />\nthey<br />\nSaturday at 1.30 a large part of<br />\nplays<br />\nof<br />\nfailure<br />\nor<br />\ntrouhad<br />\nhave<br />\nsophomores<br />\nThe<br />\nIT CAN BE DONE!<br />\n\"The Playshop\" \"probably the most ble with \"Prod\" on but one count. the Student Body formed on the<br />\npromising of all the local groups.\" He just won't wear long pants, or upper quadrangle and, headed by<br />\nTHE HONOR SYSTEM<br />\nAlthough such entertainment is short black socks. The second year the Band, marched to the field.<br />\nHopkins is justly proud of the effectiveness of its Honor System. right under their noses it appears men feel that he is not quite digni- The \"Frosh\" formed the usual<br />\nSeniors point to the fact that, in their four years of college, they have that the \"dormitory denizens\" have fied enough to be a Hopkins man. \"H\" in the stand, and the rest of<br />\nthe space was taken by uppernever witnessed cribbing or any other infraction of the code. Fresh- yet to discover it.<br />\n** *<br />\nclassmen.<br />\nmen marvel at the novelty of being left unwatched during a quiz<br />\npassed into the discard, and two<br />\nAdvertisements for the new WilThe tea-dance, and '23's formal<br />\nand, elated at their new responsibility, become staunch adherents of<br />\nones will be established\"—exnew<br />\nof<br />\nHonor<br />\nTemple<br />\n\"The<br />\nthe<br />\nthat<br />\npicture,<br />\nFox<br />\nof<br />\nliam<br />\ngratification<br />\nmatter<br />\na<br />\nin honor of the rival teams<br />\nindeed<br />\naffair<br />\nis<br />\nIt<br />\nthe \"system.\"<br />\ncerpt from Friday's News-Letter.<br />\ninshould<br />\nwhich<br />\ncast<br />\nuniversities,<br />\na<br />\nthe two-day activities<br />\nmany<br />\nannounce<br />\nand<br />\ncolleges<br />\nso<br />\nVenus,\"<br />\nat<br />\nfailed<br />\nconcluded<br />\nhas<br />\nSystem, which<br />\nOur personal interpretation of<br />\nalas<br />\nJohn's festivities. As<br />\nbeauties<br />\nAmerican<br />\nSt.<br />\nHopkins.<br />\nJohns<br />\nat<br />\n100<br />\ncludes<br />\nthe<br />\npracticality<br />\nof<br />\nbe an absolute<br />\nthe word tradition has always been<br />\nman<br />\nwas heard to remark,<br />\nevery<br />\nwonthe<br />\nall<br />\nand<br />\n\"Frosh\"<br />\nwhich<br />\npresupposes<br />\nSystem,<br />\nmermaids<br />\nHonor<br />\nluring<br />\none<br />\nAccording to the<br />\na little vague, we admit. But the<br />\nMaryland.\"<br />\nlife.<br />\ncollege<br />\nof<br />\nto<br />\nall<br />\nfor<br />\napply<br />\ndeep.\"<br />\nphases<br />\nshould<br />\n\"vasty<br />\nthe<br />\n\"Now<br />\ncode<br />\nders of the<br />\nto be a gentleman,<br />\nsetting up of new ones over night<br />\nIt seems some young advertising<br />\nAn article which is left on the campus should be as safe as if it were<br />\nincongruous with our hazy Y. M. C. A. HAS HANDBOOKS FOR<br />\nseemed<br />\nguarded by lock or key. We believe that this generally is the. case. man lost the chance of his life when<br />\nTHOSE WHO HAVE NOT OBdefinition. Turning to the \"New<br />\nThe Honor System, too, should apply to the maintenance of the he didn't substitute \"nasty\" for<br />\nTAINED THEM<br />\n\"tradition\":<br />\nunder<br />\nread<br />\nOxford\" we<br />\nRushing Agreement which is being studied more and more closely as \"vasty.\"<br />\nHopkins<br />\nY. M. C. A. wishes<br />\nThe<br />\npractice<br />\nor<br />\nbelief,<br />\n\"A statement,<br />\n***<br />\nthe date of the formal opening of rushing season approaches. Every<br />\nto<br />\ncall<br />\nthe fact that some<br />\nattention<br />\nto<br />\ngentransmitted from generation to<br />\nyear there have been cases where fraternities have been guilty of vio- \"Lost—An overcoat belonging to<br />\nstudents<br />\nhave<br />\nnot<br />\nyet obtained their<br />\neration.\"<br />\nlating the \"spirit\" of the agreement. Although 'no fraternity has J. C. Mills. Finder put same in<br />\nThe<br />\nfew that remain<br />\nhandbooks.<br />\nThat was the meaning nearest to<br />\nbeen found guilty of absolute breaches, there have appeared numer- Box 128\"—a recent notice in the<br />\nby<br />\neither graduate<br />\nthe present Hopkins system of may be obtained<br />\nous cases where advantage has been taken of technicalities in order NEWS-LETTER.<br />\nor<br />\nundergraduate<br />\nstudents.<br />\nThis is<br />\nWhen<br />\na<br />\na<br />\nday.<br />\ntradition<br />\nadopting<br />\nTo any one who has tried to get<br />\nto gain the desired end.<br />\nunusual<br />\nan<br />\nas<br />\ncircumstance<br />\nthe<br />\nsupnot<br />\nwere<br />\nwere<br />\nthey<br />\nmade<br />\nantiques<br />\nWe believe that there is not a Hopkins man who would know- his mail, much less a small package,<br />\nthese<br />\nply<br />\nof<br />\nhelpful<br />\nmanuals<br />\nhas<br />\naldon't<br />\npray<br />\nas<br />\nantiques;<br />\nintended<br />\ningly cheat in an examination. Such a person, if he did exist and was out of one of those rat traps of Mr.<br />\nin<br />\nshort<br />\nyears.<br />\nrun<br />\nways<br />\nfor<br />\n.<br />\nprevious<br />\ntraditions<br />\nlet<br />\nus<br />\nmanufacture<br />\ndetected, would receive but little sympathy from the student body. Myers further comment is superthe express purpose of having our The Y council hopes that students<br />\nWe fail to see, however, how a man who violates either the letter or fluous.<br />\n*<br />\n*<br />\n*<br />\nown \"folklore.\" Let's wait, in the in need of a campus \"encyclopedia\"<br />\nthe spirit of the Rushing Agreement, is any less culpable than he who<br />\n\"If the present plans go through future, at least a week before will call for one as they are a dead<br />\ncheats at an examination.<br />\nwaste when not in use.<br />\nan old Hopkins tradition will be branding new plans as traditions.<br />\nBoth are guilty of conduct unbecoming to a gentleman.<br />\n<br />\nor<br />\n. _. . . . . .._-„ii<br />\nIiinruly air<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br />\nBLACK AND BLUE DEFEAT ST.<br />\nJOHN'S<br />\nContinued from page 1<br />\n<br />\nDR. HOLLANDER ADDRESSES THE ENGINEERS TO VISIT COPPER<br />\nTHURSDAY ASSEMBLY ON<br />\nREFINING PLANT<br />\n\"BUSINESS FORECASTING\"<br />\nContinued from page 1<br />\nNext' Saturday, November 17, a<br />\n<br />\n3<br />\n<br />\nBEAT<br />\nMaryland State!<br />\n<br />\nmissed the cross bar by a large<br />\nmethod; they sought not the causes party composed of engineering<br />\ndistance. Previous to the attemptbut the occasion of things. They juniors and seniors of the Materied field goal, Bonner caught two found that there are three symp- als of Engineering ,Class will visit<br />\nforward passes, gaining consider- toms which can safely be used as the plant of the Baltimore Copper<br />\nGERHARD & REED CO.<br />\nable distance and making Hop- guides in business forecasting. (1) Smelting and Refining Company,<br />\nTAILORS<br />\nkins' only first down for the first An easy money market; (2) Ac- located near Canton. The group<br />\nOf course you know that<br />\ntive<br />\nspeculation;<br />\n(3) Business aC- will be headed by Professor Alexhalf of the game. St. John's is<br />\n1 1 0 N. EUTAW STREET<br />\nThe<br />\nBarn is handling orders<br />\ntivity. When one or two of these ander G. Christie, head of the decredited with having completed<br />\nfor<br />\nour<br />\nclothes again this<br />\n2nd Floor<br />\nsymptoms appear, it is reasonably partment of mechanical engineeryear.<br />\nthe distance four times in this in- safe to predict the<br />\ning, and Dr. William B. Kouwenthird.<br />\nterval of play.<br />\nThe plan worked to<br />\nBusiness forecasting of this sort hoven, associate professor in the<br />\nSARATOGA AT<br />\nmutual advantage last seaTurnbull made a fair kickoff at does not give precise information. same department.<br />\nLIBERTY STS.<br />\nson, and we're mighty glad<br />\nThe. party is scheduled to arrive<br />\nthe beginning of the third quarter, The demand for precise information<br />\nto continue the relationBonner recovering the ball on the is so insistent, however, that some at the upper works at 2.00 P. M.<br />\nLUNCHEON<br />\nship.<br />\nbusiness forecasting is done on a and the members will then pro25-yard line when the Annapolis<br />\nTEA<br />\ncommercial basis. Even in this ceed through the plant, under the<br />\nReady-to-wear Suits<br />\n$30 up<br />\nbacks failed to catch it. The only case, use is<br />\nDINNER<br />\nReady-to-wear O'Coats . $35 up<br />\nmade of these three guidance of officials of the comperiod of consistent gains followed symptoms.<br />\npany, examining at first hand the 11.30 A. M.<br />\nSPECIAL PARTIES<br />\n211-213 E. Baltimore St.<br />\nthis play and resulted in the tally<br />\nThere are three obstacles in gradual development of raw copuntil<br />\n7.30<br />\nP.<br />\nbusiness<br />\nM.<br />\nPLAZA 6987<br />\nforecasting on the basis per ore into finished bars of pure<br />\nthat kept the score from being a<br />\nblank. Taylor opened up the for- of these symptoms: 'first, there is copper, ready to be shipped to the<br />\nthe chance of an unforeseen event; important electrical and manufacward pass playing and sent one to<br />\nsecond, the length of the intervals turing companies of the world,<br />\nBonner for an 8-yard gain. Turnbetween symptoms. is uncertain; there to be used in every phase of<br />\nbull swept through the line for a third, it is impossible to state ex- engineering work.<br />\nfirst down. Taylor sent Turnbull actly when one period terminates<br />\nThe Baltimore Copper Smelting<br />\nthrough the line again-for a small and the next begins. In spite of and Refining Company has one<br />\ngain and seeing the futility of that these disadvantages, Dr. Hollan- of the largest copper producing<br />\ntype of play he gave the ball to der said in conclusion, a great plants in the world, and because it<br />\nstride forward has been made; and employs all the newest ideas and<br />\nBonner for an end run which re- \"big business\" is making<br />\nuse of inventions in the production ol<br />\nsulted in a failure, to gain ground business forecasting based on the copper, the trip is expected by<br />\nbut placed the ball squarely in observation of the three symp- Drs. Christie and Kouwenhoven<br />\nfront of the goal posts. Kneeling toms.<br />\nto prove of almost inestimable<br />\non the 20-yard line the J. H. U. Randolph Norwood, President benefit to the men making the<br />\ncaptain held the pigskin - while of the Student Council, announced trip.<br />\nTurnbull kicked it, making the that a few men in the Freshman<br />\nOne such trip to a very imporonly tally of the game three min- Class who are entitled to activities tant industrial corporation has alutes after the opening of the sec- buttons have not yet secured them ready been made by this class, the<br />\nond half. Five minutes later and must do so at once. About group having recently made an inSchacht caught a 40-yard pas 40 Freshmen are not yet engaged spection trip to the plant of the<br />\nfrom Taylor on the six-yard line in any activity, and, unless they go Bethlehem Steel Company, at<br />\nafter he had fallen to the ground. out for some activity immediately, Sparrows Point, Md. Here the<br />\nThe sprained ankle which he re- their names will be published in party observed the refining of iron<br />\nceived in the Western Maryland the News-Letter.<br />\nfrom the point -where it was unAs a token of the undergradu- loaded from ocean vessels carrygame gave away necessitating his<br />\nFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br />\nremoval from the contest. Berndt ates' affection for Mr. Thomas R. ing it from South America to<br />\nwas sent in to fill his place. Hop- Ball, who recently resigned his po- where it was cast into \"pig\" iron<br />\nkins was unable to reach the goal sition as registrar after 46 years' from the great blast furnaces, and<br />\nby plunging through St. John's service, a Seth Thomas clock will finally through the various interINSTRUCTION<br />\nline so Taylor tried a forward be presented to him at the next mediate stages of refining to the<br />\npass, the ball striking the goal assembly. A silver plate, suitably point where it was rolled, white GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of<br />\nArts; Doctor of Philosophy.<br />\npost and therefore going to the op- inscribed,- will be placed on the hot, into iron plates of the proper<br />\nMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nsize.<br />\nponents. After this \"neither team back of the'clock. •<br />\nThe rest of the assembly hour<br />\nThese trips are given from time COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nwas able to get within striking diswas devoted to arousing \"pep\" for to time by the mechanical engi- SCHOOL OF ENGINEERING. Degrees: Doctor of Engineering; Mastance of the other's goal.<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nThe game was marked by the the St. John's game.<br />\nneering department to properly<br />\nChemistry.<br />\nexcellent playing of several indicorrelate practical work with the<br />\nFRESHMEN APPOINT PEP<br />\nviduals although the teamwork of<br />\ntheoretical side of engineering SCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubCOMMITTEE<br />\nlic Heajth; Doctor of Science and Bachelor of Science in Hygiene; Cerboth machines was not especially<br />\ngiven in the classroom. The stutificate in Public Health.<br />\nThe Freshmen held a short class<br />\ngood. Turnbull, Wolbert and Bardents derive the benefit of seeing<br />\nmeeting on Thursday immediately<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nton starred for Hopkins while<br />\noperations performed in actual<br />\nfollowing the Student Assembly.<br />\nparley, Dugan and Barger did<br />\npractice which they have recently COLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nThe most important business was<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nbest for St. John's. The playing<br />\nstudied in text-books.<br />\nthat concerning the Freshman<br />\nArts or of Science.<br />\nof Barton was exceptional, the<br />\nDance and the appointment of a<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nsturdy Texan being in on every<br />\n\"Pep\" Committee.<br />\nPlay, both defensive and offensive.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\nAll plans for the Freshman<br />\nTaylor's work at quarterback<br />\ndance were discontinued because<br />\nshowed improvement over his preof the action of the Student Counvious generalship of the Black and<br />\ncil. They took the stand that a<br />\nBlue eleven.<br />\nFreshman dance would not be sucJOHNS HOPKINS PRESS PUBLICATIONS.<br />\nDuring the game St. John's and<br />\ncessful, as in previous years the<br />\nHopkins made an equal number<br />\ndances of the Freshman class did<br />\n(5) first downs.<br />\nnot pay for themselves. They sugLineup:<br />\ngested that there be a class smoker<br />\nHopkins (3)<br />\nSt. John's (0)<br />\nBUILDINGS<br />\nwhich would fulfill the same purIt's a queer one, a puzzler—and<br />\nSchacht<br />\nLE<br />\nJarvis pose of the dance and yet be finanyet it's true! He has found<br />\nGILMAN HALL—General library, class rooms, biology? administration.<br />\nMagihl<br />\nBounds cially stable. The matter was<br />\nLT<br />\nsomething which gives him<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\npleasure, and the most incorrigBarton .......L.G<br />\n. Sticker handed over to the social commitible pessimist must admit it's<br />\nand College Chemistry.<br />\nbay.<br />\nBerry tee.<br />\nbeneficial.<br />\nENGINEERING—Housing also Geology.<br />\nCIVIL<br />\n\"Vaseline\"<br />\nTonic<br />\nHair<br />\nis<br />\nreason<br />\nthe<br />\nWolbert ......R.G.<br />\nBarger<br />\nThe members of the Smoker<br />\nfor this unique experience. It's the<br />\nclassiest hair dressing ever, gives<br />\nPOWER HOUSE.<br />\nCarter<br />\nR T.<br />\nAlexander Committee are Schwinn, chairsnap and polish to the head. And—<br />\nRich<br />\n.................Helm man; Bahlke, Brown, Meredith,<br />\nBOTANY AND PLANT PHYSIOLOGY—With Greenhouses and Botanical<br />\nit helps the scalp.<br />\nAt all drug stores and student<br />\nGarden.<br />\nTaylor<br />\n0B<br />\nDarley Hines, Cleveland and McNeal.<br />\nbarber shops.<br />\nBonner ......L.H.<br />\nCHEMICAL<br />\nLABORATORY—For graduate work.<br />\nEvery<br />\n\"Vaseline\"<br />\nCain<br />\nproduct is recOn account of the lack of pep of<br />\nommended everywhere because of<br />\nTurnbull ................Dugan the Freshman class, President<br />\nits absolute purity and effectiveness.<br />\nPHYSIOLOGICAL BUILDING.<br />\nMaxwell .....F.B.. ..... Wegner Niner appointed a \"Pep\" CommitANATOMICAL LABORATORY.<br />\nSubstitutions—Hopkins, Slowik tee to have charge of all the activiHUNTERIAN LABORATORIES.<br />\nfor Carter, Carter for Slowik, Le- ties of the class under Freshmen<br />\nPATHOLOGICAL LABORATORY.<br />\nNrY for Day, Berndt for Schacht. regulations. After the St. John's<br />\nSCHOOL OF HYGIENE,<br />\nSt. John's Erberts for Jarvis, game they will have charge of<br />\ngivCARROLL MANSION—Johns Hopkins Club.<br />\n'Webb for Wegner, Lutz for Dar- ing out game tags, tending the<br />\nChesebroutjh Mf9,.Co.1 STUDENT ACTIVITIES BUILDING.<br />\nScorers—(Field goal) Turn- score boards and the ushering at<br />\n,<br />\n(Consolidated)<br />\nbull.<br />\nthe games.<br />\nALUMNI MEMORIAL DORMITORY.<br />\n<br />\nCLOTHES<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\nStrange!<br />\n<br />\nVaseline<br />\n<br />\nHAIR TONIC<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br />\n<br />\n4<br />\n<br />\nstudents on<br />\nFIELD COUNCIL OF Y. M. C. A. 0. D. K. LOOKS UP SCHOLAS- vakia, 2; Siam, 2; Hungary, 2; Can- for a number of these<br />\n28, at 6:45<br />\nOF<br />\nNovember<br />\nTIC RECORDS<br />\nada, 2; Ecuador, 1; Java, 1; Hol- Wednesday,<br />\nMEETS AT DREW<br />\nATHLETES<br />\nbe<br />\ngiven at the Cenland, 1; Korea, 1.; France, 1; Ru- P. NI. It will<br />\nSEMINARY<br />\nUrges Athletic Men to Make Good<br />\nmania, 1; Spain, 1; Norway, 1; tral Y. M. C. A. Building.<br />\nT. R. Marsh Represents Local \"Y\".<br />\nClassroom Marks<br />\nForeign students at the following<br />\nAfrica, 1; Palestine, 1; and<br />\nSouth<br />\nProblems Effecting Policies<br />\nOne of the greatest setbacks to<br />\nwill be invited: Hopkins,<br />\ncolleges<br />\nDiscussed<br />\n1.<br />\nArmenia,<br />\nan enterprising team is the barring<br />\nAll<br />\nSizes<br />\nThe College Department of the School of Hygiene and Public<br />\nHopkins was *represented by T. of an athlete for scholastic reasons<br />\nMaryENINK<br />\nR. Marsh at a meeting of the Mid- from a team, at the time wnen he Y. M. C. A. of Baltimore is plan- Health, the University of<br />\nFOUNTAIN<br />\n6ELfoyen.,12,17,c6,<br />\nCollege.<br />\nGoucher<br />\nand<br />\nland<br />\ndinner<br />\nThanksgiving<br />\na<br />\ngive<br />\nto<br />\nning<br />\ndle Atlantic Field Council, of the is most necessary for the team's<br />\nY. M. C. A., held at Drew Sem- success. 0. D. K. has decided to<br />\ninary, New Jersey, November 2-4, prevent anything of this nature<br />\nFor real Fountain Pen Satisfaction<br />\ninclusive. There are two represen- happening here, by assigning men<br />\nUse<br />\ntatives from each state, but Marsh to see that the athletes make good<br />\nand individuality is offered here at prices that are not<br />\n\"The Ink That Made<br />\nwas the only Maryland delegate records in classroom work as well<br />\nand cannot be underquoted by any house at any time.<br />\nThe Fountain Pen Possible\" on hand.<br />\nas in athletics. The society has<br />\n(j_ Besides the reputation of an old-established firm<br />\nThe Field Council is an interme- also appointed a committee to inis back of each sale with a guarantee.<br />\ndiate step between the various vestigate the Publicity Board, and<br />\nFOUNTAIN PEN INK<br />\ncampus Y. M. C. A.'s and the Na- it is expected to be in working<br />\ntional Association of Student Y. order in the near future. The Song<br />\nDECORATIONS<br />\nDRAPERIES<br />\nM. C. A.'s. At this meeting the Book Committee promises the FURNITURE<br />\nof<br />\nedition<br />\nnew<br />\na<br />\nof<br />\narrival<br />\n343 NORTH CHARLES STREET<br />\nCouncil decided upon the program early<br />\nfor the Silver Bay Summer Con- songs and yells which shall be<br />\nference next year, and likewise de- printed under the auspices of the<br />\ncided that together with the New fraternity.<br />\nEngland Conference, it will take<br />\nA law student at Wake Forest<br />\nfull charge of the Silver Bay ConCollege has hit upon a new methference. As this is entirely a stuod of reducing expenses to.a minLimited<br />\ndent work, the conference feels<br />\nimum. 'Arriving at college ten<br />\nthat the students should take the<br />\ndays late and finding no rooms<br />\nBARN CAFETERIA responsibility of the Conference aVailable in the dormitory or in<br />\nfrom the shoulders of the Nationprivate homes, he pitched an army<br />\nal Secretaries.<br />\ntent on the campus and with the<br />\ngICIEEN ILatEICIEIKAITIc ECIEINENEIEEMME<br />\nThe Field Council likewise dis- aid of his camping outfit used<br />\ncussed the relation between the during the summer prepares his<br />\ncampus Y. M. C. A. and the Stu- own meals. During the winter<br />\ndent Volunteer Movement, and months the camp stove on which<br />\nthe student Y. W. C. A., especially he cooks his meals will serve as a<br />\nwith regard to co-educational col- heating plant.—Old Gold and<br />\nleges.<br />\nBlack.<br />\nIf the Council's plans work out<br />\n\"The King of Lubricants\" it will be necessary for both the SIXTEEN FOREIGN NATIONS REPRESENTED IN STUDENT BODY<br />\nMiddle Atlantic and New England<br />\nAT HOPKINS<br />\nSHERWOOD BROTHERS, INC.<br />\nCouncils to hold a meeting in New<br />\nContinued from page 1<br />\nEgIggEGIEEgEgEETE:NEt GEMEIEgEEIZEIN York City, or in Indianapolis dur- counted more.than once in the difing the convention of the Student ferent departments, is 3,731, as<br />\nVolunteer. Movement, which will against a total registration of 3,652<br />\nBoys, the place to get your<br />\nbe held during the Christmas holi- for 1922-23. This is an increase<br />\nORIGINAL<br />\nmeals—and they are hondays.<br />\nin total registration for this year<br />\nwell<br />\nmeals,<br />\nyear.<br />\nover<br />\nlast<br />\nest-to-goodness<br />\nIt is interesting to note that of 74<br />\nStatistics on the registration of<br />\nHopkins has always had a repres erve d, and reasonably<br />\nsentative in the Field Council. T. foreign students at Hopkins, and<br />\n\"The One Cigarette Sold the World Over\"<br />\npriced—is at<br />\nR. Marsh is now serving his sec- elsewhere in Maryland, always an<br />\nond year on the Council as Hop- interesting subject, have been compiled this year by the Hopkins Y.<br />\nkins' delegate.<br />\nM. C. A.<br />\nPRESCRIPTION DRUGGISTS<br />\nAccording to these statistics there<br />\nFIRST COTILLON TO BE<br />\nTWO STORES:]<br />\nare 83 foreign students in BaltiDECEMBER 7<br />\nEutaw Place and North Ave.<br />\nSts.<br />\nChase<br />\nand<br />\nCharles<br />\n1817 N. Charles St.<br />\nmore divided between Hopkins<br />\nMadison 0405<br />\nThe first cotillon of the year will<br />\nVernon 0890<br />\nUniversity, the University of<br />\n(Half Block below North Ave.)<br />\ntake place at the Maryland CasuMaryland and Goucher College.<br />\nalty Clubhouse on December 7.<br />\nOf these, Hopkins, as a whole, has<br />\nNicholas Brown, Mgr.<br />\nElaborate preparations have been<br />\n64. The University of Maryland<br />\nmade and the Cotillon Club excomes next with 13, and Goucher<br />\npects to inaugurate the season<br />\nCollege boasts of 11.<br />\nwith a function that will serve as<br />\nOf the Hopkins foreign group,<br />\na precedent for those to be held<br />\nthere are 16 undergraduates, 34 at<br />\nAt the Washington Monument<br />\nin the future.<br />\nPrinters of Philological and<br />\nthe School of Hygiene and Public<br />\nScientific Works<br />\nFormerly it has been the cus- Health, and 9 in the Medical School.<br />\nOscar Thomas Olson, D.D.<br />\n23 S. HANOVER ST.<br />\ntom to give but one favor to a<br />\nThe distribution is as follows:<br />\nBaltimore, Md.<br />\nMinister<br />\ncouple, but this year the Cotillon China, 14; Porto Rico, 13; Russia,<br />\nClub is giving a favor to the men 7; Cuba, 5; Poland, 5; Brazil, 5;<br />\nHopkins Students Are Invited to<br />\nNECKWEAR also.<br />\nSHIRTS<br />\nJapan, 4; Philippines, 4; India, 3;<br />\nMake This Their Church Home<br />\nThe patronesses will be Dr. and Colombia, 2; Peru, 2; CzechosloMrs. Frank J. Goodnow, Dr. and<br />\nThe purpose and program of th:s<br />\nST.<br />\nN.<br />\nHOWARD<br />\n421<br />\nMrs. John H. Latane, Dr. and Mrs.<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nGLOVES John B. Whitehead, Dr. and Mrs.<br />\nHOSIERY<br />\nj/Elliott Gilpin and Mr. and Mrs.<br />\nfrom five to seven.<br />\nJulian C. Smallwood.<br />\nThe Flag, Banner 8z Pennant Shop<br />\nmorning worship at I 1 o'clock.<br />\n1,1101111011<br />\n<br />\n11110111111111<br />\n/76<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nSANFORDS<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nNCO<br />\n<br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br />\n<br />\nN<br />\n<br />\nHOT012 CEO<br />\n<br />\nMELACHRINO<br />\n<br />\nThe St. REGIS<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\n<br />\nRESTAURANT<br />\n<br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nLeFranc & Ault<br />\n<br />\nSunday<br />\n<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nLEHIGH PSYCHOLOGICAL<br />\nTESTS RELIABLE<br />\nAll Freshmen entering Lehigh<br />\nin 1921 were required to take the<br />\nTrahue mentimeter psychology<br />\ntest. As a result of this test it<br />\nwas predicted that the fifty-seven<br />\nmen making the lowest scores,<br />\nplacing them among the lowest<br />\nPrinters of<br />\nseventeen per cent. of the class,<br />\nwould end their college career<br />\nThe Johns Hopkins<br />\nwithout a diploma. This prediction is being borne out, for of<br />\nNEWS-LETTER<br />\nthese fifty-seven men, all but sixteen have been dropped by the<br />\nCollege Literature<br />\nuniversity and these are doing<br />\npoor work and are not expected to<br />\nT.,OM BARD and SOUTH STREETS<br />\ncomplete their course.<br />\n<br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br />\n<br />\n\"At the heart of the City\"<br />\n<br />\nALL SEATS FREE<br />\n<br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nONE BLOCK SOUTH OF NORTH AVE.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No. 12<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\ntt<br />\nis<br /><br />\nHOPKINS,3 ST.JOHN'S 0<br /><br />\nr-<br /><br />\nDR. HOLLANDER ADDRESSES SIXTEEN FOREIGN NATIONS STUDENT BODY SHOWS PEP<br />\nTHURSDAY ASSEMBLY ON<br />\nREPRESENTED IN STUAT TRADITIONAL BON\"BUSINESS FORECASTING\"<br />\nDENT BODY AT HOPFIRE AND PARADE<br />\nKINS<br />\nTells of Valuable Development in EcoSt. John's Cremated. Torchlight Panomic Field. Mr. Ball to Be Presented with Clock<br /><br />\nY. M. C. A. Compiles Statistics of Foreign Students in All University<br />\nDepartments<br /><br />\nrade Held Downtown. Student<br />\nBody Marches to Field<br /><br />\nBLACK AND BLUE HARD PRESSED<br />\nTO WIN OVER ST. JOHN'S TEAM<br /><br />\nDr. Jacob H. Hollander, Profes\"Pep\" ran riot, and spirit overIn the figures recently given out flowed when the Student Body Annapolis Squad Makes More 'Trouble Than<br />\nsor of Political Economy at this<br />\nExpected for Hopkins in Annual Contest<br />\nUniversity, discussed at last Thurs- by the Registrar's Office, it is inter- celebrated the annual St. John's<br />\nesting to note that although the today's assembly recent attempts to<br />\nSt. John's gave the Black and Blue football enthusiasts a reason<br />\nday activities last Friday and<br />\ntal registration of the University<br />\nevolve a reliable system of business has become greater, several of the Saturday. Beginning early Fri- for holding their breath last Saturday afternoon when the Annapolis,<br />\nforecasting and told'of the success departments have fallen off in at- day morning boxes began to pile eleven held the strong J. H. U. machine to a 3-0 score. A scant<br />\neight thousand spectators saw the game which was one of the most<br />\nthat has thus far been achieved. In tendance. Of course, in order that up for St. John's crematory pyre,<br />\nthrilling contests that has been staged at Homewood this fall, a large<br />\nexplanation of his subject, he said the total be increased there must and by the time of the midday<br />\npart of the general football-loving public having gone to the Armythat \"Business Forecasting,\" al- have been a 'growth in other de- cheer practice there was<br />\nquite a Fleet game at the Stadium. The teams were more evenly matched<br />\nthough a science, does- more than partments and this is shown in<br />\nrespectable pile on hand. Not con- than had been thought before the game, with St. John's having a<br />\nconsider the present relations of the following paragraphs.<br />\ntent with this, two trucks, slight advantage in weight.<br />\nfacts; to accomplish its purpose, The Graduate School of Arts<br />\nmanned by students, scoured the<br />\nThe local team, although fahowever, forecasting must include and Sciences, in the collegiate year<br />\ncity for additional combustibles TICKETS FOR STATE GAME vored to win,<br />\nat no time had their<br />\nprevision. It has as its-object the 1922-23 had 213 full time students<br />\nand by 7.30 P. M. there was the NOW ON SALE AT OFFICE<br />\nopponents under their power. Startpreditting of business conditions in and 54 part time students, a total<br />\nlargest bonfire pile in the history OF GRADUATE MANAGER<br />\ngeneral.<br />\nof 267. This year an increase of of the University ready<br />\nHopkins<br />\nto Hold West Side of Grand, ing the game with a poor kick-off,<br />\nto have stand for<br />\nContest on Thanksgiving<br />\nThe increase in the range of bus- 49 is shown; one more full time the toroh applied.<br />\nthe Hopkins squad met difficulty<br />\nHopkins<br />\niness with the size of big corpora- scholar and 48 more taking part<br />\nrooters will view the all<br />\nThe students began to gather<br />\nthrough he battle and from<br />\ntions makes business forecasting time courses.<br />\nearly and when the Band marched game with the University of the start it was evident to the aunot only desirable, but actually necThe Department of Medicine on the field at 7.15 fully two- Maryland from the west side of dience<br />\nthat the game was to be a<br />\nessary for social as well as eco- which consists of candidates for the thirds of the undergraduate body the Stadium as was decided by a close<br />\none. During the first period<br />\nnomic reasons. The effects of \"bad degree of Doctor of Medicine has was on hand. The torch was then committee which made arrangeneither side was able to make any<br />\ntimes\" upon the condition of society decreased its enrollment, last year applied, and the roaring flames ments for the big Thanksgiving<br />\nsubstantial advances against the<br />\nmust be considered just as much as there were 336 \"meds\" and this drove the crowd back a distance contest. The west side of the huge<br />\nother although Dugan's charges<br />\nthe purely economic effects.<br />\nyear there are 30 less.<br />\nof fifty yards; the black night be- bowl is the shady side, so the through the line looked threatenIt is a historical fact that good<br />\nThe School of Hygiene and Pub- came as light as day, and the stu- J. H. U. supporters will be able ing to<br />\nthe J. H. U.lads. Fortunatetimes and bad times have succeeded lic Health has gained 11 students. dents were blistered, as they fol- to see the game without being ly<br />\nfor Coach Van Orman's<br />\neach other with surprising regular- Last year there were 105 full time lowed the band around the fire. obliged to shade their eyes from<br />\ncharges, Dugan's teammates were<br />\nity. Especially after 1800, Dr. Hol- and 21 part time students, and this<br />\nSt. John's effigy, in the cos- the sun all afternoon. Tickets for not able to complete<br />\nthe distance<br />\nlander said, crashes came at inter- year there are 98 full time and 49 tume of a football warrior, was the battle are on sale now at sevleft by his fierce dashes -for the<br />\nvals tantalizingly close to ten year part time; totals of 136 and 147 for consumed by the flames almost at eral places in the city, the early<br />\nnecessary ten-yard interval, thus<br />\nperiods. There were irregularities 1922-23 and 1923-24, respectively. once, and dropped into the in- sale being made so the fans can<br />\nforcing Darley to kick to Hopkins<br />\nin the intervals, however, and herePassing now to departments more ferno to the sound of the \"Hulla- secure tickets without standing in<br />\nrepeatedly. Turnbull punted the<br />\nin lay the difficulties to be sur- familiar to most of the undergrads baloo\". The funeral march line for hours as is usually the<br />\nball back as often as Darley, as<br />\nmounted. All sorts of fantastic so- there is an increase of five in the around the fire continued until case when the sale is late.<br />\nthe Black and Blue backs also<br />\nlutions were suggested, based on College of Arts and Sciences. There the flames had nearly died away, Although the price of a seat ana<br />\ncould not make the required ten<br />\nPopular superstitions, proverbs, or were, in 1922-23, 351 full time stu- and then with the Band playing admission at the Stadium will be<br />\nyards when they needed it. The<br />\nsome equally unsubstantial founda- dents and three part time. This \"Johnny Hopkins on to Victory,\" two dollars, rooters on both sides<br />\ntwo kickers displayed equal abiltion. There were, however, two year there, are 354 of the former and the excited crowd snake- will be admitted to reserved seats<br />\nity, causing the ball to pivot<br />\ndancing from one side of Charles for one dollar apiece. The best<br />\ntheories worthy of special atten- and five of the latter.<br />\naround<br />\nthe center line throughout<br />\ntion.<br />\nFrom Gilman Hall to the Engi- street to the other, the line of seats in the stands, those in secthe quarter.<br />\nThe first theory was based on the neering Building. Here, in the march for the center of the city tions I and J, have been reserved<br />\nToward the end of the first<br />\nbelief that business prosperity and School of Engineering, a large de- was taken up. Flaring red torches for the rooting section thus makquarter<br />\nMaxwell intercepted a<br />\nhamper crops go hand in hand. To crease is found. Where there were were' lit, and an escort for the ing two inducements for fans to<br />\nlong<br />\npass<br />\nfrom Darley running to<br />\nPredict business conditions, one 269 full time men and one taking skeleton of St. John's, which join the cheering sections. Hopthe<br />\n30-yard<br />\nline. Three times the<br />\nmust be able to predict the size of a part time course last year, there somebody had obviously rescued kins must get a good start to have.<br />\nthe crops. Bumper crops, in turn, are now only 230 full time engi- from the flames, was formed, as large a crowd of active rooters Hopkins quarterback tested the<br />\narmed with gasoline torches.<br />\ndepend on natural conditions, which neers and two part time men.<br />\nas the College Parkers, for Curly opposing line without avail, finally<br />\nThe<br />\nfirst<br />\npause<br />\nwas<br />\nmade<br />\nat<br />\nare just as hard to predict. The<br />\nIn the School of Business EcoByrd has already ordered four calling on Doug Turnbull to try a<br />\nGoucher<br />\nfor<br />\na<br />\nfew<br />\ngirls<br />\nsongs;<br />\nand<br />\nforces of nature which produce con- nomics, the \"baby\" of the Univerthousand reserved seats, which he placement kick. Several St. John's<br />\nparade<br />\nthe<br />\nthen<br />\nproceeded<br />\ndown<br />\nditions favorable to agrizniture were sity, we find a substantial increase,<br />\nintends to sell to the students and players broke through the line in<br />\ntime to block the kick, Schacht reCharles<br />\nstreet<br />\nto<br />\nFranklin,<br />\nfrom<br />\nmudied in an attempt to find a re- the attendance having jumped from<br />\nalumni of his institution.<br />\ncovering<br />\nto<br />\nthere<br />\nHoward,<br />\nthe ball the minute it<br />\nto<br />\nBaltimore,<br />\nto<br />\nliable indicator of weather 'condi- 19 last year to 45 this year, more<br />\nIn order that Hopkins men can<br />\ntouched<br />\nSun<br />\nSquare,<br />\nVernon<br />\nthe<br />\nto<br />\nMt.<br />\nPlace.<br />\nground._ On the next<br />\ntions. Such theories as the sun than doubling the attendance.<br />\nget their tickets without difficulty<br />\nplay<br />\nThe<br />\na<br />\nyelling<br />\nconstant,<br />\nSt.<br />\nwas<br />\ninterJohn's<br />\nplayer pulled the<br />\nspots and planetary theories were<br />\nIn the College for Teachers we<br />\nthe athletic office at Homewood<br />\nbrought forward. They were<br />\nfind a drop; from 1,066 (which rupted only by singing of Hop- has taken over the principal Balti- pigskin out of the air when TayCued, however, because it is a com- most of us associate with William kins songs. When the leaders' in- more agency for them. These tick- lor tried a forward pass to Rich,<br />\nbination of natural force;, not a the Conqueror) to 1,027 enrolled vention failed, the crowei took up ets are available at any time at the carrying it 20 yards up the field.<br />\na staccato shout; \"Oh; Beat St.<br />\nsingle force, that determines the for 1923-24.<br />\nA. A. office, Spalding's and Al- Following a good punt by TurnJohn's!<br />\nOh!<br />\n!\"<br />\nJohn's<br />\nSt.<br />\nin<br />\nBeat<br />\nof the weather.<br />\nbaugh's. The graduate manager bull, Darley made the initial first<br />\nIn Social Economics the full<br />\nan<br />\nendless<br />\nrepetition.<br />\nDr.<br />\nsaid.<br />\n\"The second theory,\"<br />\nhas expressed a desire that all down of the game, circling the end<br />\ntimers are included under the gradSun<br />\nAt<br />\nprocession<br />\nSquare<br />\nthe<br />\naxiom<br />\nHollander, \"makes use of the<br />\nmembers of the undergraduate of the line for 15 yards just as- the<br />\nuate department but in the part<br />\nstopped<br />\nfor<br />\nsecond<br />\ntime.<br />\nthe<br />\nBy<br />\n'Don't laugh too much, or you'll time students there is an increase<br />\nbody help dispose of the several quarter ended.<br />\nnow<br />\neveryone<br />\nwas<br />\nnearly<br />\nexhaustcry.' Humanity cannot go ahead on from seven last year to 22.this.<br />\nWith the ball on the 30-yard<br />\nthousand seats that are on sale<br />\nan even keel, at a constant pace.\" In the Evening Courses there is ed by constant yelling, singing, on the campus. The one dollar line at the opening of the second<br />\nThe speaker went to to say that, an increase in both the Technical<br />\nContinued on page 2 col. 5<br />\nseats are limited to students, grad- period, Darley dropped back for<br />\nas a result of this tendency of hu- Courses and in Business Economics.<br />\nuate students and members of the an attempt to kick a field goal,<br />\nmanity, business had its laughing In the former there is an increase<br />\nwhich failed by a dangerously<br />\nfaculty.<br />\nPeriods and crying periods. At- of 60 over last year's enrollment of<br />\nSeveral prominent men in the close margin. Turnbull puntea on<br />\ntempts to ascertain the duration of 615, and in the latter there are 302<br />\nstate have been invited to attend the next play putting the ball out<br />\nthese periods were unsuccessful, so registered this year as against 262<br />\nthe Thanksgiving Day game. The of danger. A succession of exthe second theory also went by the last year.?<br />\nMayor of Baltimore, and Governor changes lasted until the end of the<br />\nboard.<br />\nIn the courses given last summer<br />\nRitchie are expected to view the quarter, when after two long forDuring the war, a group of bril- the attendance dropped from 785 to<br />\ncontest, dividing their time be- ward passes the Johnnies were<br />\nliant economists was formed for 753, a decrease of 32.<br />\ntween either side of the grand- again within dropkicking distance.<br />\nadvisory purposes. These men atThe total attendance for this<br />\nstand. Thus the official guests can Darley was hurried in his second<br />\ntacked the problem by the empirical year, making allowances for, those<br />\nsnend half their time supporting attempt,to score and consequently<br />\nTICKETS $1<br />\neither side.<br />\nContinued on page 3, col. 2<br />\nContinued on Page 3, col. I<br />\nContinued on page 4, col. 3<br /><br />\nBuy your<br />\nTicket for<br />\nU. of Maryland<br />\nGame now!<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nMayb©<br /><br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nWe received a deep and bitter<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\ndisappointment not long ago—all<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nINFANT PRODIGY AT HOPKINS BEATS N. Y. U.'S<br />\nYOUNGEST IN YOUTH<br />\nWilliam Taft Feldman Only Fourteen<br />\nYears Old, is One of Bright Men<br />\nin Freshman Class<br /><br />\nRecently an article appeared in<br />\nthe weekly paper of the University<br />\nof New York stating that their \"infant prodigy\" was one of the<br />\nyoungest in the country. The article stated that the miracle child of<br />\nthe metropolitan institution would<br />\nnot reach the age of fifteen until<br />\nthe first of December and then<br />\nwent on to say that he was a schol-<br /><br />\n‘‘.<br /><br />\nC,,,<br />\nCORONA<br />\nHave you<br />\nseen it?<br /><br />\nthe deeper and much more bitter<br />\nPublished semi-weekly from October to June by the students of Johns because we were at first mistakenHopkins University.<br />\nly overjoyed. A clipping from<br />\n\"The Dartmouth\" was the cause.<br />\n41Something new in portable<br />\nBusiness communications should be addressed to the BUSINESS MAN- At first glance we saw \"Darttypewriters.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\ncapsports<br />\nmajor<br />\nfour<br />\nmouth's<br />\nshould be sent to the MANAGING EDITOR.<br />\n41It writes nearly all lantains have . . . combined marks<br />\nguages.<br />\nthe<br />\nIn<br />\n3.3.\"<br />\nto<br />\naveraging<br />\n.<br />\n.<br />\n.<br />\nHomewood 100<br />\nTelephone<br />\n41Has 90 characters.<br />\nmidst of our heartfelt approval we astic genius and so forth.<br />\nnoticed that Dartmouth's grades<br />\nSee Fred Rich, College<br />\nHopkins has done better than the<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nRepresentative<br />\nbegin at the other end of the scale. New York School in this respect.<br />\nJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nAll four men at present are above<br />\nThe infant prodigy at Homewood<br />\n118 W. FAYETTE ST.<br />\nManaging Editor<br />\nthe Phi Beta Kappa requirement.<br />\nAdvertising Manager<br />\nwill attain the mature age of fifteen<br />\nBALTIMORE, MD.<br />\nWILLIAM G. DEAN, JR., '24<br />\nA dull sickening thud—cherished<br />\nhe<br />\n1924,<br />\nFITZGERALD DUNNING, '24<br />\nMarch,<br />\nof<br />\nfourth<br />\non the<br />\ndreams shattered—an idol with<br />\nAssistant Managing Editor<br />\nis a scholastic genius, and what is<br />\nCirculation Manager<br />\nfeet of clay smashed.<br />\nT. REESE MARSH, '24<br />\nmore he is a perfectly normal and<br />\n* *<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\n\"Sham,\" \"Bells,\" and \"Forbidden quite likable boy.<br />\nWilliam Taft Feldman is the<br />\nAssistant Business Managers<br />\nRICHARD C. TILGHMAN, '25<br />\nFruit\" are the titles of three oneJOHN W. PARSONS, '25<br />\nHome- name of Hopkins' youngest candi\"The<br />\nby<br />\nD. MILES MARRIAN,'25<br />\npresented<br />\nplays<br />\nact<br />\nBENJAMIN T. ROME,'25<br />\nG. DONALD GIESKE,'25<br />\nwood Playshop\" on November 2d date for the degree of Bachelor of<br />\nJunior Editors<br />\nJOHN T. DIXON, '24<br />\nArts. To those who know him<br />\nand 3d.<br />\nA. J. McKAY, '26<br />\nW. EDWARD THOMsEN, JR., '26<br />\n(he's called \"Prod\" for<br />\n\"Prod\"<br />\na<br />\nis<br />\nplay,<br />\nopening<br />\n\"Sham,\" the<br />\nARTHUR L. NELSON, '26<br />\nC. EUGENE TOVELL, '24<br />\nof prodigy) is a very<br />\nERNEST A. STRATHMAN, '26<br />\nform<br />\nshort<br />\nmodern<br />\nthe<br />\nclever comedy satirizing<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. HISS, '26<br />\nman. He got his<br />\nyoung<br />\npromising<br />\ntendency toward superficiality.<br />\nJ. JACKSON KIDD, '26<br />\nEDWARD O. MICHEL, '26<br />\nat the Baltieducation<br />\nCHARLES G. HUTZLER, '24<br />\npreparatory<br />\nT. STRAN SUMMERS, '25<br />\nBy far the most absorbing of the<br />\nhe first<br />\nwhere<br />\nCollege,<br />\ngroup was Arthur D. Kaufman's more City<br />\nteachers<br />\nhis<br />\nof<br />\ntragic picture of immigrant life, drew the attention<br />\nMember Southern Intercollegiate Newspaper Association<br />\n\"Bells.\" Miss Loewenson, as the and classmates by fulfilling the restruggling mother, gave a truly fine quirements for. graduation in three<br />\nNeatly combed,'well-('pt hair is a<br />\nperformance. The character of Al- years with an average of something<br />\nMd.<br />\nbusiness and social asset.<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nSTACOMB makes the hair stay combed<br />\nexander, the weak-minded son, vic- over 90. That was not \"Prod's\"<br />\nin any style you like even after it has<br />\ntim of Old World hardships, was only intellectual attainment, for he<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nand<br />\nfall<br />\nthis<br />\nHomewood<br />\nto<br />\nexcepcame<br />\nthis<br />\nWith<br />\n1923<br />\n13,<br />\nconvincing.<br />\nnot<br />\nBALTIMORE, MD., NOVEMBER<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\ntion the play was excellent and won a Hopkins scholarship in the<br />\nfor free trial tube.<br />\na<br />\nagainst<br />\nexaminations<br />\ncompetitive<br />\namateurof<br />\ntrace<br />\na<br />\ngiven without<br />\nTubes-35c Jars-75c<br />\nIT CAN BE DONE<br />\nishness. Even under the inevitable large group of fellows a great deal<br />\nInsist on STACOMB—in the black,<br />\nHopkins did not breathe a sigh of relief after the St. John's game<br />\nyellow and gold package.<br />\ncomparison, to older than himself. At this rate the<br />\n\"Humoresque<br />\nFor sale at your druggist or wherever<br />\ngathobstacle<br />\nlast<br />\nhis<br />\ncleared<br />\nhas<br />\nwho<br />\nhurdler<br />\nthe<br />\nAs<br />\nlast Saturday.<br />\ntoilet goods are sold.<br />\nof this type are sub- Black and Blue youngster should<br />\nplays<br />\nwhich<br />\nStandard Laboratories, Inc.<br />\ners together his reserve resources for a final dash to the finish, Johns<br />\njected, \"Bells\" suffers but little, for stand a good chance of going Phi<br />\n750 Stanford Avenue Los Angeles, California<br />\nseafor<br />\nthe<br />\ntraining<br />\nintensive<br />\nweeks'<br />\ntwo<br />\nto<br />\ndown<br />\nsettled<br />\nHopkins<br />\nSend coupon for Free Trial Tube.<br />\nits note of undiluted tragedy suited Beta Kappa when that august - ------,<br />\nson's climax, the game with the University of Maryland on Thanksof<br />\nits<br />\nSTANDARD LABORATOP.IES,Inn,<br />\nits length capitally. What three body confers the. distinction<br />\n750 Stanford Ave., Los Angeles, California. Dept. 1<br />\ngiving Day.<br />\nPlease aced me free trial tube.<br />\nacts of stark hopelessness would do membership several years hence.<br />\nwonderful<br />\nher<br />\nand<br />\nPenn<br />\nof<br />\ndefeat<br />\nMaryland's<br />\nto<br />\nSport fans point<br />\nName<br />\nOther organizations will have<br />\nto the theme we won't venture to<br />\nAddress<br />\nstand against Yale and predict a dire fate for Hopkins on Thanksgiv_<br />\nto cast favorable glances in<br />\ncause<br />\npredict.<br />\nof<br />\ntype<br />\nthe<br />\nrealize<br />\nWe<br />\npredictions.<br />\nno<br />\ning Day. We are making<br />\nA burlesque on the conventional his direction before long. \"Prod\"<br />\nteam that we are to meet. We realize that comparative scores show<br />\nSTUDENT BODY SHOWS PEP AT<br />\ntheme entitled \"Forbidden is a candidate for the NEWS-LETTER<br />\nromantic<br />\nTRADITIONAL BONFIRE<br />\nMaryland a victor by a considerable margin. We recall, however,<br />\nAND PARADE<br />\ninitial offering and a clever cub reporter is the<br />\nthe<br />\nbrought<br />\nFruit\"<br />\nuncomfortable<br />\nTiger<br />\nPrinceton<br />\nthe<br />\nthe fighting spirit which caused<br />\nfrom page 1<br />\nbelongs.<br />\nContinued<br />\nhe<br />\nrange<br />\nwhich<br />\nto<br />\nThe<br />\nclose.<br />\nclassification<br />\na<br />\nthe season to<br />\nmoments. We recall the airtight defense which has prevented visit- of<br />\n•<br />\nsudpo<br />\nfeel<br />\nthe<br />\nwill<br />\nwhile<br />\nclass<br />\nfreshman<br />\nThe<br />\ncomedy to tragedy,<br />\nand snake-dancing, which had<br />\ning teams from crossing the Hopkins goal line this season. We re- from<br />\npermember's\"<br />\ntheir<br />\n\"infant<br />\npainlessly<br />\nof<br />\ntency<br />\nand<br />\nneatly<br />\nlasted for the three miles march<br />\nden,<br />\nwas<br />\nhas<br />\nwhich<br />\nalertness<br />\ncall the knowledge of fundamentals and uncanny<br />\nhe<br />\nup<br />\nif<br />\naukeeps<br />\nthe<br />\nyears<br />\nBut no one that heard<br />\nfuture<br />\nto<br />\nleast<br />\nin<br />\npen<br />\nat<br />\ndowntown.<br />\nformed—painless<br />\nball\"<br />\nand<br />\nthe<br />\nmade the present Hopkins team famous for \"following<br />\nthat he has started. the cheers here would have<br />\nwork<br />\ngood<br />\nthe<br />\ndience.<br />\ntaking advantage of breaks.<br />\n***<br />\nFeldman's schedule marks him as guessed that fact. After a cheer<br />\nWe defy the dopesters and say \"it can be done.\" The team, howjournal a student of the classics as he in- ,for the Sun, the crowd \"ran<br />\ntheatrical<br />\nthe<br />\n\"Variety,\"<br />\nmore<br />\never, will have to fight harder and will have to follow the ball<br />\nconducting the latest New York cludes Greek and Latin among his wild\" to Mt. Vernon Place. After<br />\nclosely than it ever has before. Everything, in the next two weeks,<br />\ntwist—\"batting averages\" of the studies.<br />\nMathematics, English a final yell for \"Van Orman's<br />\nshould be subordinated to preparing for the Maryland game. Maryon<br />\nbased<br />\ncritics<br />\ndramatic<br />\nleading<br />\nR. 0. T. C. are his team,\" the Friday activities were<br />\nand<br />\nI,<br />\nComp.<br />\nland looks good. We feel, however, that a fighting Hopkins eleven,<br />\nsuccess<br />\nthe<br />\nto<br />\nas<br />\nprophecies<br />\nended.<br />\ntheir<br />\nsubjects.<br />\nother<br />\nthoroughly determined and thoroughly mad, can spring a surprise.<br />\ncalls<br />\nreview,<br />\nthey<br />\nSaturday at 1.30 a large part of<br />\nplays<br />\nof<br />\nfailure<br />\nor<br />\ntrouhad<br />\nhave<br />\nsophomores<br />\nThe<br />\nIT CAN BE DONE!<br />\n\"The Playshop\" \"probably the most ble with \"Prod\" on but one count. the Student Body formed on the<br />\npromising of all the local groups.\" He just won't wear long pants, or upper quadrangle and, headed by<br />\nTHE HONOR SYSTEM<br />\nAlthough such entertainment is short black socks. The second year the Band, marched to the field.<br />\nHopkins is justly proud of the effectiveness of its Honor System. right under their noses it appears men feel that he is not quite digni- The \"Frosh\" formed the usual<br />\nSeniors point to the fact that, in their four years of college, they have that the \"dormitory denizens\" have fied enough to be a Hopkins man. \"H\" in the stand, and the rest of<br />\nthe space was taken by uppernever witnessed cribbing or any other infraction of the code. Fresh- yet to discover it.<br />\n** *<br />\nclassmen.<br />\nmen marvel at the novelty of being left unwatched during a quiz<br />\npassed into the discard, and two<br />\nAdvertisements for the new WilThe tea-dance, and '23's formal<br />\nand, elated at their new responsibility, become staunch adherents of<br />\nones will be established\"—exnew<br />\nof<br />\nHonor<br />\nTemple<br />\n\"The<br />\nthe<br />\nthat<br />\npicture,<br />\nFox<br />\nof<br />\nliam<br />\ngratification<br />\nmatter<br />\na<br />\nin honor of the rival teams<br />\nindeed<br />\naffair<br />\nis<br />\nIt<br />\nthe \"system.\"<br />\ncerpt from Friday's News-Letter.<br />\ninshould<br />\nwhich<br />\ncast<br />\nuniversities,<br />\na<br />\nthe two-day activities<br />\nmany<br />\nannounce<br />\nand<br />\ncolleges<br />\nso<br />\nVenus,\"<br />\nat<br />\nfailed<br />\nconcluded<br />\nhas<br />\nSystem, which<br />\nOur personal interpretation of<br />\nalas<br />\nJohn's festivities. As<br />\nbeauties<br />\nAmerican<br />\nSt.<br />\nHopkins.<br />\nJohns<br />\nat<br />\n100<br />\ncludes<br />\nthe<br />\npracticality<br />\nof<br />\nbe an absolute<br />\nthe word tradition has always been<br />\nman<br />\nwas heard to remark,<br />\nevery<br />\nwonthe<br />\nall<br />\nand<br />\n\"Frosh\"<br />\nwhich<br />\npresupposes<br />\nSystem,<br />\nmermaids<br />\nHonor<br />\nluring<br />\none<br />\nAccording to the<br />\na little vague, we admit. But the<br />\nMaryland.\"<br />\nlife.<br />\ncollege<br />\nof<br />\nto<br />\nall<br />\nfor<br />\napply<br />\ndeep.\"<br />\nphases<br />\nshould<br />\n\"vasty<br />\nthe<br />\n\"Now<br />\ncode<br />\nders of the<br />\nto be a gentleman,<br />\nsetting up of new ones over night<br />\nIt seems some young advertising<br />\nAn article which is left on the campus should be as safe as if it were<br />\nincongruous with our hazy Y. M. C. A. HAS HANDBOOKS FOR<br />\nseemed<br />\nguarded by lock or key. We believe that this generally is the. case. man lost the chance of his life when<br />\nTHOSE WHO HAVE NOT OBdefinition. Turning to the \"New<br />\nThe Honor System, too, should apply to the maintenance of the he didn't substitute \"nasty\" for<br />\nTAINED THEM<br />\n\"tradition\":<br />\nunder<br />\nread<br />\nOxford\" we<br />\nRushing Agreement which is being studied more and more closely as \"vasty.\"<br />\nHopkins<br />\nY. M. C. A. wishes<br />\nThe<br />\npractice<br />\nor<br />\nbelief,<br />\n\"A statement,<br />\n***<br />\nthe date of the formal opening of rushing season approaches. Every<br />\nto<br />\ncall<br />\nthe fact that some<br />\nattention<br />\nto<br />\ngentransmitted from generation to<br />\nyear there have been cases where fraternities have been guilty of vio- \"Lost—An overcoat belonging to<br />\nstudents<br />\nhave<br />\nnot<br />\nyet obtained their<br />\neration.\"<br />\nlating the \"spirit\" of the agreement. Although 'no fraternity has J. C. Mills. Finder put same in<br />\nThe<br />\nfew that remain<br />\nhandbooks.<br />\nThat was the meaning nearest to<br />\nbeen found guilty of absolute breaches, there have appeared numer- Box 128\"—a recent notice in the<br />\nby<br />\neither graduate<br />\nthe present Hopkins system of may be obtained<br />\nous cases where advantage has been taken of technicalities in order NEWS-LETTER.<br />\nor<br />\nundergraduate<br />\nstudents.<br />\nThis is<br />\nWhen<br />\na<br />\na<br />\nday.<br />\ntradition<br />\nadopting<br />\nTo any one who has tried to get<br />\nto gain the desired end.<br />\nunusual<br />\nan<br />\nas<br />\ncircumstance<br />\nthe<br />\nsupnot<br />\nwere<br />\nwere<br />\nthey<br />\nmade<br />\nantiques<br />\nWe believe that there is not a Hopkins man who would know- his mail, much less a small package,<br />\nthese<br />\nply<br />\nof<br />\nhelpful<br />\nmanuals<br />\nhas<br />\naldon't<br />\npray<br />\nas<br />\nantiques;<br />\nintended<br />\ningly cheat in an examination. Such a person, if he did exist and was out of one of those rat traps of Mr.<br />\nin<br />\nshort<br />\nyears.<br />\nrun<br />\nways<br />\nfor<br />\n.<br />\nprevious<br />\ntraditions<br />\nlet<br />\nus<br />\nmanufacture<br />\ndetected, would receive but little sympathy from the student body. Myers further comment is superthe express purpose of having our The Y council hopes that students<br />\nWe fail to see, however, how a man who violates either the letter or fluous.<br />\n*<br />\n*<br />\n*<br />\nown \"folklore.\" Let's wait, in the in need of a campus \"encyclopedia\"<br />\nthe spirit of the Rushing Agreement, is any less culpable than he who<br />\n\"If the present plans go through future, at least a week before will call for one as they are a dead<br />\ncheats at an examination.<br />\nwaste when not in use.<br />\nan old Hopkins tradition will be branding new plans as traditions.<br />\nBoth are guilty of conduct unbecoming to a gentleman.<br /><br />\nor<br />\n. _. . . . . .._-„ii<br />\nIiinruly air<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br />\nBLACK AND BLUE DEFEAT ST.<br />\nJOHN'S<br />\nContinued from page 1<br /><br />\nDR. HOLLANDER ADDRESSES THE ENGINEERS TO VISIT COPPER<br />\nTHURSDAY ASSEMBLY ON<br />\nREFINING PLANT<br />\n\"BUSINESS FORECASTING\"<br />\nContinued from page 1<br />\nNext' Saturday, November 17, a<br /><br />\n3<br /><br />\nBEAT<br />\nMaryland State!<br /><br />\nmissed the cross bar by a large<br />\nmethod; they sought not the causes party composed of engineering<br />\ndistance. Previous to the attemptbut the occasion of things. They juniors and seniors of the Materied field goal, Bonner caught two found that there are three symp- als of Engineering ,Class will visit<br />\nforward passes, gaining consider- toms which can safely be used as the plant of the Baltimore Copper<br />\nGERHARD &amp; REED CO.<br />\nable distance and making Hop- guides in business forecasting. (1) Smelting and Refining Company,<br />\nTAILORS<br />\nkins' only first down for the first An easy money market; (2) Ac- located near Canton. The group<br />\nOf course you know that<br />\ntive<br />\nspeculation;<br />\n(3) Business aC- will be headed by Professor Alexhalf of the game. St. John's is<br />\n1 1 0 N. EUTAW STREET<br />\nThe<br />\nBarn is handling orders<br />\ntivity. When one or two of these ander G. Christie, head of the decredited with having completed<br />\nfor<br />\nour<br />\nclothes again this<br />\n2nd Floor<br />\nsymptoms appear, it is reasonably partment of mechanical engineeryear.<br />\nthe distance four times in this in- safe to predict the<br />\ning, and Dr. William B. Kouwenthird.<br />\nterval of play.<br />\nThe plan worked to<br />\nBusiness forecasting of this sort hoven, associate professor in the<br />\nSARATOGA AT<br />\nmutual advantage last seaTurnbull made a fair kickoff at does not give precise information. same department.<br />\nLIBERTY STS.<br />\nson, and we're mighty glad<br />\nThe. party is scheduled to arrive<br />\nthe beginning of the third quarter, The demand for precise information<br />\nto continue the relationBonner recovering the ball on the is so insistent, however, that some at the upper works at 2.00 P. M.<br />\nLUNCHEON<br />\nship.<br />\nbusiness forecasting is done on a and the members will then pro25-yard line when the Annapolis<br />\nTEA<br />\ncommercial basis. Even in this ceed through the plant, under the<br />\nReady-to-wear Suits<br />\n$30 up<br />\nbacks failed to catch it. The only case, use is<br />\nDINNER<br />\nReady-to-wear O'Coats . $35 up<br />\nmade of these three guidance of officials of the comperiod of consistent gains followed symptoms.<br />\npany, examining at first hand the 11.30 A. M.<br />\nSPECIAL PARTIES<br />\n211-213 E. Baltimore St.<br />\nthis play and resulted in the tally<br />\nThere are three obstacles in gradual development of raw copuntil<br />\n7.30<br />\nP.<br />\nbusiness<br />\nM.<br />\nPLAZA 6987<br />\nforecasting on the basis per ore into finished bars of pure<br />\nthat kept the score from being a<br />\nblank. Taylor opened up the for- of these symptoms: 'first, there is copper, ready to be shipped to the<br />\nthe chance of an unforeseen event; important electrical and manufacward pass playing and sent one to<br />\nsecond, the length of the intervals turing companies of the world,<br />\nBonner for an 8-yard gain. Turnbetween symptoms. is uncertain; there to be used in every phase of<br />\nbull swept through the line for a third, it is impossible to state ex- engineering work.<br />\nfirst down. Taylor sent Turnbull actly when one period terminates<br />\nThe Baltimore Copper Smelting<br />\nthrough the line again-for a small and the next begins. In spite of and Refining Company has one<br />\ngain and seeing the futility of that these disadvantages, Dr. Hollan- of the largest copper producing<br />\ntype of play he gave the ball to der said in conclusion, a great plants in the world, and because it<br />\nstride forward has been made; and employs all the newest ideas and<br />\nBonner for an end run which re- \"big business\" is making<br />\nuse of inventions in the production ol<br />\nsulted in a failure, to gain ground business forecasting based on the copper, the trip is expected by<br />\nbut placed the ball squarely in observation of the three symp- Drs. Christie and Kouwenhoven<br />\nfront of the goal posts. Kneeling toms.<br />\nto prove of almost inestimable<br />\non the 20-yard line the J. H. U. Randolph Norwood, President benefit to the men making the<br />\ncaptain held the pigskin - while of the Student Council, announced trip.<br />\nTurnbull kicked it, making the that a few men in the Freshman<br />\nOne such trip to a very imporonly tally of the game three min- Class who are entitled to activities tant industrial corporation has alutes after the opening of the sec- buttons have not yet secured them ready been made by this class, the<br />\nond half. Five minutes later and must do so at once. About group having recently made an inSchacht caught a 40-yard pas 40 Freshmen are not yet engaged spection trip to the plant of the<br />\nfrom Taylor on the six-yard line in any activity, and, unless they go Bethlehem Steel Company, at<br />\nafter he had fallen to the ground. out for some activity immediately, Sparrows Point, Md. Here the<br />\nThe sprained ankle which he re- their names will be published in party observed the refining of iron<br />\nceived in the Western Maryland the News-Letter.<br />\nfrom the point -where it was unAs a token of the undergradu- loaded from ocean vessels carrygame gave away necessitating his<br />\nFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br />\nremoval from the contest. Berndt ates' affection for Mr. Thomas R. ing it from South America to<br />\nwas sent in to fill his place. Hop- Ball, who recently resigned his po- where it was cast into \"pig\" iron<br />\nkins was unable to reach the goal sition as registrar after 46 years' from the great blast furnaces, and<br />\nby plunging through St. John's service, a Seth Thomas clock will finally through the various interINSTRUCTION<br />\nline so Taylor tried a forward be presented to him at the next mediate stages of refining to the<br />\npass, the ball striking the goal assembly. A silver plate, suitably point where it was rolled, white GRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of<br />\nArts; Doctor of Philosophy.<br />\npost and therefore going to the op- inscribed,- will be placed on the hot, into iron plates of the proper<br />\nMEDICAL<br />\nSCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nsize.<br />\nponents. After this \"neither team back of the'clock. •<br />\nThe rest of the assembly hour<br />\nThese trips are given from time COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nwas able to get within striking diswas devoted to arousing \"pep\" for to time by the mechanical engi- SCHOOL OF ENGINEERING. Degrees: Doctor of Engineering; Mastance of the other's goal.<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nThe game was marked by the the St. John's game.<br />\nneering department to properly<br />\nChemistry.<br />\nexcellent playing of several indicorrelate practical work with the<br />\nFRESHMEN APPOINT PEP<br />\nviduals although the teamwork of<br />\ntheoretical side of engineering SCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubCOMMITTEE<br />\nlic Heajth; Doctor of Science and Bachelor of Science in Hygiene; Cerboth machines was not especially<br />\ngiven in the classroom. The stutificate in Public Health.<br />\nThe Freshmen held a short class<br />\ngood. Turnbull, Wolbert and Bardents derive the benefit of seeing<br />\nmeeting on Thursday immediately<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nton starred for Hopkins while<br />\noperations performed in actual<br />\nfollowing the Student Assembly.<br />\nparley, Dugan and Barger did<br />\npractice which they have recently COLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nThe most important business was<br />\nSUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nbest for St. John's. The playing<br />\nstudied in text-books.<br />\nthat concerning the Freshman<br />\nArts or of Science.<br />\nof Barton was exceptional, the<br />\nDance and the appointment of a<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nsturdy Texan being in on every<br />\n\"Pep\" Committee.<br />\nPlay, both defensive and offensive.<br />\nEVENING COURSES in Business Economics and for Technical Workers.<br />\nAll plans for the Freshman<br />\nTaylor's work at quarterback<br />\ndance were discontinued because<br />\nshowed improvement over his preof the action of the Student Counvious generalship of the Black and<br />\ncil. They took the stand that a<br />\nBlue eleven.<br />\nFreshman dance would not be sucJOHNS HOPKINS PRESS PUBLICATIONS.<br />\nDuring the game St. John's and<br />\ncessful, as in previous years the<br />\nHopkins made an equal number<br />\ndances of the Freshman class did<br />\n(5) first downs.<br />\nnot pay for themselves. They sugLineup:<br />\ngested that there be a class smoker<br />\nHopkins (3)<br />\nSt. John's (0)<br />\nBUILDINGS<br />\nwhich would fulfill the same purIt's a queer one, a puzzler—and<br />\nSchacht<br />\nLE<br />\nJarvis pose of the dance and yet be finanyet it's true! He has found<br />\nGILMAN HALL—General library, class rooms, biology? administration.<br />\nMagihl<br />\nBounds cially stable. The matter was<br />\nLT<br />\nsomething which gives him<br />\nMECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\npleasure, and the most incorrigBarton .......L.G<br />\n. Sticker handed over to the social commitible pessimist must admit it's<br />\nand College Chemistry.<br />\nbay.<br />\nBerry tee.<br />\nbeneficial.<br />\nENGINEERING—Housing also Geology.<br />\nCIVIL<br />\n\"Vaseline\"<br />\nTonic<br />\nHair<br />\nis<br />\nreason<br />\nthe<br />\nWolbert ......R.G.<br />\nBarger<br />\nThe members of the Smoker<br />\nfor this unique experience. It's the<br />\nclassiest hair dressing ever, gives<br />\nPOWER HOUSE.<br />\nCarter<br />\nR T.<br />\nAlexander Committee are Schwinn, chairsnap and polish to the head. And—<br />\nRich<br />\n.................Helm man; Bahlke, Brown, Meredith,<br />\nBOTANY AND PLANT PHYSIOLOGY—With Greenhouses and Botanical<br />\nit helps the scalp.<br />\nAt all drug stores and student<br />\nGarden.<br />\nTaylor<br />\n0B<br />\nDarley Hines, Cleveland and McNeal.<br />\nbarber shops.<br />\nBonner ......L.H.<br />\nCHEMICAL<br />\nLABORATORY—For graduate work.<br />\nEvery<br />\n\"Vaseline\"<br />\nCain<br />\nproduct is recOn account of the lack of pep of<br />\nommended everywhere because of<br />\nTurnbull ................Dugan the Freshman class, President<br />\nits absolute purity and effectiveness.<br />\nPHYSIOLOGICAL BUILDING.<br />\nMaxwell .....F.B.. ..... Wegner Niner appointed a \"Pep\" CommitANATOMICAL LABORATORY.<br />\nSubstitutions—Hopkins, Slowik tee to have charge of all the activiHUNTERIAN LABORATORIES.<br />\nfor Carter, Carter for Slowik, Le- ties of the class under Freshmen<br />\nPATHOLOGICAL LABORATORY.<br />\nNrY for Day, Berndt for Schacht. regulations. After the St. John's<br />\nSCHOOL OF HYGIENE,<br />\nSt. John's Erberts for Jarvis, game they will have charge of<br />\ngivCARROLL MANSION—Johns Hopkins Club.<br />\n'Webb for Wegner, Lutz for Dar- ing out game tags, tending the<br />\nChesebroutjh Mf9,.Co.1 STUDENT ACTIVITIES BUILDING.<br />\nScorers—(Field goal) Turn- score boards and the ushering at<br />\n,<br />\n(Consolidated)<br />\nbull.<br />\nthe games.<br />\nALUMNI MEMORIAL DORMITORY.<br /><br />\nCLOTHES<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\nThe Johns Hopkins University<br /><br />\nStrange!<br /><br />\nVaseline<br /><br />\nHAIR TONIC<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 13, 1923<br /><br />\n4<br /><br />\nstudents on<br />\nFIELD COUNCIL OF Y. M. C. A. 0. D. K. LOOKS UP SCHOLAS- vakia, 2; Siam, 2; Hungary, 2; Can- for a number of these<br />\n28, at 6:45<br />\nOF<br />\nNovember<br />\nTIC RECORDS<br />\nada, 2; Ecuador, 1; Java, 1; Hol- Wednesday,<br />\nMEETS AT DREW<br />\nATHLETES<br />\nbe<br />\ngiven at the Cenland, 1; Korea, 1.; France, 1; Ru- P. NI. It will<br />\nSEMINARY<br />\nUrges Athletic Men to Make Good<br />\nmania, 1; Spain, 1; Norway, 1; tral Y. M. C. A. Building.<br />\nT. R. Marsh Represents Local \"Y\".<br />\nClassroom Marks<br />\nForeign students at the following<br />\nAfrica, 1; Palestine, 1; and<br />\nSouth<br />\nProblems Effecting Policies<br />\nOne of the greatest setbacks to<br />\nwill be invited: Hopkins,<br />\ncolleges<br />\nDiscussed<br />\n1.<br />\nArmenia,<br />\nan enterprising team is the barring<br />\nAll<br />\nSizes<br />\nThe College Department of the School of Hygiene and Public<br />\nHopkins was *represented by T. of an athlete for scholastic reasons<br />\nMaryENINK<br />\nR. Marsh at a meeting of the Mid- from a team, at the time wnen he Y. M. C. A. of Baltimore is plan- Health, the University of<br />\nFOUNTAIN<br />\n6ELfoyen.,12,17,c6,<br />\nCollege.<br />\nGoucher<br />\nand<br />\nland<br />\ndinner<br />\nThanksgiving<br />\na<br />\ngive<br />\nto<br />\nning<br />\ndle Atlantic Field Council, of the is most necessary for the team's<br />\nY. M. C. A., held at Drew Sem- success. 0. D. K. has decided to<br />\ninary, New Jersey, November 2-4, prevent anything of this nature<br />\nFor real Fountain Pen Satisfaction<br />\ninclusive. There are two represen- happening here, by assigning men<br />\nUse<br />\ntatives from each state, but Marsh to see that the athletes make good<br />\nand individuality is offered here at prices that are not<br />\n\"The Ink That Made<br />\nwas the only Maryland delegate records in classroom work as well<br />\nand cannot be underquoted by any house at any time.<br />\nThe Fountain Pen Possible\" on hand.<br />\nas in athletics. The society has<br />\n(j_ Besides the reputation of an old-established firm<br />\nThe Field Council is an interme- also appointed a committee to inis back of each sale with a guarantee.<br />\ndiate step between the various vestigate the Publicity Board, and<br />\nFOUNTAIN PEN INK<br />\ncampus Y. M. C. A.'s and the Na- it is expected to be in working<br />\ntional Association of Student Y. order in the near future. The Song<br />\nDECORATIONS<br />\nDRAPERIES<br />\nM. C. A.'s. At this meeting the Book Committee promises the FURNITURE<br />\nof<br />\nedition<br />\nnew<br />\na<br />\nof<br />\narrival<br />\n343 NORTH CHARLES STREET<br />\nCouncil decided upon the program early<br />\nfor the Silver Bay Summer Con- songs and yells which shall be<br />\nference next year, and likewise de- printed under the auspices of the<br />\ncided that together with the New fraternity.<br />\nEngland Conference, it will take<br />\nA law student at Wake Forest<br />\nfull charge of the Silver Bay ConCollege has hit upon a new methference. As this is entirely a stuod of reducing expenses to.a minLimited<br />\ndent work, the conference feels<br />\nimum. 'Arriving at college ten<br />\nthat the students should take the<br />\ndays late and finding no rooms<br />\nBARN CAFETERIA responsibility of the Conference aVailable in the dormitory or in<br />\nfrom the shoulders of the Nationprivate homes, he pitched an army<br />\nal Secretaries.<br />\ntent on the campus and with the<br />\ngICIEEN ILatEICIEIKAITIc ECIEINENEIEEMME<br />\nThe Field Council likewise dis- aid of his camping outfit used<br />\ncussed the relation between the during the summer prepares his<br />\ncampus Y. M. C. A. and the Stu- own meals. During the winter<br />\ndent Volunteer Movement, and months the camp stove on which<br />\nthe student Y. W. C. A., especially he cooks his meals will serve as a<br />\nwith regard to co-educational col- heating plant.—Old Gold and<br />\nleges.<br />\nBlack.<br />\nIf the Council's plans work out<br />\n\"The King of Lubricants\" it will be necessary for both the SIXTEEN FOREIGN NATIONS REPRESENTED IN STUDENT BODY<br />\nMiddle Atlantic and New England<br />\nAT HOPKINS<br />\nSHERWOOD BROTHERS, INC.<br />\nCouncils to hold a meeting in New<br />\nContinued from page 1<br />\nEgIggEGIEEgEgEETE:NEt GEMEIEgEEIZEIN York City, or in Indianapolis dur- counted more.than once in the difing the convention of the Student ferent departments, is 3,731, as<br />\nVolunteer. Movement, which will against a total registration of 3,652<br />\nBoys, the place to get your<br />\nbe held during the Christmas holi- for 1922-23. This is an increase<br />\nORIGINAL<br />\nmeals—and they are hondays.<br />\nin total registration for this year<br />\nwell<br />\nmeals,<br />\nyear.<br />\nover<br />\nlast<br />\nest-to-goodness<br />\nIt is interesting to note that of 74<br />\nStatistics on the registration of<br />\nHopkins has always had a repres erve d, and reasonably<br />\nsentative in the Field Council. T. foreign students at Hopkins, and<br />\n\"The One Cigarette Sold the World Over\"<br />\npriced—is at<br />\nR. Marsh is now serving his sec- elsewhere in Maryland, always an<br />\nond year on the Council as Hop- interesting subject, have been compiled this year by the Hopkins Y.<br />\nkins' delegate.<br />\nM. C. A.<br />\nPRESCRIPTION DRUGGISTS<br />\nAccording to these statistics there<br />\nFIRST COTILLON TO BE<br />\nTWO STORES:]<br />\nare 83 foreign students in BaltiDECEMBER 7<br />\nEutaw Place and North Ave.<br />\nSts.<br />\nChase<br />\nand<br />\nCharles<br />\n1817 N. Charles St.<br />\nmore divided between Hopkins<br />\nMadison 0405<br />\nThe first cotillon of the year will<br />\nVernon 0890<br />\nUniversity, the University of<br />\n(Half Block below North Ave.)<br />\ntake place at the Maryland CasuMaryland and Goucher College.<br />\nalty Clubhouse on December 7.<br />\nOf these, Hopkins, as a whole, has<br />\nNicholas Brown, Mgr.<br />\nElaborate preparations have been<br />\n64. The University of Maryland<br />\nmade and the Cotillon Club excomes next with 13, and Goucher<br />\npects to inaugurate the season<br />\nCollege boasts of 11.<br />\nwith a function that will serve as<br />\nOf the Hopkins foreign group,<br />\na precedent for those to be held<br />\nthere are 16 undergraduates, 34 at<br />\nAt the Washington Monument<br />\nin the future.<br />\nPrinters of Philological and<br />\nthe School of Hygiene and Public<br />\nScientific Works<br />\nFormerly it has been the cus- Health, and 9 in the Medical School.<br />\nOscar Thomas Olson, D.D.<br />\n23 S. HANOVER ST.<br />\ntom to give but one favor to a<br />\nThe distribution is as follows:<br />\nBaltimore, Md.<br />\nMinister<br />\ncouple, but this year the Cotillon China, 14; Porto Rico, 13; Russia,<br />\nClub is giving a favor to the men 7; Cuba, 5; Poland, 5; Brazil, 5;<br />\nHopkins Students Are Invited to<br />\nNECKWEAR also.<br />\nSHIRTS<br />\nJapan, 4; Philippines, 4; India, 3;<br />\nMake This Their Church Home<br />\nThe patronesses will be Dr. and Colombia, 2; Peru, 2; CzechosloMrs. Frank J. Goodnow, Dr. and<br />\nThe purpose and program of th:s<br />\nST.<br />\nN.<br />\nHOWARD<br />\n421<br />\nMrs. John H. Latane, Dr. and Mrs.<br />\nChurch will appeal to you. Look in<br />\non the Sunday afternoon -At Home\"<br />\nGLOVES John B. Whitehead, Dr. and Mrs.<br />\nHOSIERY<br />\nj/Elliott Gilpin and Mr. and Mrs.<br />\nfrom five to seven.<br />\nJulian C. Smallwood.<br />\nThe Flag, Banner 8z Pennant Shop<br />\nmorning worship at I 1 o'clock.<br />\n1,1101111011<br /><br />\n11110111111111<br />\n/76<br /><br />\nFURNITURE OF QUALITY<br /><br />\nSANFORDS<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nNCO<br /><br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br /><br />\nN<br /><br />\nHOT012 CEO<br /><br />\nMELACHRINO<br /><br />\nThe St. REGIS<br /><br />\nHYNSON, WESTCOTT and DUNNING<br /><br />\nRESTAURANT<br /><br />\nMount Vernon Place Methodist<br />\nEpiscopal Church<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nLeFranc &amp; Ault<br /><br />\nSunday<br /><br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nLEHIGH PSYCHOLOGICAL<br />\nTESTS RELIABLE<br />\nAll Freshmen entering Lehigh<br />\nin 1921 were required to take the<br />\nTrahue mentimeter psychology<br />\ntest. As a result of this test it<br />\nwas predicted that the fifty-seven<br />\nmen making the lowest scores,<br />\nplacing them among the lowest<br />\nPrinters of<br />\nseventeen per cent. of the class,<br />\nwould end their college career<br />\nThe Johns Hopkins<br />\nwithout a diploma. This prediction is being borne out, for of<br />\nNEWS-LETTER<br />\nthese fifty-seven men, all but sixteen have been dropped by the<br />\nCollege Literature<br />\nuniversity and these are doing<br />\npoor work and are not expected to<br />\nT.,OM BARD and SOUTH STREETS<br />\ncomplete their course.<br /><br />\nSunday evening service at 8 o'clock.<br />\nMusic by vested chorus—choir of soloists.<br /><br />\n\"At the heart of the City\"<br /><br />\nALL SEATS FREE<br /><br />\nRENT A CAR<br />\nDRIVE IT YOURSELF!<br />\nALL NEW, CLEAN CARS<br />\nFORDS, 12c PER MILE—DODGES OR HUPS, 18c PER MILE<br />\nSPECIAL REDUCED RATES FOR 50 MILES OR MORE<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nONE BLOCK SOUTH OF NORTH AVE.<br /><br />"}], "field_media_file": [{"target_id": 37789, "display": null, "description": null, "target_type": "file", "target_uuid": "003568d6-c3fd-4061-9f05-975285c5a9b3", "url": "http://digital.library.jhu.edu/system/files/2022-03/13084-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13084, "target_type": "node", "target_uuid": "2142ba68-55fa-442f-b810-a39f03f01219", "url": "/node/13084"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "54c9a84e-b39d-491f-b448-80101eb98aad"}]}