{"mid": [{"value": 38237}], "uuid": [{"value": "f5e0abb5-8d0f-46eb-a837-8af2b4a970d5"}], "vid": [{"value": 38237}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:51:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12804-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:51:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:51:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•<br />\n<br />\nJUttth i*Ipking Nruigiirttrri<br />\n<br />\nVOTE IN THE<br />\n\"NEWS-LETTER\" POLL<br />\nTODAY<br />\n<br />\nZ 275<br />\nHOMEWOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br />\n<br />\nVOL. XLII, No. 8<br />\n<br />\nCOURTRIGHT AND<br />\nMcGOVERN LEAD<br />\nPRIMARY VOTING<br />\n<br />\nBARNSTORM ERS I<br />\nThe schedule for tryouts for the<br />\nBarnstormers' recently chosen play,<br />\n\"Boy Meets Girl\", by Samuel and<br />\nBella Spewak, has been announced by<br />\nLewis Swyer, president. The following times, for today and the first' pact<br />\nof next week, have been set aside for<br />\nthe tryouts:<br />\nFriday 2 to 5 p. m.<br />\nSunday 2.30 p.m.<br />\nMondlii. 7.30 p.m.<br />\nTuesday 7.30 p.m.<br />\nEveryone is urged to be out for the<br />\ntryouts which will be held at the<br />\nBarn. Paul Henrichs, '29, will direct.<br />\n<br />\nPRICE 5 CENT/<br />\n<br />\nAn Open Letter To The Council<br />\n<br />\nEDITORIAL<br />\n-Before the vote is made on your<br />\nchoice of the three questions concerning the athletic Policy, it can be<br />\nreadily seen that more detailed explanations of the three are needed.<br />\nIn regard to (1):<br />\nDo yuu favor the present athleic<br />\npolicy?<br />\nThis means, briefly, you favor:<br />\n1 All athletics on a pure amateur<br />\nstatus.<br />\n2. Extensive intra-mural program.<br />\n3. Steadily-increasing number and<br />\nparticipation in inter-collegiate<br />\n(Continued on Page 2, Col. 1)<br />\n<br />\nChinese Red Cross Committee Makes Appeal To<br />\nHopkins Student Body<br />\n<br />\nTO TEST HOPKINS<br />\nATHLETIC PLAN<br />\nIN POLL TODAY<br />\n<br />\nHankow, China, October 7, 1937<br />\nTo the President of the Student Council:<br />\nI venture to hope that this appeal which I ant sending 1.6 you across the<br />\nPacific from distant China will find in you a responsive note. I am a college<br />\nNews-Letter Sponsors Votes<br />\nMilton Rudo, R. G. Fleagle<br />\nstudent, and in common with all students of new generations, I have enterOn \"De-emphasis Policy\"<br />\nEmerge Victorious In<br />\ntained bright hopes for the future. But now an evil spirit has come to mar<br />\nthe pleasant outlook of students in China and to imperil world civilization.<br />\nSecretary Prelims<br />\nOf Administration<br />\nOur civilization should bridge oceans and , continents, bring human beings<br />\ninto closer-contact with one another, promote better understanding between<br />\nBALLOTS PASSED OUT<br />\nNO CONTEST FOR<br />\nthem, and refine human relationships.<br />\nVICE-PRESIDENT<br />\nWITH TODAY'S ISSUE<br />\nBut today in China scores of bombing planes daily fly over our country,<br />\nleaving death and destruction in their wake. Thousands of non-combatants<br />\n- --in all our big cities are being killed and wounded and in the stricken districts<br />\nStudents Will Judge From<br />\nLeroy Applefeld, Douglas<br />\nhorrible sights of mangled bodies and heartrending grief are to be witnessed.<br />\nSpencer Win Out<br />\nThree Statements of<br />\nThe district of Wukon where I live has already been bombed and will inevitably be the object of future bombings. Winter is approaching. Many children<br />\nFor Treasurer<br />\nPolicy<br />\nhave been made motherless and hundreds have been rendered homeless. Our<br />\nIn each copy of today's NEWSThe Sophomore Class, voting in<br />\ncity is the center of.two hundred millions and it is to us that they look for<br />\nyesterday's primaries, elected a split<br />\nhelp.<br />\nLE11112, there will be found the NewsPolice Commissioner of BalWill Seek Second LETTER ballot on the<br />\nI, now, standing on the footing of a fellow human being and student, Team<br />\nticket to go to the polls in the finals<br />\nHopkins athappeal to the generosity of the students of your college over the sea for help<br />\ntimore Speaks Informally<br />\nStraight Victory Of Sea- letic policy. The poll, originally<br />\nto be head today. Frank McGovern<br />\nin this, our hour of need.<br />\nAt Latrobe Hall<br />\nson<br />\nand Benjamin Courtright received<br />\nTomorrow<br />\nscheduled for Tuesday, November 2,<br />\nI am sending you the appeal of the Red Cross Committse showing the<br />\nis sponsored by this paper for the<br />\nthe call of their second-year classway in which you can help us. I wish to assure your student's that we shall be<br />\nDescribes<br />\ncandidates<br />\nUnique Probation deeply grateful for any assistance that they may be able to give to the Kerstetter Again Key Man purpose of finding out what the Hopmates over the other two<br />\nIn<br />\nRunning<br />\nJay's<br />\nRed Cross.<br />\nkin's student body, and faculty think<br />\nfor president, John Dodge and Ted<br />\nSchool For Violators Of<br />\nof the new athletic program.<br />\nSincerely yours,<br />\nFrey. Courtright, who was secretary<br />\nAttack • ..<br />\nTraffic Regulations<br />\nEach ballot will have 3 questions<br />\n(Signed)<br />\nTeh-wei<br />\nLin<br />\nof his class last year, and McGovern,<br />\nP. S.—We students here have all agreed on the above letter, are busy<br />\nTomorrow the ' Hopk‘s football which are to be answered either<br />\nEmphasizing the necessity of eda member of the freshman banquet<br />\ntoday writing copies of it to the leading schools in America anu Britain.<br />\nsquad will journey to Swarthmore affirmatively or negatively. The quescommittee, will battle it out in the ucation in dealing with modern crimI hope you will write and tell me what you have been able to do about it.<br />\ntions are as follows: \"Do you favor<br />\ninal methods, and in preventing and<br />\nCollege where it will attempt to<br />\nelections today.<br />\nthe present athletic policy?\"; Do<br />\nGriffith John School<br />\navoiding motor accidents, William<br />\ngarner its second consecutive victory. you prefer<br />\nHankow, China<br />\nAs in the Junior _class primaries<br />\nLing Chao Ching<br />\nlight subsidization, such<br />\nP. Lawson, Police Commissioner of<br />\nThe Blue team did not play last Sat- as limited scholarships for<br />\nathletes<br />\nof last week, there was no contest Baltimore informally addressed a<br />\nurday and thus, should he in perfect and a coach for football only?\", and<br />\nfor the office of sophomore vice- large group of students in Latrobe<br />\n\"Do<br />\nyou<br />\nprefer heavy subsidization,<br />\nphysical shape for the camtest.<br />\npresident. Richard Green, as a fresh- Hall, Thursday at 11:30.<br />\nwith a highly paid coach and liberal<br />\nLast year the Garnets 'downed the<br />\nCominissioner Lawson is the first<br />\nman, a member of the football squad<br />\nscholarships?\" A. ballot box for all<br />\nJays despite a desperate'second half<br />\nspeaker to be presented by the Stuand at present a member of the Coballots will be found in the post<br />\nrally which brought the ipsers within<br />\ndent Council under the non-compuloffice.<br />\ntillion Board, and Jefferson Hamilton, sory assembly plan this<br />\nrange<br />\nof victory. Several veterans<br />\nyear. He was<br />\nNovember<br />\n13 Set As Definite Invited By Carnegie Corpor- from last year are the key men of the Since the plan was first applied at<br />\nmember of the YMCA Cabinet, were Introduced to the students by William<br />\nthe<br />\nCollege game almost<br />\nTime For<br />\nthe only candidates nominated for B. Kempton, president of the Stuation To Study Australian Pennsylvania institution's attack. threeWashington<br />\nweeks ago, many college papers<br />\nHeading this list is Jakie, fleet-footed<br />\ndent Council,<br />\nthe primaries.<br />\nFestivities<br />\nArbitration System<br />\nnotably those at the University of<br />\nsignal caller who also diRea the tossProbation School<br />\n_<br />\n.<br />\nRudo vs. Fleagle<br />\nChicago and Princeton have coming. Oberle, at the rigttt half-back<br />\nBeginning by expressing his delight<br />\nmented favorably on the plan. AlOf four candidates for secretary,<br />\nat addressing Hopkins men, Com- Profits From Dance To Pur- Left Wednesday For San position shares the ball,Soting duties<br />\nthough it is too early to tell whether<br />\nMilton Rudo and R. G. Fleagle missioner Lawson went on to describe<br />\nwith Jakie. Kraterinulln,<br />\nr, another<br />\nchase Furniture For<br />\nFrancisco; Embarks For<br />\nor not the plan will succeed, it is<br />\nveteran performer, hale,<br />\nemerged victorious in the balloting a few of his innovations in the police<br />\nved himevident that the plan may have a<br />\nCommons Room<br />\nAustralia Nov. 9<br />\nself to be an adept p<br />\nreceiver at<br />\nover their other two opponents, Alan set-up of balti'.00re. He described his<br />\nfaf-reachtng<br />\neffect; and whether or<br />\nhis left end position. *alTington at<br />\nD. Hecht and Robert D. Vernon. Probation School for violators of<br />\nCommencing this year's dormitory<br />\nnot it is liked, being such an innoDr. George E. Barnett, Professor the other<br />\nflank position is also a lettraffic<br />\nrules.<br />\nViolators<br />\nare<br />\ncompelled<br />\nRudo is a member of the football<br />\nvation in college athletics, it is<br />\nsocial life with an informal dance, the of Statistics at the Hopkins left on ter winner.<br />\nteam and Fleagle a member of the. to attend for a period of about 90<br />\nbeing discussed throughout the East,.<br />\nentree representatives of Alumni Wednesday for San Francisco. From<br />\nSpillman Might Start<br />\nYMCA Cabinet and of the baseball days, during which they are acquaintboth In college circles and newspaper<br />\nThe Hopkins team will be led by<br />\ned with traffic regulations, taught Memorial Hall have begun to solicit there he will embark on November<br />\nteam.<br />\ncircles. Columnists of the calibre of<br />\nLeroy Applefeld, treasurer of his careful driving, and shown motion tickets to the Annual Turkey Trot to 9 for Australia, where he will spend Captain Tom Ellis, 205-pound dread- \"Daniel\" in the N. Y. World-Telenaught tackle. Oscar Kerstetter,<br />\nclass in his freshman year, and Doug- pictures of accidents and methods of be held on Saturday evening, Novem- the year in doing research work<br />\ngram have thought it worthy of an<br />\nwhose 96-yard run back of a kick off<br />\nlas Spencer, member of the Musical preventing accidents.<br />\nber 13 in the Commons Room from 9<br />\nentire column (News-LETTER, OctStudy Industrial Courts<br />\npovided the winning touchdown in the<br />\nWhen violators are graduated, they<br />\nClub, won out for the post of treasurober 22). The Associated Press and<br />\nto 1 o'clock.<br />\nProfessor Barnett was invited by Haverford<br />\ngame, will be again the<br />\ner for the Sophomore class. Martin are considered as having paid their<br />\nDucats for this affair are selling at the Carnegie Corporation of New key man in the Blues running attack. the N. Y. Times have also carried<br />\nJ. Breslau was the third' and unsuc- penalty. Commissioner Lawson statstories on it.<br />\nYork<br />\nstudy<br />\nto<br />\nmake<br />\nof<br />\nthe<br />\na<br />\nAus$1.10<br />\ndrag<br />\nand $1.50 stag, and may<br />\nSpillman, a hard running back, who<br />\ncessful candidate for the position. ed, \"Most accidents are caused by lack<br />\nRegardless of haw the plan will<br />\nbe purchased from any entree rep- tralian system of industrial arbi- played well in the Haverford tilt will<br />\nJack Neely, Richard Brenner, and of mentality and dullness of the drivturn out, and what outside sources<br />\nresentative. ,The profit, whatever it tration courts as practised both in start again et one of the half-back<br />\nJohn Enders were the three candi- er. Most accidents occur with people<br />\nthink,<br />\nit is necessary for the general<br />\nmay be, will go toward the purchas- Australia and New Zealand. This posts.<br />\ndates for sergeant-at-arms. Enders, in the upper-age brackets behind the<br />\nHopkins campus attitude to become<br />\ning of furniture for the Commons system is of great interest to all, for l John 'Royster, pillar<br />\nof strength, known. The I4EWS-LETTER cannot WO<br />\na member of the lacrosse, wrestling, wheel.\"<br />\naccording to Dr. Barnett \"the Aus- will<br />\nMOM.<br />\nCriminals In Cars<br />\nagain hold down the center posi- strongly urge everyone<br />\nand soccer squads, and Neely were<br />\nwho has reArthur Katz, head of the dormitory tralians have developed their system tion with his more than<br />\n\"In this day and age of the auto200 pounds ceived a ballot to consider it carethe victors in the primary race.<br />\nsocial committee says, \"I hope that (wage regulation) so that the least of beef. He will he flanked by<br />\nmobile<br />\nwhen<br />\na<br />\ncriminal<br />\ncan<br />\nmake<br />\na<br />\nBill, fully and participate in the voting.<br />\nIt was noted by close observers of<br />\nnumber<br />\noccur.\"<br />\nof<br />\nstrikes<br />\nthis dance will be a fitting prelude<br />\nwho blocked the two place-kicks for<br />\nthe campus political scene that the get-away quickly and easily, we<br />\nIn the past, the News-Lerma polls<br />\nDuring the last thirty or forty extra points<br />\nto the future dormitory entertainin the Haverford tilt, and have been fairly successful. The<br />\nresults of the voting indicated a must have- quick-witted men specialstuZealand<br />\nand<br />\nAustralia<br />\nNew<br />\nyears<br />\nments.<br />\ncommittee's<br />\nIt<br />\nis<br />\nthe<br />\naim<br />\nto<br />\nly<br />\neducated to cope with their<br />\nDay, if he recovers from an injury. dent body responded<br />\nreaction to a one-machine slate of<br />\nvery well to the<br />\nprovide the residents with as much have originated and developed a new Ellis and Moore will hold down<br />\nthe polls on the presidential election of<br />\ncandidates for the finals in the Sopho- methods. The police , department<br />\ntype of arbitration in state courts. tackle posts<br />\nneeds men of high education and social life as they desire.\"<br />\nand Vickers and Halbert 1936, and on the Supreme Court.<br />\nmore class elections.<br />\nThe dormitory residents and their Any labor dispute may be referred to will play the wing positions.<br />\ntraining, for when a man may comMen likeare<br />\nprovided<br />\nworkers<br />\ncourts,<br />\nthe<br />\ncomely<br />\nthe<br />\ncompanions<br />\nwill<br />\ndance<br />\nto<br />\nthe<br />\nmit a crime and be outside the Baltily to see action in the backfield are<br />\nmore city limits where we have no tunes of \"The Grenadiers\", a seven unionized and thus can present their Kerstetter, Spillman, Murray, Buck, Lilt.<br />\njurisdiction in 5 minutes, it takes piece band. Invitations will be ex- case in court.<br />\nWard and Traggis.<br />\nConsidered a leading authority on<br />\nquick thinking and quick action to tended to the honorary fellows of the<br />\nSwarthmore Strong<br />\nStates,<br />\ndormitory.<br />\nUnited<br />\nlabor<br />\nDr.<br />\nin<br />\nBarnthe<br />\nRefreshments<br />\nbe<br />\nwill<br />\ncapture him.\"<br />\nThe Swarthmore combine has lost<br />\nAt an organization meeting of the<br />\n(Continued on Page 4, Col. 2)<br />\nHe went on to praise Edgar served.<br />\nseveral contests this season, but all, Dr. Louis Finkelstein, prominent<br />\nCamera Club at the Johns Hopkins<br />\n_<br />\nHoover's Washington set-up, and<br />\nby<br />\nclose scores and to formidable op- i Jewish scholar and Rabbi delivered<br />\nUniversity, hell! Thursday morning,<br />\nspoke about the highly specialized<br />\nponents, and should provide the Jaya , the third and last of hip series of,,<br />\nNovember 4, Eugene Waltman, '40,<br />\ncourses in traffic being presented by<br />\ndefense with a tough afternoon, and three lectures on \"The History of<br />\nWM elected president of the organizathe University of Maryland, and<br />\nthe Blue offense will have to func- Judaism\", Monday, November 1, at<br />\ntion for the coming year. Other pition smoothly in order to get results. Latrobe Hall at 8:15 p.m.<br />\nficers elected were .Phil Peril, '39, Northwestern University.<br />\nIn his lectures, Dr. Finkelstein has<br />\n(Continued on Page 4, Col. 5)<br />\nvice-president, and Miss Sally Freedealt with the history of Judaism,<br />\nman, graduate student in biology,<br />\nThis year's first issue of the Johns as large a number of persons as posespecially with the development of<br />\nsecretary-treasurer.<br />\nJewish beliefs in their historical asHopkins University Gazette, a per- sible with the current 'events at the<br />\nAmong those present at the meetHopkins, the staff has built up the<br />\npects. He had previously traced the<br />\niodical for the alumni and friends<br />\ning were representatives of the Facullargest circulation of any University<br />\n\"A full program has been arranged development from \"the group of noThe first graduate dance of the of the Hopkins, was published and publication. The circulation at presty and Staff, and the graduate and<br />\nmads<br />\nwho worshipped at Mt. &Mai,<br />\nthis year by the Tudor and Stuart<br />\nundergraduate schools.<br />\ncollege term will be held next Fri- distributed this week. This is the ent is almost twenty-one thousand.<br />\nthirty or forty centuries ago\" to the<br />\nClub\" announced Dr. Heffner, presIt was unanimously agreed that<br />\nthird<br />\nissue<br />\nof<br />\nThere<br />\neditorials<br />\nthe<br />\nGazette,<br />\nare<br />\nGazette,<br />\nin<br />\nno<br />\nthe<br />\npublicaday evening at 9 o'clock in Levering<br />\n\"Pharasees or the Temple group, the<br />\na regular membership fee of $3.00 a<br />\ntion having begun in February of and the news articles are limited to ident of the literary society. In ad- first group in history to hold a scienHall. Norman Gardner and his Oryear should be charged, and an adthis year, and continued in a pre reports on official policy of the Uni- dition to the annual spring lecture, tific approach to the truth.\"<br />\nditional $2.00 for the use of the dark- chestra have been obtained for the Commencement Day issue. The !Pur- versity, enrollment figures, and other which will be given<br />\nHe divided Judasim into three perthis year by Dr.<br />\naffatarat,<br />\n7:.:tets are being sold at pose of the tri-annualWa....7_ ..on current events. aaatr__<br />\nrooms and equipDat<br />\nKitridge of the English departmertt'ibus of development, the \"Pr&pric,i,<br />\nNo definite program of club ac- $1.50 stag or drag by graduate stu- is, according to P. Stewart Macaulay,<br />\nThe current issue of the Gazette<br />\n'Period of Analysis\",<br />\ntivities has as yet been arranged. dents or the committe. Chaperones at present one of the editorial staff's includes ten articles on happenings of Harvard University, a series of Period\"' the period<br />\nand the final<br />\ndiscussed in his<br />\nRegular meetings wil be held on Fri- will be announced next week.<br />\nheads, \"to present articles of gen- at the Hopkins. The style is inten- smokers once a month will feature uniph<br />\nlast leo<br />\nPeriod<br />\ner<br />\ncftus<br />\nre<br />\ne. thership<br />\nof the Triday evenings (the place yet to be<br />\neral current interest to the Hopkins tionally informal, according to P. such speakers as Mr. Spenser of the<br />\ndecided upon), at least twice a month.<br />\nto the alumni and friends of the uni- Stewart Macaulay, and there is no<br />\naurenceville School, Mr. Hoyt HodIn his last lecture.L Dr. Finkelstein<br />\nLectures On Syphilis<br />\nAt some of these meetings there will<br />\nversity.\" The small magazine is pub- definite organization to the staff. En- son of<br />\nPrinceton and Professor showed how the scholars through an<br />\n---- —<br />\nbe lectures given by members of the<br />\nThe U. of M. Medical Forum, lished three times a year—about a rollment and scholar,hia statistics, Jones of William and Mary. On No..' open minded and \"thoroughly scienFaculty and by authorities on varimonth after classes start, just before ! and an article on the ..reduct.on of<br />\ntific approach\" to truth and to th..<br />\nChapter of the Ass. of Medical<br />\nous fields of photography from outCommemoration Day in February, the deficit make up an important part ! vember 23, the club will give a tea study of how to live, laid the foundstudents will hear \"A Symposium<br />\nside. Other meeting's will be devoted<br />\nin honor of Countess Chambrun, who ations of modern civilization. He ext<br />\nand<br />\nadministrajust<br />\nbefore<br />\nthe<br />\nCommencement<br />\nperiodical.<br />\nfor<br />\nof<br />\nAs<br />\nDay<br />\non Syphilis\" at their meeting Frito informal discussions, print critiin June. The purpose of publishing tion policies, the Gazette contains will address the English conference.' plained that Judaism was a \"system<br />\nday, November 5 at Gordon Wilson<br />\ncism, etc. There will be several comthe periodical at these three times articles on the development of the,! The officers of the club,<br />\nHall, 8:15 p. m. The speaker will<br />\nbesides of learning\" based on the will of God<br />\npetitions and exhibits held during !<br />\nis<br />\nto acquaint the alumni of, and Sanitary Engineering division of the\\-be J. Earle Moore, M.D., of the<br />\nsiD.<br />\nr Heffner, are Dr. Boggs, vice- in regard to the ways of life.<br />\nthe year.<br />\nothers<br />\nHopkins<br />\nDepartment<br />\ninterested<br />\nthe<br />\nby<br />\nEngineering<br />\nin,<br />\nDr.<br />\nCivil<br />\nAfter the ninth century great<br />\n,<br />\n1 J. H. U. Medical School, and Harry<br />\nThe club is open to any member of<br />\nwith the facts connected with the Abel Wolman, the revision of the president; Truehart Brown, score- schools of rabbinical learning preM. Robinson, M.D., of the U. of<br />\nthe University. The only prerequisite !<br />\n'T. served the culture of the East and<br />\nbeginning of the school and plans curriculum of the psychology De=1-4rY, Dr. French, curator; and<br />\nMaryland Medical School.<br />\n(Continued on Page 4, Col. 4) 1<br />\nfor the two days named. To acquaint<br />\n(Continued on Page 4, Col. 1) ! Francis Jones, librarian.<br />\n. (Continued on Page 4, Col. 1)<br />\n<br />\nLAWSON EMPHASIZES<br />\nNEED OF KNOWLEDGE<br />\n<br />\nBLUE JAY ELEVEN<br />\nMEETS SWARTHME<br />\n<br />\nDorm To Hold Dr. G. Barnett<br />\nTurkey Trot On Year Leave<br />\n<br />\nCAMERA CLUB ELECTS<br />\nOFFICERS FOR SEASON<br />\n<br />\nCLOSES LECTURE SERIES<br />\n<br />\nHopkins Gazette Publishes First<br />\nAlssue Of Thrice-AnnualPericdical<br />\n<br />\nGraduate Students<br />\nCommence Dances<br />\n<br />\nTudor And Stuart<br />\nTo Hear Speakers<br />\n<br />\n\f2<br />\n<br />\nHOMEWOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br />\n<br />\nff!\"_<br />\n<br />\nCooperation Needed<br />\n<br />\nZ5be jolinz ii)ophitt<br />\n<br />\nPetu5<br />\n<br />\nognized campus activity, it receives an annual allotment from the S.A.C. But -for the money which forms<br />\n<br />\netter<br />\nFounded 1897<br />\n$200<br />\n<br />\nSubscription per year<br />\nBy Mai<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRemsen Hall, Postoffiec, John Hopkins University.<br />\nEntereci as second class matter December 3, 1909, at the postoffice<br />\nin Baltimore Md.,. under the Act of Congress, November 3, /879.<br />\nPublished semi-weekly front October to Jane, except during examination and college holiday periods by undergraduates of the Jobe. Hopkins<br />\nUniversity,<br />\n<br />\nAnd let the student body not believe that the cost of<br />\nadvertising is prohibitive, leading to the refusal of these<br />\n<br />\nCollest5iate West<br />\nPPP 4* NTISD<br />\n<br />\n1.011<br />\n<br />\nmerchants to advertise. Let them not belieye that it is<br />\n— I the monetary consideration involved in this compart.vely trifling sum, which, while but a drop *in the<br />\n<br />\nNAT.06.1AL •OVIIRTISONO O./<br />\n<br />\nN ,tinnalAdvertisingService,Inc.<br />\n<br />\nbucket to them means so much to us.—This consideration is not what leads to their refusalb to business staff<br />\n<br />\ncoiker Publisturs Heteeeeetative<br />\n1MADIAQI4 AV.:<br />\n42,<br />\nNEW YORK. N. Y<br />\nBOSION - LOS 0.11OltSU • S•X FRANCIS,<br />\n<br />\nLt...0 •<br />\n<br />\nMEMBER<br />\n<br />\n1938<br />\n<br />\nCherchez la Femme.<br />\n<br />\nBrand New ...Play..<br />\n<br />\napproaches. Rather it is their cock-sure, over-smug,<br />\nalmost.'gloating faith in the need that Hopkins men have<br />\nfor -them.<br />\n<br />\nStraight from Manhattan comes<br />\nthe news that Baltimore audiences<br />\nwill be the first to receive another<br />\nnew play this winter. Brooks Atkinson, famous New York Times critic<br />\nwho has given some of the best jeers<br />\nof his life to the theater, writes that<br />\nthe as yet untitled Ryskind—Edward<br />\nChilds *Carpenter comedy will be<br />\npresented here on December.6.<br />\nMr. Ryskind is out on the West<br />\nCoast casting for the show and it<br />\nlooks now as though Doug Fairbanks<br />\nJr., and Madge Evans will take the<br />\njuvenile leads.<br />\n<br />\n... Program<br />\n<br />\nsoft shoe dance without shoes in the<br />\ncorner of Broadway and Stooler<br />\nAlpha Chi Rho's big apple Brawl<br />\nStreets last week. When questioned<br />\nnecessitated reinforcing the living<br />\nabout the exploit, Ernie, clever kid,<br />\nroom floor. . . Wanted: fiften freshblamed it on a pair of tight shoes.<br />\nmen, smart and smooth, to go Kappa<br />\nHowbeit, we think that the stuff was<br />\nThat's what Bill Schmied<br />\nAlph.<br />\nmore potent than shoe leather.<br />\nwants, but then again, who doesn't .<br />\nThe Kappa Sigs got a dandy break<br />\n. . Bucky Sellman, before the interwhen a local alumnus forked over<br />\nfraternity board for violating rushfifty bucks at their recent house<br />\nrules: \"I'm innocent, jedge, innocent\"<br />\nparty .. . Many a maid will be dis. . . D. U. entertained its potential<br />\nillusioned when she trots over the<br />\npledges at a dance held at the BaP1<br />\nD. U. 'house to see their etchings.<br />\ntimore Country Club t'other night.'<br />\nThose guys ackshully got etchino<br />\nForemost on the evening's program<br />\nand they'll show them to you, too.<br />\nwas a conuvial cocktail party Of bro. . . Pi Lambda Phi announces the<br />\nther Matheson.<br />\nelection of Perry Edelstein as Rex.<br />\nPhi Alph's slug-feast with the A. Perry succeeds Bert Margolis who<br />\nD's on Tuesday ended with a tri- leaves school tomorrow. Bob<br />\nKays is<br />\numph for the heavyweights; but new archon ... Phi Ep<br />\nwelcomed the<br />\nKempton claims a moral victory. Be return of Ex 'Gland Mogul<br />\nCastelle<br />\ntook a swing at Tubby Pollack and who led his brethren<br />\nagainst their<br />\nlives to talk about it.<br />\nformidable football foes, Thursday.<br />\nPhi Beta. Delta celebrated HallowStanley Morton Finkle's kid brothe'en with skeletons, cornstalks and er Coleman, went Eta Beta Tau at<br />\nfarmers at their house. Tonight the Nawth Ca'lina.<br />\nladdiebucks invade Lutherville for the<br />\n.5. Murray says he'd cerZainly like<br />\nseason's informal. Careful, boys. The to get something te-his fraternity<br />\nPhi Sigs have been invited too.<br />\n1 brothers to keep rival factions from<br />\nThe rollicking rokus between A. D. saying that this column is a proand Dell Phi's, as evidenced by Bar- Alpha Delt, mouthpiece. So Murray,<br />\nroll and MacFeeley is all ironed out. if this print should get in your eyes,<br />\ndecided to forgive and forget, we wish to state that you poisonally,<br />\nand in case you're interested, they'll were in condition to impress lily<br />\nmake up in Levering Hall this after- white frosh last Friday nite. Undernoon at four. Line up early boys.<br />\nstand this isn't criticism—merely a<br />\nErnest Kiene pulled a right smart statement'of fact.<br />\n<br />\nOpen House Week<br />\n<br />\nway<br />\n<br />\nupon it for trade-bolstering purposes!<br />\n<br />\nDiatribe'« of<br />\n<br />\nBy BUDDY MACHT<br />\n<br />\nby far the bulk of its income, it must count on receipts<br />\nOne of the trickiest wrinkles in<br />\ntheI annual football phantas magoria<br />\nfrom advertising insertions.<br />\npopped up this year at American<br />\nhas<br />\nNow, it seems only'fair to us that as Hopkins students<br />\nUniversity. This school goes Ruswe should show our appreciation to advertisers for their<br />\nsia's example of women soldiers one<br />\nhelp in the maintenance of our campus organ. And better.<br />\nThey have a girl on their<br />\nthe only real<br />\nIn which we can show this appreciation football team! That's right, a girl.<br />\nOne of the coeds who evidently<br />\n.s by patronizing these advertisers in every way possible.<br />\nWe contend, and feel that the thinking student body didn't think much of the calibre of<br />\nmasculinity at American U. went out<br />\nbehind \"us, that-'n every case of indecision, an adverfor the team—and made it! Of course,<br />\ntiser in the NEWS-LETTER should be given full preference she only goes<br />\ninto the game to kick<br />\nover any non-advertiser!<br />\nthe points after touchdowns, but<br />\nhow<br />\nthink<br />\nmuch she bolsters up<br />\nBut what of the other extreme--those merchants, just<br />\nstores, and shops who depend for the bulk of their the boys' libidos.<br />\nunderstand<br />\nWe<br />\nthat Hopkins' deincome on the student body of the Hopkins, and yet feel<br />\nfense is being entirely revamped, for<br />\nthat they needn't advertise In the<br />\n,NEWS-LETTER? What<br />\nthe game with American next week.<br />\nof those who deem themselves more necessary to the The boys are probably<br />\nbeing polished<br />\nstudents'than the students are to them?<br />\nup on their Emily Post.<br />\nAll these shops, ice cream parlors, and drug stores<br />\n<br />\nEDITORIAL STAFF<br />\ns.<br />\n_Editor-in-Chief ,<br />\nStanley Finkel<br />\n.<br />\nManaging Editors<br />\nJ. Murray Kempton,s7ahered Barroll, Jr.<br />\nBenjamin Root _<br />\nAssociate Editor<br />\nAssistant litilUaging Editors<br />\nJ. C. Handelsman, Victor M. Vtctoroff<br />\nHarold Zheutlin .<br />\nSports Editor<br />\nArnold Glantz, Nathaniel Finkelstein<br />\nActing Sports Editors<br />\nSeymour Sack. .<br />\nFeature Editor<br />\nMal Boshuack, Exchange, Editor<br />\nREPORTERS<br />\nMel Taymor, '40; Morris Wessel, '39; Charles Diggs, '40<br />\nLeonard,Quitt, '40; Daniel Stone, '39; Zeana Baum, ,'38;<br />\nowe something to the students of the Hopkins. It is<br />\n, Cad Resin, '38; Lester Rosenthal, '38; Cconard Rabin.<br />\nper. '38<br />\nthrough thent that their livelihood is earned.<br />\nBUSINESS STAFF<br />\nMelville Locker<br />\nEvilness Manager<br />\nThe fact of the matter- is that these establishments<br />\nare even more obligated to advertise in'the NEWS-LETTER<br />\n1957<br />\nMasts'<br />\n1938<br />\nthan such as, may require this advertising or depend<br />\n<br />\nPosocicied Gotle6iote Press<br />\n<br />\nFOR MODERN GREEKS<br />\n<br />\npotpourri<br />\n<br />\nThe NEws-LETrist depends upon two sources of income<br />\nfor the supporting of its publishing expenses. As a rec-<br />\n<br />\n1<br />\n<br />\nLetters To The<br />\nEditor<br />\n<br />\nONTEMPOxARY<br />\nOMMENT<br />\n<br />\nC<br />\n<br />\nTo the Editor of the NEWS-LETTER:<br />\nStarting this afternoon at 5:30, Sir:<br />\nIIS WAR PROBLEM<br />\nWe maintain that any merchants, dependent upon .the WCAO wil present a new weekly proPermit me thru the use of your colUpton Close, contributor to the the.-Wade of Hopkins' students for their income, owe it to gram devoted to collegiate doings<br />\numn to correct a few erroneous ideas<br />\nthose students to patronize them in every way possible. hereabouts. From the advance in- ,and set one, Hector by name, on the Saturday Evening Post and Far East<br />\nFRIDAY, NOVEMBER 5, 1937 ,•<br />\nformation which we received concernright track. Hector reminds one about commeniator for Time magazine,<br />\nThe solution?<br />\ning the spot it appears that it will<br />\nthe oft quoted statement that a per- speaking before the National AssoIt lies in co-operation—..Patronize our advertisers, and, feature much<br />\nthe same 'sort of stuff<br />\nson, unhampered by facts concerning ciated Collegiate Press Convention in<br />\nwhenever possible, patronisze only our \"advertisers!<br />\nnow being presented by former Hopa subject can talk, or write fluently<br />\nChicago a few days ago, remarked<br />\n(Continued from Page 1, Col. 5)<br />\nkins pum, Brent Gunts, who calls<br />\nabout the subject. Hector* in his<br />\nhis program over VVFBR The Varsity<br />\nthat it was a pathetic thing that the<br />\ncompetition.<br />\n3rd year and should know better. At<br />\nClub.<br />\n.<br />\nHowever Gunts caters only to<br />\n4. Non-subsidization in any form of athetics.<br />\nleast he implies its 3rd by his remark schools and the press have done nothhigh school students while the new<br />\nabout the \"Firebrand\" 2 years old. ing toward developihg in America an<br />\n5. Elimination of gate receipts.<br />\nThe annual intra-mural touch-football season has<br />\nshow is intended strictly for col` Hector howls about Shakespeare adult attitude toward America's place<br />\nIn other words the recent step of eliminating gate reached its half-way mark and the enthusiasm and gen- legians.<br />\nand \"that kind of stuff\" of which in the world. As one scans the newsreceipts—with its attendant evils—is an integral part, eral smooth performance displayed thus far this season<br />\nIt will entail social, scholastic and<br />\nthere has been no attempt to serve Papers<br />\nIndeed, a natural result, of the series of a progressive on the gridirons south of Gilman Hall eclipse all hopes rah-rah news from schools here in<br />\nand magazines of our day and •<br />\nonto the boys and cramp their \"hellheld for this form of mass atnletic entertainment.<br />\n, listens to the conversation of<br />\nmoves made by our athletic policy. \"Athletics for \"ill\"<br />\nthe State, stressing particularly the<br />\nuva good time\". In both 'teferences to '<br />\nThe rewards of these games are not reaped, they are<br />\nis themotto of the plan with the firm view towards wide- taken in stride. The fierce, yet friendly (in the true personality angle. A great deal can \"The Firebrand\" Hector statea thatt\"men in the stseet\" all about him, it<br />\nbe done with a project like this if it<br />\nspread participation and benefit, towards recreation and sense of the word), rivalry exhibited leads to pure sport<br />\n\"one or two actors gave passable , becomes increasingly evident to him<br />\nIs managed correctly. We hope it<br />\nperformances but only served to pull that Mr. Close was not far wrong<br />\nphysical exercise for a major portion of ,the student within the field and not exhibitionism. The hard exhilwill be.<br />\nthe standards down.\" Maybe you can when<br />\naration<br />\nand<br />\nmuscular<br />\nsatisfaction<br />\ngained<br />\nthrough<br />\nthese<br />\nbody.<br />\nhe said that we have a juvenile<br />\nhave Mr. Swyer and crew work and<br />\ngames belong to the players themselves. The players<br />\nattitude toward our place in the soA.s to (3)<br />\npull the standards up. Fortunately<br />\nare not taught, are not coached, are not ordered. They<br />\nDo you prefer heavy subsidization? If you prefer this play cooperatvely with<br />\nRandom House adds to its excellent first the director does not select a ciety of nations in which, for better<br />\nexercise as their purpose and<br />\nyou favor:<br />\nprominence as their prize. Their individual accomplish- record for 1937 with the publishing play, the Barnstormer staff does. The Ipof for worse, the United States is<br />\n1. A highly paid coach and a large coachhig staff, ments are honored and defleiences overlooked. They are of Liam O'Flaherty's new novel director, against his _better judge- living,<br />\nin the game, not eligible for the game. In short, ,the Famine. This book definitely marks ment accepts an offer and uses the<br />\nfor football alone, as well as other sports.<br />\nAt the present time we are facing<br />\nstudents are playing, are having fun, and their enjoy- its author as one of the most brilliant available material. Secondly, Mr.<br />\n'a crisis—we need go no further than<br />\n2. Scholarships given freely to students who are athment IA increased by the formal application of competi- and promising moderns. It concerns Paul Henrichs is or was a Barnstormthe front pages to ascertain that. Our<br />\nletically proficient.<br />\ntion. Several teams which were organized three years the terrible. famine of 1846 and 1847 er (in 1920) and one of the charter.<br />\n3. Wide use of scouts to pick material' for teams.<br />\nago, are still playing with the same lineups; they are which . laid low the Irish peasantry members. Does this interest you Hec- more serious thinkers and commenta4. Long training periods, with spring conditioning units. Referees have become assistants rather than and revealed the rotten conditions kler—oops I mean Hector? Further- tors would have us believe that what<br />\nand fall pre-school camps.<br />\npolicemen, because the rules which have been pr5pared which existed at that time. Written more Mr. Henrich out of his Shakes- we do in this crisis largely will deter5. An emphasis placed on large gate receipts, and are easily understood and conform to their simplicity' In a serious and restrained. mood, pearean atmosphere put forth the<br />\nmine the future of our civilization.<br />\nthe novel is consistently absorbing \"backword idea\" that the 'Stormers<br />\nsupport of minor sports by football.<br />\nand fairness.<br />\n.,<br />\nGranted that we are facing a crisis,<br />\n6. A decided lessening in the importance of intraThe fact that these conditions lead to enthusiasm and and should be one of the season's play a local theatre besides just exploding in finery for one night to an it would seem that an adult attitude<br />\nmural sports. _<br />\nsatisfaction even beyond. the boundaries of the field is best-sellers.<br />\naudience of friends. This sounds pro,r toward that crisis becomes<br />\n7. The practical professionalization of college foot- attested by the ever-increasing ranks of spectators who<br />\n.imperagressive to me. Hector. Please<br />\nball.<br />\nfollow the game with avid interest. The teams themnoteT-tive—or perhaps it is a bit too preAs to -(2)<br />\nselves have even begun initiatatively to hold secret<br />\nWe saw this one ourselves. One of that the play this year is \"Boy Meetalsumptious to assume that collegians<br />\nGirl\". Should Henrichs, if he directs,<br />\nDo you prefer light subsidization. If you prefer this, practises and .to foster \"team\" play. Several of these the up-and-coming<br />\ncampus politicians<br />\nare capable of assuming an adult atyou favor:<br />\ngames will live in the players years after games optic- running for office last week was so show an inability to handle other than<br />\ntitude toward anything. If such be<br />\n1. A single coach for football,' medium-priced and ally enjoyed are forgotten.<br />\nbusy swinging deals, handing out \"classics\" I'll admit it.Wait till after<br />\nthe case, let us say that We as collegcaring for spring practice.<br />\n.<br />\nThere are`500 students deriving athletic entertainment cigars, and kissing freshmen, that the show.<br />\n2. Part and full scholarships as. well as jobs given from this program. Anyone not participating in it is he completely forgot<br />\nOn any account \"Mr. Swyer and his ians, *wild develop a realistic atto vote for himto students for the sole purpose of getting them denying himself a satisfaction easily attainable, and self—page Jim Farley..<br />\n. . The inter- crew\" can and will tend to their own titude toward the whole problem of<br />\non a team but with scholastic records at least rea- obtainable with little sacrifice. It is not too late to join fraternity board<br />\nbusiness.<br />\nseems to have rewar and peace—this will lead into<br />\nsonable.<br />\nYours, for more of the same.<br />\nthis modern form of college athletic entertainment; the duced its rates here of late. Last<br />\nan adult .attitude when we have<br />\n3. A limited+ amount of scouting for material, main- athletic department will be only too. glad to cooperate week a fraternity<br />\nwas fined one dollar<br />\nChester<br />\nly from high school teams.<br />\nreached the \"proper\" age.<br />\nin finding your place in its program. Join<br />\ncause one-of the lads drove a fresh4. Some training besides actual season practices.<br />\nyour exercise in the form of -athletic entertainment.<br />\nN4lhat constitutes a realistic attitude<br />\nman home in his car. This week some<br />\nAnother 'Stormer says Hopkins'<br />\n5. Some emphasis placed on gate receipts, publicity<br />\nfraters not only drove a freshman all undergrads want to \"test\" Shakes- toward the‘...problem of war and<br />\nof a local nature to secure gate receipts.<br />\nthe way to Washington but they com- peare.<br />\npeace? Or, Tor that matter, what<br />\n6. Some lessening of the emportance of intramural<br />\nmitted two other flagrant violations. Dear \"Hector\",<br />\nconstitutes a realistic attitude tosports.<br />\nThe horrible examples of Spain and China today The frat was'fined one dollar ($1.00)<br />\nThe Barnstormers like any other ward anything? In the first place,<br />\nNeedless to say, we prefer the present program beor thirty-three and a third cents per<br />\norganization are always on the look- collegians should think the matter<br />\ncause it is in line with the educational policies' of an show clearly that War has no respect for Universities violation. We're.<br />\njust<br />\nthrough and come to their conclusions<br />\nwaiting<br />\nfor. out for constructive<br />\nnor for anything Universities represent. Hospitals, labcriticism. Howenlightened institution. It is in harmony.with a desire to<br />\nnext week. At the present rate the<br />\never, your comments in the Novem- by reasoning, which is the outcome of<br />\nprovide well-rounded educational possibilities for all oratories, research buildings, lecture halls—all are fraternities will<br />\nprobably start fining ber 2 News-LETTE<br />\ncareful study, rather than by letting<br />\nscarred or actually destroyed<br />\nits ravages. The<br />\n,<br />\nhuR, are a little short<br />\nthe students.<br />\nthemselves ben emotionally stirred to<br />\nmanitarian ,purposes of these structures are submerged the board ... The NEWS-LETTER straw of foolish.<br />\nthis<br />\nvote<br />\nweek<br />\nshould<br />\nat<br />\n\"view with alarm\" and \"rise in proleast show<br />\nby the blind barbarism attendant on War. Here we have<br />\nIn the first plaCe why shouldn't<br />\ntest\" by some demagogue who imagthe meeting of two conflicting occupations: that of which way the hot air blowk. . . . Hopkins undergraduates<br />\nwant to ines he<br />\nOut Cockeysville way they'll get out<br />\nhas cause. Right in line with<br />\nbuilding up civilization and that of breaking it down.<br />\ntaste Shakespeare. Aren't they intelIf the poll is to mean anything, there must be wide<br />\nthis is the statement of Senator Josh<br />\nModern warfare has shrunk all concepts of distance the old shotgun if you mention ligent enough for it?<br />\nHave you ever Lee<br />\nHopkins. It seems that. one of the.<br />\n'participation and serious consideration before actua<br />\nof Oli,lgtTs-in an interview with<br />\nNo physical vos .<br />\n, emintry; no part of<br />\n-seen anything monifelarCi<br />\nthan a<br />\nvoting. The three choices seem to us to be rather clear,<br />\nrepresentative of the Collegian<br />\ne population is safe: So it is not tOo difficult for us to H' boys went out there to attend \"a Jane Cowl's 'Twelfth<br />\nNight\" or the<br />\ndance last Halloween eve. That in<br />\nand the selection should be made with facility after imagine students like<br />\nReporter.<br />\n\"If those students who at<br />\nourselves, getting the foundations<br />\nLunts' \"Shrew.\"<br />\nweighing one's opinion.<br />\npresent are signing Oxford pledges<br />\nof an education or delving further into more intensive, itself would be considered in many<br />\nIn the second place \"The Firequarters a major calamity. But that<br />\nWe must obtain a sufficient number of votes in order specialized study, shaken radically<br />\nand opposing military training would<br />\nby the close impact<br />\nwasn't all. He brought a friend along brand\", ',Seven Keys To Baldpate\" use their energies<br />\nto draw any conclusions concerning the Campus opinion. of a war--especially an<br />\non the passage of<br />\ninvasion. We can perhaps feel<br />\n—a beautiful little skunk that and \"What, Price Glory\", were not worthwhile peace<br />\nWe are aware that it is apparently early in the year the distraction of bursting<br />\nlegislation they<br />\nshells to carrying on educapromptly went to•York in a business- written by Shakespeare.<br />\nto take a test, but at least three classes have already tional work.<br />\nwould be increasing immensely their<br />\nIn the third place Mr. Henrichs<br />\nseen the worth of the plan. The removal of gate receipts<br />\nis effectiveness in furthering peace\".<br />\nMaybe the letter sent to the head of our Student like way. After they cleared away<br />\nthe wreckage they wanted to lynch a former member of the Barnstorm- Because we quote<br />\nis merely a further step in the new,athletic policy begun Council by<br />\nM. Lee's statement<br />\na Chinese student will serve to bring 'closer<br />\nhim but instead they slapped him in era and in fact one of its .original does not mean<br />\nyears ago. The freshmen as well as other have seen the to home the situation in China.<br />\nthat we are in favor<br />\nHere, a peaceful country<br />\n-the'fug where he remained until his members.<br />\nfirst football game under the new system. They have —slowly awakening from<br />\nof<br />\nmilitary<br />\ntraining—quite<br />\nthe slumber of. backward civon the<br />\nIn the last place your article<br />\ndad bailed him.out the next morning.<br />\nalso been participating in the intramural program, an ilization—is brazenly invaded<br />\nlost contrary, We are opposed to it. What<br />\nby an aggressive enemr<br />\nall purpose when you signed it Hecieursd ohsaiwt-tIntegral part of the new athletic policy.<br />\nwe are urging is that students in<br />\nwho is mercilessly endeavoring to bring the attached<br />\ntor. If you will look in Winstons dicSo let us make this poll a significant indication of our country under her domination. Caught<br />\ntheir work for peace, instead of conup in the conTeachers' Bright Sayings<br />\ntionary \"hector\" is interpreted as<br />\nopinion towards these athletic problems. Fill out your fused social maelstrom—that results<br />\na fining their actions merely to negafrom the war are • Platonic love is a<br />\nblustering<br />\ndistinterested<br />\nfellow<br />\nbaflots now!<br />\native acts that will do nothing more<br />\nthese students like us- across the sea.<br />\nfriendship with somebody else's wife<br />\nA \"'Stormer\"<br />\n(Continued on Page 4, Col. 5)<br />\n<br />\n7937<br />\n<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\n<br />\nAnent The Poll<br />\n<br />\nSuccessful<br />\n<br />\n..Book<br />\n<br />\nFribble<br />\n<br />\n, - War and Students<br />\n<br />\nby<br />\n<br />\nMake It'Worthwhile<br />\n<br />\nSI<br />\n<br />\nWi<br />\n<br />\nPol<br />\n<br />\nIr<br />\nexist<br />\nion<br />\ntoda<br />\n<br />\nLET<br />\ndent<br />\n<br />\nShal<br />\npoll(<br />\n<br />\nSi<br />\ncolic<br />\nand(<br />\nDr. •<br />\nmen<br />\nners<br />\n<br />\nthat<br />\nh<br />\nself<br />\n<br />\nof<br />\ncityi,<br />\nably<br />\nin tl<br />\nTele<br />\nto b<br />\nsappr<br />\nam<br />\nh<br />\nelicecoi<br />\nc<br />\nre<br />\n<br />\n,Yorl<br />\n<br />\nProic<br />\nthe<br />\ngrad<br />\nmatt<br />\nton<br />\n<br />\nOr<br />\nunde<br />\n<br />\nachei<br />\nHopi<br />\ncan't<br />\nnavei<br />\nthird+<br />\nwhic<br />\nuate<br />\nball<br />\nuate<br />\nFi<br />\neyes<br />\nera,<br />\nUpor<br />\nwast<br />\nthe<br />\nswea<br />\nstrip<br />\nthe<br />\nwher<br />\ntime<br />\nwhet<br />\nThis<br />\nthem<br />\n<br />\ncolle<br />\nthen<br />\ncryst<br />\ngrad<br />\nShaf<br />\nwith<br />\nthat<br />\nsqua<br />\nard (<br />\niful<br />\ncorm<br />\nores:<br />\nmeat<br />\nsenti<br />\nW,<br />\n,iate<br />\nI acry<br />\noff f<br />\nyou<br />\nture<br />\nence<br />\n<br />\nin<br />\nappr<br />\nif y<br />\nbette<br />\nthroi<br />\nsped<br />\nfoott<br />\na a<br />\nores(<br />\nter c<br />\ntire ,<br />\nFridi<br />\n0111131<br />\n<br />\nnext<br />\ndid,<br />\nbeim<br />\nmy /<br />\nembr<br />\nTh<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FRIDAY, NO<br />\n<br />\n5 1937<br />\n<br />\nSPEAKING OF...<br />\n<br />\nSPORT<br />\n<br />\n. . . RUBINGAIR, GIVE HIM ANOTHER<br />\nSHOT IN THE ARM<br />\nBy LEN RUBINGER<br />\n<br />\nSPORTS STAFF RECEIVES COMMENT SPIKED SHOE HOLDS BOOTERS TO BATTLE<br />\nUPON TODAY'S ATHLETIC ISSUE MEETING MONDAY; TOWSON TEACHERS<br />\nWill The Undergraduates<br />\nFollow Hopkins Tradition Of Yore?<br />\nPolicy Threw Bombshell Into<br />\nCollegiate 'Athletic<br />\nCircles<br />\n<br />\nO'NEILL ELECTED AND ALSO BLUE RIDGERS<br />\n<br />\nIntercollegiate Schedule<br />\n<br />\nJoe O'Neill, Former Vice\" Bluejay<br />\nSoccerites Set Back<br />\nPresident, Is Now<br />\nTeachers 1-0 List<br />\nNew Head<br />\nMonth<br />\nArt Lankford, Captain Of<br />\nMountaineers Have Poor<br />\nTrack team, Voted<br />\nRecord Among State<br />\nVice-President<br />\n<br />\nSoccer? Today<br />\nfans Hopkins vs.. Towson State<br />\nTeachers College at Towson<br />\nSoccer, November 6<br />\nJohns Hopkins vs. Blue Ridge<br />\nCollege at Homewood<br />\nFootball, November 6<br />\n• Johns Hopkins vs. Swarthmore<br />\nCollege at Swartlynore<br />\nCross Country, November 6<br />\nJohns Hopkins vs. Drexel Institute at Homewood ,<br />\n<br />\nousims,<br />\n.01.fr<br />\n<br />\nEvery columnist, sometime or other, is faced with the rather embarassMg realization that there isn't a thing to write about which hasn't already<br />\nbeen mentioned, more or less, in some way by some one. When such is<br />\nthe case.—and it is so with this writer (if he may be permitted to class<br />\nhimself among the columnist's; If only out of the consideration that he is<br />\nattempting to write a column), he usually resorts to a form of ridiculousness;—an endeavor to make something out of , nothing, so that he may<br />\n\"mate'1 something; whereas, if he didn't write anything .he would \"make\"<br />\nyou 'know what I me).<br />\nmean).<br />\nnothing<br />\nA gobd starting point in this campaign of seeming absurdities would<br />\nbe the Teachers' College—and more specifically, the female division of that<br />\ncollege (every body picks on the poor women). One who'has been around<br />\nHomewood for a number of years has noticed the definite increase in the<br />\nnumber of fair sex on the campus. We know that they are assigned a<br />\ncouple of nights a week up at the Gym,so that they-may at least experience<br />\n<br />\nBy ARTY LACHMAN,<br />\na bit of athletic enjoyment. But that's as far as it goes. They have no<br />\nIn our eyes, the most important<br />\nLast Monday evening the Spiked<br />\nteams, and no coaches, and hence they can never expect to represent the<br />\nexpression of undergraduate opinShoe, honorary track fraternity, held<br />\nThe 'Blue Jay booters face a busy Johns Hopkins University in competition against<br />\nion in recent years is being rendered<br />\nother schools. Wouldn't<br />\nan important meeting in Levering<br />\ntoday at the Hopkins. The NEWSweek-end when they face the Tow- it be wonderful if they'd organize a field-hockey<br />\nteam, or a swimming team,<br />\nHall. The/ attendance was 100 pe<br />\npoll<br />\nwill<br />\nLETrER<br />\nreveal how the stucent Pant Castelle, president of the son State Teachers' College eleven to or some such thing? Yes, it would be!<br />\ndent body feels about Dr. Wilson<br />\nclub, had left school and new elec- day and the Blue Ridge College bootBut more wonderful still would be the inauguration of a new activity<br />\nShaffer's<br />\nultra-amateur<br />\nathletic<br />\ntions were held. Joe O'Neill, former ers on the following day. '<br />\nfor men, which holds its place among the oldest of sports at any institupolicy.<br />\nVice-President,. was elected PresiThe clash with the Towson lays tion:—that is, crew. We have here in Baltimore the'<br />\nBombshell Explodes<br />\nPatapsco river, which •<br />\ndent. Arthur Lankford, captain of<br />\nWill mark the second encounter be- river is easily comparable to any<br />\nSince it exploded under our very<br />\nother body of water that is now being<br />\nthe Blue Jay's track team, was made<br />\ncollective noses,• it is hard for us to<br />\ntween<br />\nthe<br />\ntwo. In the previous tilt used by oarsmen. All we have to do is steal a couple<br />\nthe new Vice-President.<br />\nof shells and start<br />\nunderstand the fat-reaching force of<br />\nthe Lyonsmen emerged victorious building he-men; and as a first step in achieving the<br />\nPlans Made<br />\nlatter, we can do away<br />\nDr. Shaffer's bombshell. Its fragAfter dinner, discussions were over the last year's State Champions with Dormitory fare, which food seems to be Shrinking men instead of exments hurled themselves to all cor- FLASH<br />\nSeveral prisoners at Alcatraz held and plans were made for the by a 1-0 score. It was a hard-!ought panding them.'<br />\nners of the athletic world. What<br />\ndoes it mean? It cannot be denied 1,rison, which houses the toughest event sponsored .by the Spiked Shoe. contest with outstanding playing on<br />\nOr perhaps we might be interested in renewing the ancient demand for<br />\nthat the Hopkins once more set it- Federal criminals, are' taking corres- The date of the meet is the twentieth both sides. The visitors were unable la swimming pool somewhere<br />\non the campus, so that Coach Hambleton might<br />\ncommittee<br />\nof<br />\nNovember.<br />\nwas<br />\nA<br />\npondence<br />\ncourses<br />\nfrom<br />\nthe<br />\nUniversity<br />\nself aside from its fellow institutions<br />\nto penetrate the Black and Blue le- not have to spend all that mouey in traveling to<br />\nCity'College pool. If we're<br />\nformed to, carry out the plans of the<br />\nof learning on March 2 last. Publi- of California.<br />\ntense<br />\ndue<br />\nto<br />\nthe<br />\nbrilliant<br />\nplaying<br />\nof<br />\nreally serious, we might even get the student body out with picks and<br />\ncity, which we have been remarkIt would take 563 years for one club, and to manage the meet. MilGoalie<br />\nCy<br />\nRomanofsky<br />\nand<br />\nhis<br />\nHerman<br />\nwas<br />\nfullmade<br />\nFranklin<br />\nton<br />\nSaul<br />\nshovels, digging a big ditch, and praying for a good long rain. But that<br />\nably adept at avoiding, was gained person to complete all the courses<br />\nin the widely-read New York World now being offered by Yale Univer- Chairman of the group. Other mem- backs. The Jays made the lone tally would mean another flood in Cumberland, which town is supplying us with<br />\nare<br />\nDriscoll<br />\nhis<br />\ncommittee<br />\nbers<br />\nof,<br />\nsity.<br />\n. It's O.K. for Methuselah.<br />\n,of the conteq in the first period on 4n awful lot of students these days.<br />\nTelegram column of Daniel. We are<br />\nand Gwinn.<br />\nto be admired for not falling to the<br />\nThere are more part time students<br />\na well-placed lick by Briggs, center<br />\n,Finally, we must recognize the suggestion of several students that we<br />\nMeet Was Success<br />\ncheap publicity-seeking level of other enrolled at New York University than<br />\nforward, and then played well to pro- establish an ice-hockey team. It seems that some of<br />\nthe boys have brought<br />\nLast year this meet was a great<br />\nschools. The spectacular but favorable there are full time students at any<br />\n• their skates to school and cannot hear to, see them rust away. But those<br />\nsuccess. There were a great many tect this tally..<br />\nrecognition of our plan by the New other college excepting California!<br />\nThe Hopkins chances of increasing Ideas may quickly be dispelled from their minds by<br />\nhigh schools that competed and the<br />\n• York paper is, to our minds, tacit<br />\ntheir witnessing of<br />\nJohnny Maulbetsch, Michigan's<br />\nHigh School the total was hindered when Hartke some of our Basketball<br />\nmeet was'wen by Curtiss<br />\napproval of the Hopkins' pioneering greatest plunging<br />\ngames, a few of which combine the elements of<br />\n•<br />\nfullback, gained<br />\nof New York. This year the success sustained a leg injury in the first<br />\nproject, and almost, in itself, justifies 350 yards against<br />\nhockey, wrestling, and rugby into one grand performance Of a modified<br />\nHarvard in 1913<br />\nOf the meet is already assured as it<br />\nthe plan. Further, Princeton's under- without scoring . . . Each time<br />\nstanza. His presence in this coming type of football, which all goes to show that we don't<br />\nhe<br />\nneed ice-hockey<br />\nis certain that at least six 'teams<br />\ngraduate-daily -has-seen IR to inti- took the ball to the Crimson goal<br />\nline,<br />\ncontest<br />\nwill<br />\nbe of the greatest bene- when Basketball is going on. What about the ice-skates? Well,<br />\nsuppose<br />\nmate that that a like plan at Prince- the quarterback called some other will participate. Among the schools<br />\nton would not hurt her enrollment. back to carry the ball over. All failed interested is Nott Terrace, from fit and necessity to the Hopkins we trade them in for a ticket to a professional hockey game<br />\nSchenectady, whose team has been booters.<br />\nPoor Athletic Record<br />\nand Harvard scored a 7-0,victory.<br />\namong the first three high school<br />\nOn the other hand, the Hopkins'<br />\nThe Jay teara faces an easier as\"Snooks\" Dowd ran 210 yards for<br />\nN cI RTH IN<br />\ncross country teams in the country. signment when it meets the<br />\nto<br />\nsee<br />\nhis<br />\nundergraduate is forced<br />\nBlue<br />\na touchdown, Lehigh vs. Lafayette.<br />\nE. NORTH AVE. I<br />\nignominously defeated by<br />\nOthers Interested<br />\nRidge team, for the visitors have<br />\nHe ran in tfla Wrong direction cirTHE RENDEZVOUS OF<br />\nschools in every respect inferior to<br />\n'<br />\nThere are a number of other high,<br />\ncled the goal-pasta, and ran back<br />\nbeen<br />\ndefeated<br />\nby<br />\nan<br />\n8-1<br />\ncount<br />\nby<br />\nCOLLEGE FRIENDS<br />\nHopkins. He asks himself why we<br />\nschools with above, average teams<br />\nagain the length of the field!<br />\nOur Prices are Lower Than Ever<br />\ncan't have a team worthy, of our<br />\nwho are interested in the meet. Olney Towson.<br />\nThe line-up for Friday's tilt:<br />\nname. He registers chagrin as he • Coach A. A. Stagg, the grand old High School from Philadelphia and<br />\nthinks of his alumni days i n man of football was an end on,the Chester High have expressed a deHOPKINS<br />\nTOWSON<br />\nwhich the main tie between a grad- first All-American team in 1889!<br />\nsire to participate. From Baltimore, Romanofsky<br />\ng<br />\nWilde<br />\nMichigan's<br />\nfamed<br />\nWillie<br />\nHeston City, Poly and Mt. St. Joe are sure<br />\nuate and his alma mater is the footGon'gh<br />\nr. f.<br />\nL. Cox<br />\nball team. How cap.the undergrad- scored over 110 touchdowns from entrees with Central High and Mc1f<br />\nCernik<br />\n1901 to 1905.<br />\nuate react?<br />\nKinley Tech from Washington as Stout<br />\nc.h. •<br />\nWheeler<br />\n\"Skivy Davis\", Oklahoma Uni- probable starters. This encounter is Hartke<br />\nFirst he Must realize that in the<br />\neyes of many college football play- versity, kicked 23 goals after touch-' on its way to becoming one of the Hoops<br />\nW. Cox<br />\n1h<br />\ners, the \"do or die\" spirit is dead. downs in one game, September 29, outstanding high school meets in this Kephart<br />\nr. h<br />\nBennett<br />\nUpon serious reflection, it does seem 1917.<br />\nsection, and it is felt sure that those Briggs<br />\ncf... Garamerncen<br />\nwasteful for a young, map to spend<br />\nWorld's Largest Schoolhouse: Pitts- who turn out to watch the competiStern<br />\n• i. r<br />\nthe major part of four years in a burgh's Cathedral of Learning is 42 tion will be amply rewarded by the Brayshaw<br />\n1.1<br />\nShock<br />\nsweaty locker room or on the chalk- stories high, contains 375 rooms, 67 keen competition of the races and Linthicum<br />\nstriped \"green pastures\" while in labs, 52 Research labs, 91 classrooms, by the high caliber of the contestants. Price<br />\nOr<br />\nGordon'<br />\nthe shadow of academic buildings 8 large Lecture Halls, 15 DepartIndoor Track Team<br />\nLoenstein<br />\n0.1<br />\nPhillips<br />\nwhere he could spend some of that ment Studies, 5 Theatres, 18 offices,<br />\nAmong other things discussed at<br />\ntime fitting himself for the days 3 floors of Library, a Fine Arts Li- the meeting wart the prospect of an<br />\nthere every day and so. is Dick<br />\nwhen he is fretting, fat and forty. brary, Club and Lounge rooms!!<br />\nindoor track team for Hopkins. There<br />\nGwinn, one of the greatest runners<br />\nThis is not opinionated; the players<br />\nThe University of Denver celebrates are a number of indoor meets that<br />\never developed at Hopkini.<br />\nthemselves are adopting this attitude. Adam and Eve day in January,<br />\nEach the team could participate in, and<br />\nIn the meantime, don't .forget No- Don't Scrap Football<br />\nstudent receives an apple from the efforts are being made to form a<br />\nWe don't call for a scrapping Of Chancellor!<br />\nrelay team. Dick Gwira, Coach Ham- vember the twentieth. Come out to<br />\nis,<br />\npoint<br />\nThe<br />\nat<br />\nall.<br />\nfootball<br />\ncollege<br />\n'<br />\nbleton's assistant, will be 'in charge see some of the best high school runA trio of local Gamblers secured<br />\nthere is a trend afoot and we have<br />\nof early practice, as the latter will<br />\nning, and some of the future college<br />\nthe land for the First building of the<br />\ncrystallized it. The Hopkins underbe busy with the swimming team<br />\nUniversity of Arizona.<br />\ngreats. It will be well worth your<br />\ngraduate should realize that Dr.<br />\nduring the winter. For all those who<br />\nwhile.<br />\nShaffer's plan is merely in keeping<br />\nare interested, a notice will be in- 1with the same indomitable spirit This prevailing idea of the alumnus serted in the NEWS-LETTER when the<br />\nthat caused Hopkins •to rise from a tearing his heart out because his call for candidates is issued. EveryROETH•<br />\n, body who.has._ any ability<br />\nsqualid group of buildings on How- boys are on the short end every Sat<br />\nto run<br />\nJeweler<br />\nard or some such street to the beaut- urday. is the bunk., It may be claimed ;should come out, as the positions are<br />\n3120 Greenmount Ave.<br />\niful Homewood site, that saw us that we are losing a large source of wide open, and the, prospects are<br />\nWath Repairing<br />\ncome through that \"ole debbil de- alumni revenue because we don't bright for a few good trips.<br />\npression\" in one piece. We don't get out and win consistently. We<br />\nThose who are interested may start<br />\nHopkins.<br />\nfeel<br />\nalumni<br />\nthat<br />\nthe<br />\nare<br />\nmean to appeal to the undergraduate<br />\nconditioning themselves now by<br />\nmade of sterner stuff on both counts. working out<br />\nsentimental nature.<br />\nwith the cross country<br />\nWe feel the losing, team does not team. Equipment<br />\nHopkins Unsentimental<br />\nmay be secured<br />\nWe realize the Hopkins undergrad- aggravate them but rather they, are any'llay from the manager at 400<br />\namateurism.<br />\n(Time<br />\nits<br />\nrank<br />\nelated<br />\nby<br />\nuate is more cold, hard reality,than<br />\nat the gym. Coach Hambletottls.up<br />\nlacrymose sentiment and is better prevented us from speaking to any<br />\noff for it. We want to say that if alumni on this point so strictly speaki<br />\nWhen you stop and consider<br />\n•<br />\nBILLIARDS<br />\nyou believe in the Hopkins, its ma- ing this is mostly prediction). More<br />\nthat Schloss' creations are the<br />\nPing Pong<br />\nthey<br />\nsee<br />\nfeel<br />\nthat<br />\nif<br />\nwe<br />\nImportant,<br />\n• Even under duress Arrow'shorts will maintain their<br />\nture academic approach, its insistlatest; that Schloss' materials<br />\nManaged by Maryland',<br />\nplacid dignity without sawing, binding or creeping.<br />\nence on the truth of things, its place fit to loosen the purse strings, eleven<br />\nare the finest; that' Schloss'<br />\nState Champions<br />\nin Universal education, then your men in blue being soundly thrashed<br />\n'They'll wearwell too, without shrinking, and dutifully<br />\nexpert tailors take greater<br />\nFinest Tablea—Reaaonable Prices<br />\ncause a tightening of said<br />\napproval is,etterly consistent. 1110,.<br />\npains with their work — then<br />\nserve you in aorzirTI- crow Shorts—seamless crotch<br />\nGreenmount Ave & 31st St.<br />\nif you firmly believe Hopkins can purse strings. We feel that if any \\syou understand why Schloss'<br />\n—Sanforized Shrunk 65c. up. Undershirts 50c.<br />\nHomewood,<br />\nneed<br />\nat<br />\nthe<br />\nsees<br />\nalumnus<br />\nperhaps<br />\nbetter itself in some way,<br />\nprices are reasonable.<br />\nthrough publicity, or through a re- he'll contribute, if he can afford it.<br />\nGet To Know Us<br />\nDistinguished Sui t s,<br />\nspectful standing in intercollegiate We feel he realizes that the HopYOUR CREDIT IS GOOD!<br />\nfootball circles, you are expressing kins is based on productive laboraTopcoats, Overcoats<br />\nEXPERT HAIRCUTTING, 40c<br />\non<br />\nproductnot<br />\nlibraries,<br />\ntories<br />\nand<br />\na conscientious disapproval to the<br />\nrooms.<br />\nlocker<br />\nive<br />\nmata<br />\njust<br />\npresent plan. Maybe it is<br />\nTHEODORE'S<br />\n' Mature Outlook<br />\nter of pride. We ran through the enHaving a broad vision, it seems to<br />\nBARBER SHOP<br />\ntire gamut of profanity that hor bI<br />\nthat the undergraduate should<br />\nFriday night some weeks ago.,(<br />\nS. W. Cor, St. Paul and 33rd Sta.<br />\nlook at the question from its broader<br />\nourselves, of course—We had dat<br />\n1st Floor, next to Drug Store<br />\nWe Carry A Full Line Of<br />\nnext to us) We know many others aspects. t,,swalloW his pride and then<br />\nArrow Shirts And Collars<br />\nHours: 8 a. m. to.7:30 p. m. Sat.<br />\ndid, silently or otherwise; the latter watch the plan catch on. It's difficult<br />\n8 a. m. to 930 p. m. Manicuring<br />\nbeing the case not infrequently in to place yourself behind an experimy section of the stand, much to my ment defying the prevailing mode of Individual Brush and Comb For<br />\nthings. Seventy years of Hopkins'<br />\n(nowhere Asa)<br />\nEvery Customer<br />\nembarrassment.<br />\n11 East Baltimore Street<br />\nThe alumni question is important. history should' 'allay such doubt.<br />\nAININIMMIMINMW<br />\n<br />\nCOLLEGLATE<br />\nODDITIES<br />\n<br />\n1<br />\n<br />\neYVING IT!<br />\n<br />\nWhen You Stop<br />\nAnd Consider<br />\n<br />\nArrow'Shorts can take it!<br />\nCan you?<br />\n<br />\nii<br />\n<br />\n,ARROW UNDERWEAR<br />\n<br />\nFrom $35<br />\n<br />\nJ os.<br />\n<br />\nSchloss<br />\n& Son<br />\n<br />\n5 East Lexington St.<br />\n<br />\n-<br />\n<br />\nMcPherson's<br />\n<br />\n\f4<br />\n<br />\nHOMEVVOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br />\n<br />\nWILLIAM RUSSEL I<br />\nOF CAPIOLIC U.<br />\nTO SPEAK MONDAY<br />\n<br />\nSpeaker On Catholicism<br />\n<br />\nrONTEMPORARY PANEL DISCUSSION<br />\nvOMMENT<br />\n<br />\n'Stormers Promise Production<br />\nPleasing To Hopkins Audience<br />\nReviewer Claims \"Boy Meets Girl,\" To Be Funnier Than<br />\n\"Once In A Lifetime\"; Story Centers Around<br />\nAntics Of Two Scenario Wr3,ers<br />\n<br />\n_ (Continued from Page 2, Col. 6)<br />\nthan keep them personally from going<br />\nto war should work positively for<br />\n<br />\nAT FIRST FORUM<br />\nLED BY ALUMNI<br />\n<br />\npeace and its promotio,n in society.<br />\nThis is the realistic or adult attitude<br />\nViews Presented On Subject<br />\nBy WILLIAM L. SNYDER<br />\nthe mother and her foetal burden as far as the individual is<br />\nconcerned.<br />\nLast year the Barnstormers pro- under contract.<br />\nOf Return To Freshman<br />\nIt also is the adult attitude as far as<br />\nduced Once In a Lifetime, a rollickAs soon as the baby, Happy is his<br />\nStatus<br />\ning comedy about. Hollywood. Due name, is born the cameras begin America is concerned. America, in its<br />\nSTUDENTS AND<br />\nto that complete success, the group grinding and in no time he is adopted peace legislation should aim not mereDR.<br />\nABEL WOLMAN<br />\nhas decided that the first preduction into the hearts of the entire nation. ly at a negative neutrality<br />\nPUBLIC INVITED<br />\nat any<br />\nSTARTS DISCUSSION<br />\nfor this year will be a play in the Everything is going imoothly when cost, but<br />\nrather at an aggressive plan<br />\nsame vein, Boy Meets Girl.<br />\nan actor's agedt discover.<br />\nthe of peace promotion throughout<br />\nDr. Russel Is Frequent Conthe Sanitary Engineering AssociThis light comedy by Bella and two writers have neglected to haw<br />\ntributor To Various ReSamuel Spewack was the most no- their power of attorney for Happy entire world.<br />\nate Recommends Liberal<br />\ntorious success of the 1935 season.<br />\nCollegian Reporter<br />\nligious Journals<br />\nrenewed, and signs the infant tip<br />\nEducation<br />\nBoy Meets Girl is a satirical car- before the boys know what'S coming<br />\nMorningside College •<br />\nProfessor William H. Russel, of<br />\ntoon of the moving picture industry off. •<br />\nBy JOHN P. DODGE<br />\nkeenly observed, truthfully reported<br />\nthe Catholic University of America,<br />\nThe two indulge in several brazen<br />\nThe first Freshman Forum at LevDR. WILLIAM H. RUSSEL<br />\nand expertly transferred•to the stage. schemes, mischief in a hospital and<br />\nWashington, D. C., will open the<br />\nering Hall on Tuesday proved to be a<br />\nThe authors are well equipped to general skulduggery in an effort to<br />\nsecond series of lectures on religion<br />\n\"bull session,\" led by the five alumni<br />\nhandle the type is this particular way regain control of the gold mine, all<br />\nat the Hopkins, sponsored jointly by<br />\nfor they are reporters as well as of which is very enlivening to the<br />\npresent with' the audience of five<br />\nthe National Conference of Jews and<br />\nplaywrights.<br />\naudience.<br />\nfreshmen and four upperclassmen<br />\nThe comedy is based on the mti,cs<br />\nChristians and the University. Dr.<br />\nThroughout the story the, Spewaks Police Commissioner<br />\nOf Bal- (members of the committee) joining<br />\nof two Hollywood script writers un- conduct the usual farcical burlesque<br />\n\"Russel's three lectures, on three sucmore Speaker Informally In. Dr. Abel Wolman called on Mr.<br />\nder contract to the Royal Sti.dios in about Hollywood studios. Through'<br />\ncessive Mondays, beginning NovemGuy Hollyday to start by telling what<br />\nthe cinema city. Privately, the two the practical jokes of the two insane<br />\nAt Latrobe Hall<br />\n. are.funnier<br />\nber 8th, at 8:15 in Latrobe Hall, will Invited By Carnegie Corporchanges he would make in his colthan the plays Which they script writers serve as a way to<br />\n(Continued from Page 1, Col, 21<br />\nation To Study Australian write.<br />\ndeal with the \"Historical Aspects of<br />\nattack with good humour many<br />\nlege life if he could livg it over again.<br />\nCatholicism.\"<br />\nWhile they are reluctantly at- widely known peculiarities of the moRadio System<br />\nArbitration System<br />\nMeditatively stroking a little brown<br />\ntempting to throw' together,any sort tion picture industry. For example,<br />\nThe commissioner described the<br />\nA graduate of Columbia College,<br />\nkitten which came with one of the<br />\nof a script for the studio's cowboy they persist, incessantly that the plot new two-way<br />\n(Continued from Page 1, Col. 4)<br />\nof Iowa, Dr. Russel has his Master's<br />\nradio system which<br />\nfreshmen Guy Hollyday said that he<br />\nstar, a waitress Who is an expectant for Any play is the age old formula;<br />\nis in the process of installation in<br />\nand Doctor's degrees from the Cath- ett is well equipped to make a study<br />\nwould do just the same things as<br />\nbut unwed mother faints in the office \"Boy meets girl, boy loses girl, boy<br />\nall Baltimore radio cars. He deolic University. He is et present In- which may throw some<br />\nlight on the of the producer. She tells of, her gets girl.\"<br />\nwhen he was here; namely; enter into<br />\nseribed<br />\nstructor in Religion at that instituthe<br />\ngiant<br />\ncondition<br />\nmaster switchboard<br />\nand the writers are seized<br />\nOn the basis of my brief experisolutions of American labor problems.<br />\nas many extracurricular activities as<br />\nwith a great idea. They believe they ence with the type of audience be- from • which the movements of the<br />\ntion. He is, the author of Your Religpossible.<br />\nIt appears that the United States is can have a great story<br />\nbuilt<br />\naround<br />\nfore<br />\nwhom<br />\nBarnstorme<br />\nradio<br />\nthe<br />\nion, Bible and Character, Life of<br />\ncars are directed, mentioned<br />\nrs perBacked up by D. H. Johnston, electhe career of the foundling that is form, \"Boy Meets Girl\" should prove<br />\nnow<br />\nattempting<br />\nto<br />\nput<br />\ninto<br />\npractice<br />\nthe auxiliary system which may imJesus, and Christ the Leader. He is<br />\ntrical engineer, Dr. Wolman struck<br />\nsoon to arrive. They immediately put to be a very successfel fail offering.<br />\nwhat<br />\nAustralia has already succeedmediately be put in service in case of<br />\nalso a frequent contributor, to religthe keynote of the discussion by saytrouble with the main system, and ing that<br />\nious journals, and is active -in Cath- ed in doing.<br />\nhe thought it was better to,<br />\nascertained the value of two-way come to college without trying to<br />\nolic Social Organizations.<br />\nProfessor Barnett, a native of<br />\n•<br />\nradio communication in speeding up work for any career. Dr. Wolman recSecos4-1=itrieif<br />\nCambridge, Maryland, earned his A.<br />\nommended a general college educapolice action.<br />\nDr. hunsel's lectures mark the secB. degree it Randolph-Macon College'<br />\ntion in arts and sciences with specond series, in a series of three, nine<br />\nWhen coeds at the University of 'Oh, nuts!'\" .<br />\nStatiatice<br />\n.<br />\nialization beginning only in postin 1891, and received his doctorate VVIashingkon are through renovating<br />\n\"The boys who do all the formulatlectures all together for the first<br />\nCommissioner Lawson stated the graduate work. He<br />\nsaid that the modthe<br />\nmanners<br />\nof<br />\nmasculine<br />\nthe<br />\ncontin-'<br />\nfrom<br />\ning<br />\nour<br />\nOf<br />\nJohns<br />\nplans.\"<br />\nHopkins<br />\nin 1902. Presemester, dealing wan the history of<br />\nfollowing facts: More fatal accidents ern world is so intricate that postgency on the campus, there won't be NEW YORK AT LARGE<br />\ngraduate<br />\nwork is necessary for any<br />\nvarious religiens groups. Later in vious to that, he had bene an inoccur in homes than in automobiles,<br />\na man who will dare to keep a girl<br />\nBy Fred Wittner and Mel Adams<br />\nprofessional work. Wolman Stated<br />\nthe fall, Dr. Cyril C. Richardson, of structor in a North Carolina High , talking on the telephone<br />\nmore than (Associated Colelgiate Press Cor- approximately 20 per cent more. In- that<br />\nthere was more to be gotten from<br />\nthe Union Theological Seminary, will School for a number of years. At five minutes when she should be<br />\ndustries account for just about twice<br />\n• respondents)<br />\ncollege years than mere training for<br />\ndeal with the Protestant Historical Hopkins, he was instructor, associate studying.<br />\nOne of the brightest productions to as many fatalities as motor vehicle one's occupation.<br />\nHe, said that the<br />\nThe<br />\ncoeds are being subtle about• illuminate the floodlights this season a9cidents.<br />\nand associate professor of political<br />\nAspects.<br />\nApproximately 95 per cent arts and allied subjects make life<br />\nthe thing though. \"It Is Done\", new Is George Abboott's production of<br />\nmore<br />\nfull<br />\nand<br />\nThe lectures are open to the stu- economy from 1901 to 1911. In 1911<br />\npleasant<br />\nof<br />\nall<br />\nand that these<br />\ncars'<br />\nfound<br />\nmissing in Balti1937 edition of the campus etiquette \"Angel Island,\" a comedy-mys<br />\ntery<br />\nadvantages could only be gotten durdents and general public.<br />\nhe was appointed a professor, and book, is going to be a part<br />\nmore, are recovered.<br />\nof every written by Bernie Angus. . . the mysing the first years work of college<br />\nfrom that time has specialized in man's library if coed sales-girls have terious elements are insignificant<br />\nCommissioner Lawson completed<br />\n, but<br />\nlife. Mr. McLean '35, agreed that<br />\nanything to say about it.<br />\nAmerican labor probblems.<br />\nthe comic routine following the usual his address with a number of depart- post-gr<br />\naduate work should be taken<br />\nAmong the<br />\nun-Emily<br />\nPost<br />\nan<br />\nf<br />\nAbbott<br />\nformula<br />\nmakes<br />\nfor swelegant mental ancedotes. He told about an by students and that for<br />\nDr. Barnett is a member of the<br />\nthe first<br />\nthings Joe College will have called entertainment. . . Two West<br />\nCoastInebriated gentleman, who was so four years one should try to get a<br />\nAmerican Statistical Association, the<br />\nto his attention is the habit of monop- ers visiting here this wek are Tyrone<br />\nbroad<br />\neducation.<br />\nconfused by the similar blocks Of,<br />\nAmerican Economic Association, and olizing the sorority's only davenport, Power<br />\nAnd Alice Faye, the latter va(Continued from Page 1, Col. 6)<br />\nHeretofore the discussion has cenwere the \"channels through which the the American Association for Labor, breaking blind dates and letting frail cationing from the Hal Kemp show houses in Baltimore that he had to' tered on professional<br />\ntraining, and<br />\nArabic learning flowed into Barbar- Legislation, and has written many coeds open heavy campus doors all for a few weeks. . . Ben Marden's call up the police department for aid Guy Hollyday gave<br />\nthe busineess stuby themselves.<br />\nRiviera is making a drive for the out- in reaching home.<br />\nian Europe\". They lforged the link books in regard to his<br />\ndent's<br />\ncase. He said that business-men<br />\nfield. Among<br />\nPet peeves of coeds at Duquesne of-town trade by staying open<br />\nbetween the learning of the East and them<br />\nall winneed only ET;ordinary four yeartourse<br />\nare: Mediation, investigation, University:<br />\nQuiz Section<br />\nter.. . Success story of the week conthe ignorance of ,the West.\"<br />\nand should take more college work<br />\nand Arbitration in Industrial DisAfter the address the audience<br />\n\"My pet peeve as far- as boys are cerns Vincent Price, star of ''The<br />\nIn a few powerful concluding stateonly if they can afford it. Mr. Stuart<br />\nments, Dr. Finkelstein prophesied putes, State Banking in the United concerned are those who flash a quar- Lady Has a Heart, who first achieved quizzed. the Commissioner on various Smith opposed<br />\nWolman's view by<br />\nter<br />\nand<br />\nexpect<br />\nyour<br />\neyes to glitter\". fame as Price Albert in \"Victoria subjects concerning<br />\nthat \"what is happening before our States, and The Printers. .<br />\nthe police de- stating that one ougra to be able to<br />\n\"The one thing that makes me see Regina\" ... Son of a St. Louis-candy<br />\neyes today in the countries of the<br />\n- partment and police regulations.<br />\nDuring pr. Barnett'a absence, his<br />\nselect<br />\nhis<br />\noccupation<br />\nearly so that he<br />\nMany<br />\nred is the boy who is suffering from bar manufacturer, Price<br />\nworld makes' certain the breakdown course<br />\nwent through<br />\nin corporation finances and in- over-expans<br />\ncontroversial subjects were discussed, can take all courses related to the<br />\nion of the head.<br />\nYale, preferring the tours offered by<br />\nof Western civilization, a world of<br />\nsufbject. He agreed, however, that<br />\nvestments will be taught by Dr. \"Imagine the fellow who goes off the<br />\nGlee Club to the more dogged notably the need for cooperation be- the<br />\nrising darkness,, which .only two<br />\nstudent who comes from high<br />\nforces can resist, Judaism and Christ- George H. Evans, associate professor Into a spiel such as \"Your eyes are work offered by campus dramatics so- tween police in different sections, and school with<br />\na definite end in view<br />\nof political economy at the Hopkins. like stars, your lips like rubies, your cieties. . . now packing them in as the problem cd colored<br />\nianity.\"<br />\npolicemen and and works solely toward that ob•<br />\nteeth like pearls. Oh joy! Oh bliss! one of the more popular<br />\nHe advised that 'the hope of the His remaining courses will not<br />\nmantinee<br />\npolicewomen. Commissioner Lawson jective is unwise. Wolman said that<br />\nbe And all the while the<br />\ngirl is thinking, idols of the day. . . the stock market<br />\nworld for a vigorous intellectual and given<br />\nthis academic year.<br />\nHe<br />\nstated that he believed that colored such a student is deplorable.<br />\nartistic growth for the goodwill of<br />\nwas backed up by Bill Harrunaker<br />\npolicemen and women would be much<br />\nmen lies in the houses of worship in<br />\nwho said that the man with a single<br />\nmore valuable in colored districts aim<br />\nreligion. What the world needs is<br />\nwhich he has always worked for<br />\nsome approach to God to bring back<br />\nthan white officers.<br />\nends up as a \"no good\" man, despite<br />\nthe spirit of love which is fast losSunday morning at 1 a. in. freshCommissioner Lamson announced his knowledge of his specialty. He<br />\ning ground.\"<br />\n(Continued from Page 1, Col. 1)<br />\nmen being'rushed by affiliates of the<br />\nthat the police department would be was sorry for such an inbred bookDr. Louis Finkelstein, at present<br />\nis a sincere interest in photography,<br />\nworm.<br />\nTo<br />\nSpeak<br />\nIn<br />\nopened to the public ip the near fuRemsen<br />\nHall Interfraternity Board will retire exProfessor of Theology and Provost<br />\nTo Group To-Night<br />\nhausted by as strenuous an ordeal of and an enthusiastic - desire to meet ture, and invited his audience to,see<br />\nthe University and the Baltimore<br />\nAt 7.30 P. M.<br />\nwith others equally interested. Those<br />\nActivity as isgesl<br />\nONLY DOWN TOWN STAGE SHOW<br />\nwas the first of the lecturers to ap.!:.een.n.a_ the Hopthe place.<br />\npear under the joint sponsorship of<br />\nkins campus. Hopeful freshmen and who cross their fingers and snap the<br />\nDr. Alan F. Guttr_nacher, associate<br />\nthe University and the Baltimoree<br />\nshutter<br />\nare<br />\njust<br />\nas<br />\nwelcome<br />\nas those<br />\nlikewise hopeful fraternity men will<br />\nRound Table of the National Confer- in Obstetrics at the Johns Hopkins<br />\nwho can turn out salon prints. A<br />\nI Medical School, will be the guest not greet each other in any way,<br />\nence of Jews and Christians.<br />\nON SCREEN<br />\ncourse<br />\ninstruction<br />\nof<br />\nfor those who<br />\nspeaker at the regular meeting of the shape, or form until 3 p. m., when<br />\nIRENE DUNNE<br />\nhave never had the extra thrill of debids<br />\nwill<br />\npresented.<br />\nbe<br />\nJohns Hopkins Science Club, tonight<br />\nCARY GRANT<br />\n. Tonight the last of the Open House veloping and printing their own picat 7:30 p.m*. in Remsen.301.<br />\nIN<br />\nPAUL AT 33RD STREET<br />\nparties will be held by Delta Phi-and tures is being arranged.<br />\nLecturing at the University last<br />\nMembership cards will be ex- Prescripti<br />\n(Continued from Pag 1, Col. 4)-_,<br />\nKappa<br />\nAlpha<br />\nwho<br />\nare entertaining<br />\nons—School Supplies<br />\nSpring under the sponsorship of the<br />\npartment, and the new athletic polON STAGE<br />\nrushees at luncheon today. Members changed for cash in the very near<br />\n.Sandwiches<br />\nAMERICA'S GREATEST<br />\nicy of the University. Articles of American Student Union, Dr. Guttfuture,<br />\nand<br />\nit<br />\nis<br />\nhoped<br />\nthat<br />\nanyone<br />\nof each fraternity will not divulge<br />\nAQUATIC SPECTACLE!<br />\ngeneril interest are the establish- macher became well known to the<br />\ntheir plans, but they expect to stimu- who was unable to attend the meetLOTTIB MAYER'S<br />\nUnexcelled Fountain Service<br />\nment of the twelve thousand volume student body. He will speak on some<br />\nlate jaded first yearmen to their way ing or who wishes to join will cone.; ,<br />\nDisappearing<br />\nMackall. Library;; the death of Dr. particular phase of<br />\nmunicate<br />\nimmediately<br />\nwith one of<br />\nhis field of re- of thipcing<br />\nWater Ballet<br />\n'<br />\n,<br />\n°'-ank Morley, professiar,-..,lritus of<br />\n'jhe<br />\no<br />\nsearch.<br />\n-0tfliA,<br />\nTomorrow freshmen we Visit<br />\nlarsaTzansknf$1:5:43:43rOASIII:a.i44<br />\n12 HOLLYWOOD DANCING<br />\nmathematias at the Hopkins; the<br />\nhouses<br />\nAND<br />\nof<br />\nDIVING BEAUTIES<br />\ntheir<br />\nchoice<br />\nor those they<br />\nLater in the season, Dr. James<br />\nchange in editorship of the Hopkins<br />\nwent national .last fall.<br />\nChristmas Seals!<br />\nI are considering \"No entertaining<br />\nPLUS—OTHER BIG ACTS<br />\nAlumni Magazine; and the naming Franck, Nobel Prize winner, and ProThe Betas, Phi Psis, S. P. E Kap- ,<br />\nt<br />\noutside the house\" will be tolerated in<br />\nof Dr. Charles S. Singleton as asso- fessor of Physics; Dr. John C. Hobpa Sigs, and IS. P. Es held parties,<br />\nthese last stages of the game,\" a<br />\nwhich are now pleasant memories to l4<br />\nciate in the Department of Romance bard, Head of the. Undergradu<br />\nate prominent member of the Interfrag<br />\nfuture Modern Greks.<br />\nLanguages.<br />\nti,,ft?...„,<br />\nW<br />\nPhysics Department, and Dr. Walter ternity Board asserted.<br />\nSo far the•rushing season has been<br />\nThe article on scholarships anKIBLER'S<br />\nAlpha Delta treated their fresh.<br />\nDandy, brain specialist at the HopARA —<br />\nfree from major violations, the D. W<br />\nnounces the establishment of five<br />\n-men to luncheon, a banquet at oix p.<br />\nJewelers and Opticians<br />\nnew scholarships--three of them in kins Medical School, will be speakers<br />\nm. and a formal dance at the house U.'s and the Alpha Delta being pen- ili ,<br />\nBey and Use Them<br />\nParker Pens and Pencils<br />\nthe Medical School—amounting to for the group.<br />\nalined for minor infractions.<br />\nof Page Edmunds, '39. AccOrding<br />\ntSmmrsacYsairssEssmEzaMEMrszmeI<br />\ng<br />\nalmost $70,000. Besides the new<br />\nThe 'Science Club is open to all , reports, Everad Lamed, '41, a<br />\nJewelry and Watches<br />\nDelta<br />\nscholarships, two scholarships alEyes Examined<br />\nundergraduate students interested in Phi legacy, was not equal to leatimg<br />\nready endowed have been increased<br />\nLens Repaired<br />\nScience. It is not necessary to have a the Big Apple more than three times.<br />\nby their donors. The Gazette has<br />\nAlpha Chi Rho entertained at a<br />\npublished the only statistical chart special knowledge of science, or to<br />\nluncheon and dance at their house<br />\nand study of new scholarships which be majoring in Science, to be a mem3222 Greenmount Ave. !<br />\nlast night They were enteetaming<br />\nhas been made.<br />\nber.<br />\nfreshmen for the first time since they<br />\n<br />\nSeries Of Addresses To Deal<br />\nWith The \"History<br />\nOf Catholicism.\"<br />\n<br />\n•,<br />\n<br />\n3<br />\n1<br />\n<br />\nLAWSON EMPHASIZES<br />\nNEED OF KNOWLEDGE 1<br />\n<br />\nDR. G. E. BARN Eli<br />\nTAKES YEAR'S LEAVE<br />\n<br />\nII<br />\n<br />\nSi<br />\n<br />\nSo<br />\nCh<br />\n<br />\nCAMPUS CAVORTINGS<br />\n<br />\nam<br />\n<br />\noff<br />\n<br />\ndal<br />\nof<br />\n<br />\nten<br />\n<br />\n1<br />\n<br />\nsec<br />\n<br />\nthe<br />\n<br />\nstu<br />\n<br />\neat<br />\n<br />\nthe<br />\n<br />\nDR LOUIS FINKELSTEIN<br />\nCLOSES LECTURE SERIES<br />\n<br />\nOR ALAN GUTTMACHER<br />\nSCIENSE CLUB SPEAKER<br />\n<br />\nvid<br />\nalu<br />\nId<br />\n<br />\ned :<br />\n<br />\ni<br />\nlini<br />\n<br />\nFrats' Rushing Ends<br />\nCamera Club Elects<br />\nSunday At 1 A. M.<br />\nOfficers_For Season<br />\n<br />\nBIREI,EY'S<br />\n<br />\nHIPPODROME--NOW<br />\n<br />\nPHARMACY<br />\n<br />\nHopkins Gazette<br />\nPublishes First Issue<br />\n<br />\nthi<br />\ntra<br />\n<br />\n1ST.<br />\n<br />\nThe Awful Truth<br />\n<br />\n„. .„<br />\nr*<br />\n<br />\nPatronize Our Advertisers<br />\n<br />\ne<br />\n<br />\nnot<br />\ngra<br />\n'38,<br />\niel<br />\nLai<br />\nton<br />\n•<br />\nthe<br />\nsta<br />\npre<br />\nstu<br />\nligi<br />\npar<br />\nan,<br />\nval<br />\n<br />\nCFI<br />\nthe<br />\ntw<br />\nspl<br />\n{..11<br />\nthe<br />\non<br />\nTh<br />\npul<br />\nAs<br />\nde;<br />\nde<br />\n<br />\nwil<br />\n<br />\n\f", "format": "basic_html", "processed": "•<br /><br />\nJUttth i*Ipking Nruigiirttrri<br /><br />\nVOTE IN THE<br />\n\"NEWS-LETTER\" POLL<br />\nTODAY<br /><br />\nZ 275<br />\nHOMEWOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br /><br />\nVOL. XLII, No. 8<br /><br />\nCOURTRIGHT AND<br />\nMcGOVERN LEAD<br />\nPRIMARY VOTING<br /><br />\nBARNSTORM ERS I<br />\nThe schedule for tryouts for the<br />\nBarnstormers' recently chosen play,<br />\n\"Boy Meets Girl\", by Samuel and<br />\nBella Spewak, has been announced by<br />\nLewis Swyer, president. The following times, for today and the first' pact<br />\nof next week, have been set aside for<br />\nthe tryouts:<br />\nFriday 2 to 5 p. m.<br />\nSunday 2.30 p.m.<br />\nMondlii. 7.30 p.m.<br />\nTuesday 7.30 p.m.<br />\nEveryone is urged to be out for the<br />\ntryouts which will be held at the<br />\nBarn. Paul Henrichs, '29, will direct.<br /><br />\nPRICE 5 CENT/<br /><br />\nAn Open Letter To The Council<br /><br />\nEDITORIAL<br />\n-Before the vote is made on your<br />\nchoice of the three questions concerning the athletic Policy, it can be<br />\nreadily seen that more detailed explanations of the three are needed.<br />\nIn regard to (1):<br />\nDo yuu favor the present athleic<br />\npolicy?<br />\nThis means, briefly, you favor:<br />\n1 All athletics on a pure amateur<br />\nstatus.<br />\n2. Extensive intra-mural program.<br />\n3. Steadily-increasing number and<br />\nparticipation in inter-collegiate<br />\n(Continued on Page 2, Col. 1)<br /><br />\nChinese Red Cross Committee Makes Appeal To<br />\nHopkins Student Body<br /><br />\nTO TEST HOPKINS<br />\nATHLETIC PLAN<br />\nIN POLL TODAY<br /><br />\nHankow, China, October 7, 1937<br />\nTo the President of the Student Council:<br />\nI venture to hope that this appeal which I ant sending 1.6 you across the<br />\nPacific from distant China will find in you a responsive note. I am a college<br />\nNews-Letter Sponsors Votes<br />\nMilton Rudo, R. G. Fleagle<br />\nstudent, and in common with all students of new generations, I have enterOn \"De-emphasis Policy\"<br />\nEmerge Victorious In<br />\ntained bright hopes for the future. But now an evil spirit has come to mar<br />\nthe pleasant outlook of students in China and to imperil world civilization.<br />\nSecretary Prelims<br />\nOf Administration<br />\nOur civilization should bridge oceans and , continents, bring human beings<br />\ninto closer-contact with one another, promote better understanding between<br />\nBALLOTS PASSED OUT<br />\nNO CONTEST FOR<br />\nthem, and refine human relationships.<br />\nVICE-PRESIDENT<br />\nWITH TODAY'S ISSUE<br />\nBut today in China scores of bombing planes daily fly over our country,<br />\nleaving death and destruction in their wake. Thousands of non-combatants<br />\n- --in all our big cities are being killed and wounded and in the stricken districts<br />\nStudents Will Judge From<br />\nLeroy Applefeld, Douglas<br />\nhorrible sights of mangled bodies and heartrending grief are to be witnessed.<br />\nSpencer Win Out<br />\nThree Statements of<br />\nThe district of Wukon where I live has already been bombed and will inevitably be the object of future bombings. Winter is approaching. Many children<br />\nFor Treasurer<br />\nPolicy<br />\nhave been made motherless and hundreds have been rendered homeless. Our<br />\nIn each copy of today's NEWSThe Sophomore Class, voting in<br />\ncity is the center of.two hundred millions and it is to us that they look for<br />\nyesterday's primaries, elected a split<br />\nhelp.<br />\nLE11112, there will be found the NewsPolice Commissioner of BalWill Seek Second LETTER ballot on the<br />\nI, now, standing on the footing of a fellow human being and student, Team<br />\nticket to go to the polls in the finals<br />\nHopkins athappeal to the generosity of the students of your college over the sea for help<br />\ntimore Speaks Informally<br />\nStraight Victory Of Sea- letic policy. The poll, originally<br />\nto be head today. Frank McGovern<br />\nin this, our hour of need.<br />\nAt Latrobe Hall<br />\nson<br />\nand Benjamin Courtright received<br />\nTomorrow<br />\nscheduled for Tuesday, November 2,<br />\nI am sending you the appeal of the Red Cross Committse showing the<br />\nis sponsored by this paper for the<br />\nthe call of their second-year classway in which you can help us. I wish to assure your student's that we shall be<br />\nDescribes<br />\ncandidates<br />\nUnique Probation deeply grateful for any assistance that they may be able to give to the Kerstetter Again Key Man purpose of finding out what the Hopmates over the other two<br />\nIn<br />\nRunning<br />\nJay's<br />\nRed Cross.<br />\nkin's student body, and faculty think<br />\nfor president, John Dodge and Ted<br />\nSchool For Violators Of<br />\nof the new athletic program.<br />\nSincerely yours,<br />\nFrey. Courtright, who was secretary<br />\nAttack • ..<br />\nTraffic Regulations<br />\nEach ballot will have 3 questions<br />\n(Signed)<br />\nTeh-wei<br />\nLin<br />\nof his class last year, and McGovern,<br />\nP. S.—We students here have all agreed on the above letter, are busy<br />\nTomorrow the ' Hopk‘s football which are to be answered either<br />\nEmphasizing the necessity of eda member of the freshman banquet<br />\ntoday writing copies of it to the leading schools in America anu Britain.<br />\nsquad will journey to Swarthmore affirmatively or negatively. The quescommittee, will battle it out in the ucation in dealing with modern crimI hope you will write and tell me what you have been able to do about it.<br />\ntions are as follows: \"Do you favor<br />\ninal methods, and in preventing and<br />\nCollege where it will attempt to<br />\nelections today.<br />\nthe present athletic policy?\"; Do<br />\nGriffith John School<br />\navoiding motor accidents, William<br />\ngarner its second consecutive victory. you prefer<br />\nHankow, China<br />\nAs in the Junior _class primaries<br />\nLing Chao Ching<br />\nlight subsidization, such<br />\nP. Lawson, Police Commissioner of<br />\nThe Blue team did not play last Sat- as limited scholarships for<br />\nathletes<br />\nof last week, there was no contest Baltimore informally addressed a<br />\nurday and thus, should he in perfect and a coach for football only?\", and<br />\nfor the office of sophomore vice- large group of students in Latrobe<br />\n\"Do<br />\nyou<br />\nprefer heavy subsidization,<br />\nphysical shape for the camtest.<br />\npresident. Richard Green, as a fresh- Hall, Thursday at 11:30.<br />\nwith a highly paid coach and liberal<br />\nLast year the Garnets 'downed the<br />\nCominissioner Lawson is the first<br />\nman, a member of the football squad<br />\nscholarships?\" A. ballot box for all<br />\nJays despite a desperate'second half<br />\nspeaker to be presented by the Stuand at present a member of the Coballots will be found in the post<br />\nrally which brought the ipsers within<br />\ndent Council under the non-compuloffice.<br />\ntillion Board, and Jefferson Hamilton, sory assembly plan this<br />\nrange<br />\nof victory. Several veterans<br />\nyear. He was<br />\nNovember<br />\n13 Set As Definite Invited By Carnegie Corpor- from last year are the key men of the Since the plan was first applied at<br />\nmember of the YMCA Cabinet, were Introduced to the students by William<br />\nthe<br />\nCollege game almost<br />\nTime For<br />\nthe only candidates nominated for B. Kempton, president of the Stuation To Study Australian Pennsylvania institution's attack. threeWashington<br />\nweeks ago, many college papers<br />\nHeading this list is Jakie, fleet-footed<br />\ndent Council,<br />\nthe primaries.<br />\nFestivities<br />\nArbitration System<br />\nnotably those at the University of<br />\nsignal caller who also diRea the tossProbation School<br />\n_<br />\n.<br />\nRudo vs. Fleagle<br />\nChicago and Princeton have coming. Oberle, at the rigttt half-back<br />\nBeginning by expressing his delight<br />\nmented favorably on the plan. AlOf four candidates for secretary,<br />\nat addressing Hopkins men, Com- Profits From Dance To Pur- Left Wednesday For San position shares the ball,Soting duties<br />\nthough it is too early to tell whether<br />\nMilton Rudo and R. G. Fleagle missioner Lawson went on to describe<br />\nwith Jakie. Kraterinulln,<br />\nr, another<br />\nchase Furniture For<br />\nFrancisco; Embarks For<br />\nor not the plan will succeed, it is<br />\nveteran performer, hale,<br />\nemerged victorious in the balloting a few of his innovations in the police<br />\nved himevident that the plan may have a<br />\nCommons Room<br />\nAustralia Nov. 9<br />\nself to be an adept p<br />\nreceiver at<br />\nover their other two opponents, Alan set-up of balti'.00re. He described his<br />\nfaf-reachtng<br />\neffect; and whether or<br />\nhis left end position. *alTington at<br />\nD. Hecht and Robert D. Vernon. Probation School for violators of<br />\nCommencing this year's dormitory<br />\nnot it is liked, being such an innoDr. George E. Barnett, Professor the other<br />\nflank position is also a lettraffic<br />\nrules.<br />\nViolators<br />\nare<br />\ncompelled<br />\nRudo is a member of the football<br />\nvation in college athletics, it is<br />\nsocial life with an informal dance, the of Statistics at the Hopkins left on ter winner.<br />\nteam and Fleagle a member of the. to attend for a period of about 90<br />\nbeing discussed throughout the East,.<br />\nentree representatives of Alumni Wednesday for San Francisco. From<br />\nSpillman Might Start<br />\nYMCA Cabinet and of the baseball days, during which they are acquaintboth In college circles and newspaper<br />\nThe Hopkins team will be led by<br />\ned with traffic regulations, taught Memorial Hall have begun to solicit there he will embark on November<br />\nteam.<br />\ncircles. Columnists of the calibre of<br />\nLeroy Applefeld, treasurer of his careful driving, and shown motion tickets to the Annual Turkey Trot to 9 for Australia, where he will spend Captain Tom Ellis, 205-pound dread- \"Daniel\" in the N. Y. World-Telenaught tackle. Oscar Kerstetter,<br />\nclass in his freshman year, and Doug- pictures of accidents and methods of be held on Saturday evening, Novem- the year in doing research work<br />\ngram have thought it worthy of an<br />\nwhose 96-yard run back of a kick off<br />\nlas Spencer, member of the Musical preventing accidents.<br />\nber 13 in the Commons Room from 9<br />\nentire column (News-LETTER, OctStudy Industrial Courts<br />\npovided the winning touchdown in the<br />\nWhen violators are graduated, they<br />\nClub, won out for the post of treasurober 22). The Associated Press and<br />\nto 1 o'clock.<br />\nProfessor Barnett was invited by Haverford<br />\ngame, will be again the<br />\ner for the Sophomore class. Martin are considered as having paid their<br />\nDucats for this affair are selling at the Carnegie Corporation of New key man in the Blues running attack. the N. Y. Times have also carried<br />\nJ. Breslau was the third' and unsuc- penalty. Commissioner Lawson statstories on it.<br />\nYork<br />\nstudy<br />\nto<br />\nmake<br />\nof<br />\nthe<br />\na<br />\nAus$1.10<br />\ndrag<br />\nand $1.50 stag, and may<br />\nSpillman, a hard running back, who<br />\ncessful candidate for the position. ed, \"Most accidents are caused by lack<br />\nRegardless of haw the plan will<br />\nbe purchased from any entree rep- tralian system of industrial arbi- played well in the Haverford tilt will<br />\nJack Neely, Richard Brenner, and of mentality and dullness of the drivturn out, and what outside sources<br />\nresentative. ,The profit, whatever it tration courts as practised both in start again et one of the half-back<br />\nJohn Enders were the three candi- er. Most accidents occur with people<br />\nthink,<br />\nit is necessary for the general<br />\nmay be, will go toward the purchas- Australia and New Zealand. This posts.<br />\ndates for sergeant-at-arms. Enders, in the upper-age brackets behind the<br />\nHopkins campus attitude to become<br />\ning of furniture for the Commons system is of great interest to all, for l John 'Royster, pillar<br />\nof strength, known. The I4EWS-LETTER cannot WO<br />\na member of the lacrosse, wrestling, wheel.\"<br />\naccording to Dr. Barnett \"the Aus- will<br />\nMOM.<br />\nCriminals In Cars<br />\nagain hold down the center posi- strongly urge everyone<br />\nand soccer squads, and Neely were<br />\nwho has reArthur Katz, head of the dormitory tralians have developed their system tion with his more than<br />\n\"In this day and age of the auto200 pounds ceived a ballot to consider it carethe victors in the primary race.<br />\nsocial committee says, \"I hope that (wage regulation) so that the least of beef. He will he flanked by<br />\nmobile<br />\nwhen<br />\na<br />\ncriminal<br />\ncan<br />\nmake<br />\na<br />\nBill, fully and participate in the voting.<br />\nIt was noted by close observers of<br />\nnumber<br />\noccur.\"<br />\nof<br />\nstrikes<br />\nthis dance will be a fitting prelude<br />\nwho blocked the two place-kicks for<br />\nthe campus political scene that the get-away quickly and easily, we<br />\nIn the past, the News-Lerma polls<br />\nDuring the last thirty or forty extra points<br />\nto the future dormitory entertainin the Haverford tilt, and have been fairly successful. The<br />\nresults of the voting indicated a must have- quick-witted men specialstuZealand<br />\nand<br />\nAustralia<br />\nNew<br />\nyears<br />\nments.<br />\ncommittee's<br />\nIt<br />\nis<br />\nthe<br />\naim<br />\nto<br />\nly<br />\neducated to cope with their<br />\nDay, if he recovers from an injury. dent body responded<br />\nreaction to a one-machine slate of<br />\nvery well to the<br />\nprovide the residents with as much have originated and developed a new Ellis and Moore will hold down<br />\nthe polls on the presidential election of<br />\ncandidates for the finals in the Sopho- methods. The police , department<br />\ntype of arbitration in state courts. tackle posts<br />\nneeds men of high education and social life as they desire.\"<br />\nand Vickers and Halbert 1936, and on the Supreme Court.<br />\nmore class elections.<br />\nThe dormitory residents and their Any labor dispute may be referred to will play the wing positions.<br />\ntraining, for when a man may comMen likeare<br />\nprovided<br />\nworkers<br />\ncourts,<br />\nthe<br />\ncomely<br />\nthe<br />\ncompanions<br />\nwill<br />\ndance<br />\nto<br />\nthe<br />\nmit a crime and be outside the Baltily to see action in the backfield are<br />\nmore city limits where we have no tunes of \"The Grenadiers\", a seven unionized and thus can present their Kerstetter, Spillman, Murray, Buck, Lilt.<br />\njurisdiction in 5 minutes, it takes piece band. Invitations will be ex- case in court.<br />\nWard and Traggis.<br />\nConsidered a leading authority on<br />\nquick thinking and quick action to tended to the honorary fellows of the<br />\nSwarthmore Strong<br />\nStates,<br />\ndormitory.<br />\nUnited<br />\nlabor<br />\nDr.<br />\nin<br />\nBarnthe<br />\nRefreshments<br />\nbe<br />\nwill<br />\ncapture him.\"<br />\nThe Swarthmore combine has lost<br />\nAt an organization meeting of the<br />\n(Continued on Page 4, Col. 2)<br />\nHe went on to praise Edgar served.<br />\nseveral contests this season, but all, Dr. Louis Finkelstein, prominent<br />\nCamera Club at the Johns Hopkins<br />\n_<br />\nHoover's Washington set-up, and<br />\nby<br />\nclose scores and to formidable op- i Jewish scholar and Rabbi delivered<br />\nUniversity, hell! Thursday morning,<br />\nspoke about the highly specialized<br />\nponents, and should provide the Jaya , the third and last of hip series of,,<br />\nNovember 4, Eugene Waltman, '40,<br />\ncourses in traffic being presented by<br />\ndefense with a tough afternoon, and three lectures on \"The History of<br />\nWM elected president of the organizathe University of Maryland, and<br />\nthe Blue offense will have to func- Judaism\", Monday, November 1, at<br />\ntion for the coming year. Other pition smoothly in order to get results. Latrobe Hall at 8:15 p.m.<br />\nficers elected were .Phil Peril, '39, Northwestern University.<br />\nIn his lectures, Dr. Finkelstein has<br />\n(Continued on Page 4, Col. 5)<br />\nvice-president, and Miss Sally Freedealt with the history of Judaism,<br />\nman, graduate student in biology,<br />\nThis year's first issue of the Johns as large a number of persons as posespecially with the development of<br />\nsecretary-treasurer.<br />\nJewish beliefs in their historical asHopkins University Gazette, a per- sible with the current 'events at the<br />\nAmong those present at the meetHopkins, the staff has built up the<br />\npects. He had previously traced the<br />\niodical for the alumni and friends<br />\ning were representatives of the Facullargest circulation of any University<br />\n\"A full program has been arranged development from \"the group of noThe first graduate dance of the of the Hopkins, was published and publication. The circulation at presty and Staff, and the graduate and<br />\nmads<br />\nwho worshipped at Mt. &amp;Mai,<br />\nthis year by the Tudor and Stuart<br />\nundergraduate schools.<br />\ncollege term will be held next Fri- distributed this week. This is the ent is almost twenty-one thousand.<br />\nthirty or forty centuries ago\" to the<br />\nClub\" announced Dr. Heffner, presIt was unanimously agreed that<br />\nthird<br />\nissue<br />\nof<br />\nThere<br />\neditorials<br />\nthe<br />\nGazette,<br />\nare<br />\nGazette,<br />\nin<br />\nno<br />\nthe<br />\npublicaday evening at 9 o'clock in Levering<br />\n\"Pharasees or the Temple group, the<br />\na regular membership fee of $3.00 a<br />\ntion having begun in February of and the news articles are limited to ident of the literary society. In ad- first group in history to hold a scienHall. Norman Gardner and his Oryear should be charged, and an adthis year, and continued in a pre reports on official policy of the Uni- dition to the annual spring lecture, tific approach to the truth.\"<br />\nditional $2.00 for the use of the dark- chestra have been obtained for the Commencement Day issue. The !Pur- versity, enrollment figures, and other which will be given<br />\nHe divided Judasim into three perthis year by Dr.<br />\naffatarat,<br />\n7:.:tets are being sold at pose of the tri-annualWa....7_ ..on current events. aaatr__<br />\nrooms and equipDat<br />\nKitridge of the English departmertt'ibus of development, the \"Pr&amp;pric,i,<br />\nNo definite program of club ac- $1.50 stag or drag by graduate stu- is, according to P. Stewart Macaulay,<br />\nThe current issue of the Gazette<br />\n'Period of Analysis\",<br />\ntivities has as yet been arranged. dents or the committe. Chaperones at present one of the editorial staff's includes ten articles on happenings of Harvard University, a series of Period\"' the period<br />\nand the final<br />\ndiscussed in his<br />\nRegular meetings wil be held on Fri- will be announced next week.<br />\nheads, \"to present articles of gen- at the Hopkins. The style is inten- smokers once a month will feature uniph<br />\nlast leo<br />\nPeriod<br />\ner<br />\ncftus<br />\nre<br />\ne. thership<br />\nof the Triday evenings (the place yet to be<br />\neral current interest to the Hopkins tionally informal, according to P. such speakers as Mr. Spenser of the<br />\ndecided upon), at least twice a month.<br />\nto the alumni and friends of the uni- Stewart Macaulay, and there is no<br />\naurenceville School, Mr. Hoyt HodIn his last lecture.L Dr. Finkelstein<br />\nLectures On Syphilis<br />\nAt some of these meetings there will<br />\nversity.\" The small magazine is pub- definite organization to the staff. En- son of<br />\nPrinceton and Professor showed how the scholars through an<br />\n---- —<br />\nbe lectures given by members of the<br />\nThe U. of M. Medical Forum, lished three times a year—about a rollment and scholar,hia statistics, Jones of William and Mary. On No..' open minded and \"thoroughly scienFaculty and by authorities on varimonth after classes start, just before ! and an article on the ..reduct.on of<br />\ntific approach\" to truth and to th..<br />\nChapter of the Ass. of Medical<br />\nous fields of photography from outCommemoration Day in February, the deficit make up an important part ! vember 23, the club will give a tea study of how to live, laid the foundstudents will hear \"A Symposium<br />\nside. Other meeting's will be devoted<br />\nin honor of Countess Chambrun, who ations of modern civilization. He ext<br />\nand<br />\nadministrajust<br />\nbefore<br />\nthe<br />\nCommencement<br />\nperiodical.<br />\nfor<br />\nof<br />\nAs<br />\nDay<br />\non Syphilis\" at their meeting Frito informal discussions, print critiin June. The purpose of publishing tion policies, the Gazette contains will address the English conference.' plained that Judaism was a \"system<br />\nday, November 5 at Gordon Wilson<br />\ncism, etc. There will be several comthe periodical at these three times articles on the development of the,! The officers of the club,<br />\nHall, 8:15 p. m. The speaker will<br />\nbesides of learning\" based on the will of God<br />\npetitions and exhibits held during !<br />\nis<br />\nto acquaint the alumni of, and Sanitary Engineering division of the\\-be J. Earle Moore, M.D., of the<br />\nsiD.<br />\nr Heffner, are Dr. Boggs, vice- in regard to the ways of life.<br />\nthe year.<br />\nothers<br />\nHopkins<br />\nDepartment<br />\ninterested<br />\nthe<br />\nby<br />\nEngineering<br />\nin,<br />\nDr.<br />\nCivil<br />\nAfter the ninth century great<br />\n,<br />\n1 J. H. U. Medical School, and Harry<br />\nThe club is open to any member of<br />\nwith the facts connected with the Abel Wolman, the revision of the president; Truehart Brown, score- schools of rabbinical learning preM. Robinson, M.D., of the U. of<br />\nthe University. The only prerequisite !<br />\n'T. served the culture of the East and<br />\nbeginning of the school and plans curriculum of the psychology De=1-4rY, Dr. French, curator; and<br />\nMaryland Medical School.<br />\n(Continued on Page 4, Col. 4) 1<br />\nfor the two days named. To acquaint<br />\n(Continued on Page 4, Col. 1) ! Francis Jones, librarian.<br />\n. (Continued on Page 4, Col. 1)<br /><br />\nLAWSON EMPHASIZES<br />\nNEED OF KNOWLEDGE<br /><br />\nBLUE JAY ELEVEN<br />\nMEETS SWARTHME<br /><br />\nDorm To Hold Dr. G. Barnett<br />\nTurkey Trot On Year Leave<br /><br />\nCAMERA CLUB ELECTS<br />\nOFFICERS FOR SEASON<br /><br />\nCLOSES LECTURE SERIES<br /><br />\nHopkins Gazette Publishes First<br />\nAlssue Of Thrice-AnnualPericdical<br /><br />\nGraduate Students<br />\nCommence Dances<br /><br />\nTudor And Stuart<br />\nTo Hear Speakers<br /><br />\n2<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br /><br />\nff!\"_<br /><br />\nCooperation Needed<br /><br />\nZ5be jolinz ii)ophitt<br /><br />\nPetu5<br /><br />\nognized campus activity, it receives an annual allotment from the S.A.C. But -for the money which forms<br /><br />\netter<br />\nFounded 1897<br />\n$200<br /><br />\nSubscription per year<br />\nBy Mai<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nRemsen Hall, Postoffiec, John Hopkins University.<br />\nEntereci as second class matter December 3, 1909, at the postoffice<br />\nin Baltimore Md.,. under the Act of Congress, November 3, /879.<br />\nPublished semi-weekly front October to Jane, except during examination and college holiday periods by undergraduates of the Jobe. Hopkins<br />\nUniversity,<br /><br />\nAnd let the student body not believe that the cost of<br />\nadvertising is prohibitive, leading to the refusal of these<br /><br />\nCollest5iate West<br />\nPPP 4* NTISD<br /><br />\n1.011<br /><br />\nmerchants to advertise. Let them not belieye that it is<br />\n— I the monetary consideration involved in this compart.vely trifling sum, which, while but a drop *in the<br /><br />\nNAT.06.1AL •OVIIRTISONO O./<br /><br />\nN ,tinnalAdvertisingService,Inc.<br /><br />\nbucket to them means so much to us.—This consideration is not what leads to their refusalb to business staff<br /><br />\ncoiker Publisturs Heteeeeetative<br />\n1MADIAQI4 AV.:<br />\n42,<br />\nNEW YORK. N. Y<br />\nBOSION - LOS 0.11OltSU • S•X FRANCIS,<br /><br />\nLt...0 •<br /><br />\nMEMBER<br /><br />\n1938<br /><br />\nCherchez la Femme.<br /><br />\nBrand New ...Play..<br /><br />\napproaches. Rather it is their cock-sure, over-smug,<br />\nalmost.'gloating faith in the need that Hopkins men have<br />\nfor -them.<br /><br />\nStraight from Manhattan comes<br />\nthe news that Baltimore audiences<br />\nwill be the first to receive another<br />\nnew play this winter. Brooks Atkinson, famous New York Times critic<br />\nwho has given some of the best jeers<br />\nof his life to the theater, writes that<br />\nthe as yet untitled Ryskind—Edward<br />\nChilds *Carpenter comedy will be<br />\npresented here on December.6.<br />\nMr. Ryskind is out on the West<br />\nCoast casting for the show and it<br />\nlooks now as though Doug Fairbanks<br />\nJr., and Madge Evans will take the<br />\njuvenile leads.<br /><br />\n... Program<br /><br />\nsoft shoe dance without shoes in the<br />\ncorner of Broadway and Stooler<br />\nAlpha Chi Rho's big apple Brawl<br />\nStreets last week. When questioned<br />\nnecessitated reinforcing the living<br />\nabout the exploit, Ernie, clever kid,<br />\nroom floor. . . Wanted: fiften freshblamed it on a pair of tight shoes.<br />\nmen, smart and smooth, to go Kappa<br />\nHowbeit, we think that the stuff was<br />\nThat's what Bill Schmied<br />\nAlph.<br />\nmore potent than shoe leather.<br />\nwants, but then again, who doesn't .<br />\nThe Kappa Sigs got a dandy break<br />\n. . Bucky Sellman, before the interwhen a local alumnus forked over<br />\nfraternity board for violating rushfifty bucks at their recent house<br />\nrules: \"I'm innocent, jedge, innocent\"<br />\nparty .. . Many a maid will be dis. . . D. U. entertained its potential<br />\nillusioned when she trots over the<br />\npledges at a dance held at the BaP1<br />\nD. U. 'house to see their etchings.<br />\ntimore Country Club t'other night.'<br />\nThose guys ackshully got etchino<br />\nForemost on the evening's program<br />\nand they'll show them to you, too.<br />\nwas a conuvial cocktail party Of bro. . . Pi Lambda Phi announces the<br />\nther Matheson.<br />\nelection of Perry Edelstein as Rex.<br />\nPhi Alph's slug-feast with the A. Perry succeeds Bert Margolis who<br />\nD's on Tuesday ended with a tri- leaves school tomorrow. Bob<br />\nKays is<br />\numph for the heavyweights; but new archon ... Phi Ep<br />\nwelcomed the<br />\nKempton claims a moral victory. Be return of Ex 'Gland Mogul<br />\nCastelle<br />\ntook a swing at Tubby Pollack and who led his brethren<br />\nagainst their<br />\nlives to talk about it.<br />\nformidable football foes, Thursday.<br />\nPhi Beta. Delta celebrated HallowStanley Morton Finkle's kid brothe'en with skeletons, cornstalks and er Coleman, went Eta Beta Tau at<br />\nfarmers at their house. Tonight the Nawth Ca'lina.<br />\nladdiebucks invade Lutherville for the<br />\n.5. Murray says he'd cerZainly like<br />\nseason's informal. Careful, boys. The to get something te-his fraternity<br />\nPhi Sigs have been invited too.<br />\n1 brothers to keep rival factions from<br />\nThe rollicking rokus between A. D. saying that this column is a proand Dell Phi's, as evidenced by Bar- Alpha Delt, mouthpiece. So Murray,<br />\nroll and MacFeeley is all ironed out. if this print should get in your eyes,<br />\ndecided to forgive and forget, we wish to state that you poisonally,<br />\nand in case you're interested, they'll were in condition to impress lily<br />\nmake up in Levering Hall this after- white frosh last Friday nite. Undernoon at four. Line up early boys.<br />\nstand this isn't criticism—merely a<br />\nErnest Kiene pulled a right smart statement'of fact.<br /><br />\nOpen House Week<br /><br />\nway<br /><br />\nupon it for trade-bolstering purposes!<br /><br />\nDiatribe'« of<br /><br />\nBy BUDDY MACHT<br /><br />\nby far the bulk of its income, it must count on receipts<br />\nOne of the trickiest wrinkles in<br />\ntheI annual football phantas magoria<br />\nfrom advertising insertions.<br />\npopped up this year at American<br />\nhas<br />\nNow, it seems only'fair to us that as Hopkins students<br />\nUniversity. This school goes Ruswe should show our appreciation to advertisers for their<br />\nsia's example of women soldiers one<br />\nhelp in the maintenance of our campus organ. And better.<br />\nThey have a girl on their<br />\nthe only real<br />\nIn which we can show this appreciation football team! That's right, a girl.<br />\nOne of the coeds who evidently<br />\n.s by patronizing these advertisers in every way possible.<br />\nWe contend, and feel that the thinking student body didn't think much of the calibre of<br />\nmasculinity at American U. went out<br />\nbehind \"us, that-'n every case of indecision, an adverfor the team—and made it! Of course,<br />\ntiser in the NEWS-LETTER should be given full preference she only goes<br />\ninto the game to kick<br />\nover any non-advertiser!<br />\nthe points after touchdowns, but<br />\nhow<br />\nthink<br />\nmuch she bolsters up<br />\nBut what of the other extreme--those merchants, just<br />\nstores, and shops who depend for the bulk of their the boys' libidos.<br />\nunderstand<br />\nWe<br />\nthat Hopkins' deincome on the student body of the Hopkins, and yet feel<br />\nfense is being entirely revamped, for<br />\nthat they needn't advertise In the<br />\n,NEWS-LETTER? What<br />\nthe game with American next week.<br />\nof those who deem themselves more necessary to the The boys are probably<br />\nbeing polished<br />\nstudents'than the students are to them?<br />\nup on their Emily Post.<br />\nAll these shops, ice cream parlors, and drug stores<br /><br />\nEDITORIAL STAFF<br />\ns.<br />\n_Editor-in-Chief ,<br />\nStanley Finkel<br />\n.<br />\nManaging Editors<br />\nJ. Murray Kempton,s7ahered Barroll, Jr.<br />\nBenjamin Root _<br />\nAssociate Editor<br />\nAssistant litilUaging Editors<br />\nJ. C. Handelsman, Victor M. Vtctoroff<br />\nHarold Zheutlin .<br />\nSports Editor<br />\nArnold Glantz, Nathaniel Finkelstein<br />\nActing Sports Editors<br />\nSeymour Sack. .<br />\nFeature Editor<br />\nMal Boshuack, Exchange, Editor<br />\nREPORTERS<br />\nMel Taymor, '40; Morris Wessel, '39; Charles Diggs, '40<br />\nLeonard,Quitt, '40; Daniel Stone, '39; Zeana Baum, ,'38;<br />\nowe something to the students of the Hopkins. It is<br />\n, Cad Resin, '38; Lester Rosenthal, '38; Cconard Rabin.<br />\nper. '38<br />\nthrough thent that their livelihood is earned.<br />\nBUSINESS STAFF<br />\nMelville Locker<br />\nEvilness Manager<br />\nThe fact of the matter- is that these establishments<br />\nare even more obligated to advertise in'the NEWS-LETTER<br />\n1957<br />\nMasts'<br />\n1938<br />\nthan such as, may require this advertising or depend<br /><br />\nPosocicied Gotle6iote Press<br /><br />\nFOR MODERN GREEKS<br /><br />\npotpourri<br /><br />\nThe NEws-LETrist depends upon two sources of income<br />\nfor the supporting of its publishing expenses. As a rec-<br /><br />\n1<br /><br />\nLetters To The<br />\nEditor<br /><br />\nONTEMPOxARY<br />\nOMMENT<br /><br />\nC<br /><br />\nTo the Editor of the NEWS-LETTER:<br />\nStarting this afternoon at 5:30, Sir:<br />\nIIS WAR PROBLEM<br />\nWe maintain that any merchants, dependent upon .the WCAO wil present a new weekly proPermit me thru the use of your colUpton Close, contributor to the the.-Wade of Hopkins' students for their income, owe it to gram devoted to collegiate doings<br />\numn to correct a few erroneous ideas<br />\nthose students to patronize them in every way possible. hereabouts. From the advance in- ,and set one, Hector by name, on the Saturday Evening Post and Far East<br />\nFRIDAY, NOVEMBER 5, 1937 ,•<br />\nformation which we received concernright track. Hector reminds one about commeniator for Time magazine,<br />\nThe solution?<br />\ning the spot it appears that it will<br />\nthe oft quoted statement that a per- speaking before the National AssoIt lies in co-operation—..Patronize our advertisers, and, feature much<br />\nthe same 'sort of stuff<br />\nson, unhampered by facts concerning ciated Collegiate Press Convention in<br />\nwhenever possible, patronisze only our \"advertisers!<br />\nnow being presented by former Hopa subject can talk, or write fluently<br />\nChicago a few days ago, remarked<br />\n(Continued from Page 1, Col. 5)<br />\nkins pum, Brent Gunts, who calls<br />\nabout the subject. Hector* in his<br />\nhis program over VVFBR The Varsity<br />\nthat it was a pathetic thing that the<br />\ncompetition.<br />\n3rd year and should know better. At<br />\nClub.<br />\n.<br />\nHowever Gunts caters only to<br />\n4. Non-subsidization in any form of athetics.<br />\nleast he implies its 3rd by his remark schools and the press have done nothhigh school students while the new<br />\nabout the \"Firebrand\" 2 years old. ing toward developihg in America an<br />\n5. Elimination of gate receipts.<br />\nThe annual intra-mural touch-football season has<br />\nshow is intended strictly for col` Hector howls about Shakespeare adult attitude toward America's place<br />\nIn other words the recent step of eliminating gate reached its half-way mark and the enthusiasm and gen- legians.<br />\nand \"that kind of stuff\" of which in the world. As one scans the newsreceipts—with its attendant evils—is an integral part, eral smooth performance displayed thus far this season<br />\nIt will entail social, scholastic and<br />\nthere has been no attempt to serve Papers<br />\nIndeed, a natural result, of the series of a progressive on the gridirons south of Gilman Hall eclipse all hopes rah-rah news from schools here in<br />\nand magazines of our day and •<br />\nonto the boys and cramp their \"hellheld for this form of mass atnletic entertainment.<br />\n, listens to the conversation of<br />\nmoves made by our athletic policy. \"Athletics for \"ill\"<br />\nthe State, stressing particularly the<br />\nuva good time\". In both 'teferences to '<br />\nThe rewards of these games are not reaped, they are<br />\nis themotto of the plan with the firm view towards wide- taken in stride. The fierce, yet friendly (in the true personality angle. A great deal can \"The Firebrand\" Hector statea thatt\"men in the stseet\" all about him, it<br />\nbe done with a project like this if it<br />\nspread participation and benefit, towards recreation and sense of the word), rivalry exhibited leads to pure sport<br />\n\"one or two actors gave passable , becomes increasingly evident to him<br />\nIs managed correctly. We hope it<br />\nperformances but only served to pull that Mr. Close was not far wrong<br />\nphysical exercise for a major portion of ,the student within the field and not exhibitionism. The hard exhilwill be.<br />\nthe standards down.\" Maybe you can when<br />\naration<br />\nand<br />\nmuscular<br />\nsatisfaction<br />\ngained<br />\nthrough<br />\nthese<br />\nbody.<br />\nhe said that we have a juvenile<br />\nhave Mr. Swyer and crew work and<br />\ngames belong to the players themselves. The players<br />\nattitude toward our place in the soA.s to (3)<br />\npull the standards up. Fortunately<br />\nare not taught, are not coached, are not ordered. They<br />\nDo you prefer heavy subsidization? If you prefer this play cooperatvely with<br />\nRandom House adds to its excellent first the director does not select a ciety of nations in which, for better<br />\nexercise as their purpose and<br />\nyou favor:<br />\nprominence as their prize. Their individual accomplish- record for 1937 with the publishing play, the Barnstormer staff does. The Ipof for worse, the United States is<br />\n1. A highly paid coach and a large coachhig staff, ments are honored and defleiences overlooked. They are of Liam O'Flaherty's new novel director, against his _better judge- living,<br />\nin the game, not eligible for the game. In short, ,the Famine. This book definitely marks ment accepts an offer and uses the<br />\nfor football alone, as well as other sports.<br />\nAt the present time we are facing<br />\nstudents are playing, are having fun, and their enjoy- its author as one of the most brilliant available material. Secondly, Mr.<br />\n'a crisis—we need go no further than<br />\n2. Scholarships given freely to students who are athment IA increased by the formal application of competi- and promising moderns. It concerns Paul Henrichs is or was a Barnstormthe front pages to ascertain that. Our<br />\nletically proficient.<br />\ntion. Several teams which were organized three years the terrible. famine of 1846 and 1847 er (in 1920) and one of the charter.<br />\n3. Wide use of scouts to pick material' for teams.<br />\nago, are still playing with the same lineups; they are which . laid low the Irish peasantry members. Does this interest you Hec- more serious thinkers and commenta4. Long training periods, with spring conditioning units. Referees have become assistants rather than and revealed the rotten conditions kler—oops I mean Hector? Further- tors would have us believe that what<br />\nand fall pre-school camps.<br />\npolicemen, because the rules which have been pr5pared which existed at that time. Written more Mr. Henrich out of his Shakes- we do in this crisis largely will deter5. An emphasis placed on large gate receipts, and are easily understood and conform to their simplicity' In a serious and restrained. mood, pearean atmosphere put forth the<br />\nmine the future of our civilization.<br />\nthe novel is consistently absorbing \"backword idea\" that the 'Stormers<br />\nsupport of minor sports by football.<br />\nand fairness.<br />\n.,<br />\nGranted that we are facing a crisis,<br />\n6. A decided lessening in the importance of intraThe fact that these conditions lead to enthusiasm and and should be one of the season's play a local theatre besides just exploding in finery for one night to an it would seem that an adult attitude<br />\nmural sports. _<br />\nsatisfaction even beyond. the boundaries of the field is best-sellers.<br />\naudience of friends. This sounds pro,r toward that crisis becomes<br />\n7. The practical professionalization of college foot- attested by the ever-increasing ranks of spectators who<br />\n.imperagressive to me. Hector. Please<br />\nball.<br />\nfollow the game with avid interest. The teams themnoteT-tive—or perhaps it is a bit too preAs to -(2)<br />\nselves have even begun initiatatively to hold secret<br />\nWe saw this one ourselves. One of that the play this year is \"Boy Meetalsumptious to assume that collegians<br />\nGirl\". Should Henrichs, if he directs,<br />\nDo you prefer light subsidization. If you prefer this, practises and .to foster \"team\" play. Several of these the up-and-coming<br />\ncampus politicians<br />\nare capable of assuming an adult atyou favor:<br />\ngames will live in the players years after games optic- running for office last week was so show an inability to handle other than<br />\ntitude toward anything. If such be<br />\n1. A single coach for football,' medium-priced and ally enjoyed are forgotten.<br />\nbusy swinging deals, handing out \"classics\" I'll admit it.Wait till after<br />\nthe case, let us say that We as collegcaring for spring practice.<br />\n.<br />\nThere are`500 students deriving athletic entertainment cigars, and kissing freshmen, that the show.<br />\n2. Part and full scholarships as. well as jobs given from this program. Anyone not participating in it is he completely forgot<br />\nOn any account \"Mr. Swyer and his ians, *wild develop a realistic atto vote for himto students for the sole purpose of getting them denying himself a satisfaction easily attainable, and self—page Jim Farley..<br />\n. . The inter- crew\" can and will tend to their own titude toward the whole problem of<br />\non a team but with scholastic records at least rea- obtainable with little sacrifice. It is not too late to join fraternity board<br />\nbusiness.<br />\nseems to have rewar and peace—this will lead into<br />\nsonable.<br />\nYours, for more of the same.<br />\nthis modern form of college athletic entertainment; the duced its rates here of late. Last<br />\nan adult .attitude when we have<br />\n3. A limited+ amount of scouting for material, main- athletic department will be only too. glad to cooperate week a fraternity<br />\nwas fined one dollar<br />\nChester<br />\nly from high school teams.<br />\nreached the \"proper\" age.<br />\nin finding your place in its program. Join<br />\ncause one-of the lads drove a fresh4. Some training besides actual season practices.<br />\nyour exercise in the form of -athletic entertainment.<br />\nN4lhat constitutes a realistic attitude<br />\nman home in his car. This week some<br />\nAnother 'Stormer says Hopkins'<br />\n5. Some emphasis placed on gate receipts, publicity<br />\nfraters not only drove a freshman all undergrads want to \"test\" Shakes- toward the‘...problem of war and<br />\nof a local nature to secure gate receipts.<br />\nthe way to Washington but they com- peare.<br />\npeace? Or, Tor that matter, what<br />\n6. Some lessening of the emportance of intramural<br />\nmitted two other flagrant violations. Dear \"Hector\",<br />\nconstitutes a realistic attitude tosports.<br />\nThe horrible examples of Spain and China today The frat was'fined one dollar ($1.00)<br />\nThe Barnstormers like any other ward anything? In the first place,<br />\nNeedless to say, we prefer the present program beor thirty-three and a third cents per<br />\norganization are always on the look- collegians should think the matter<br />\ncause it is in line with the educational policies' of an show clearly that War has no respect for Universities violation. We're.<br />\njust<br />\nthrough and come to their conclusions<br />\nwaiting<br />\nfor. out for constructive<br />\nnor for anything Universities represent. Hospitals, labcriticism. Howenlightened institution. It is in harmony.with a desire to<br />\nnext week. At the present rate the<br />\never, your comments in the Novem- by reasoning, which is the outcome of<br />\nprovide well-rounded educational possibilities for all oratories, research buildings, lecture halls—all are fraternities will<br />\nprobably start fining ber 2 News-LETTE<br />\ncareful study, rather than by letting<br />\nscarred or actually destroyed<br />\nits ravages. The<br />\n,<br />\nhuR, are a little short<br />\nthe students.<br />\nthemselves ben emotionally stirred to<br />\nmanitarian ,purposes of these structures are submerged the board ... The NEWS-LETTER straw of foolish.<br />\nthis<br />\nvote<br />\nweek<br />\nshould<br />\nat<br />\n\"view with alarm\" and \"rise in proleast show<br />\nby the blind barbarism attendant on War. Here we have<br />\nIn the first plaCe why shouldn't<br />\ntest\" by some demagogue who imagthe meeting of two conflicting occupations: that of which way the hot air blowk. . . . Hopkins undergraduates<br />\nwant to ines he<br />\nOut Cockeysville way they'll get out<br />\nhas cause. Right in line with<br />\nbuilding up civilization and that of breaking it down.<br />\ntaste Shakespeare. Aren't they intelIf the poll is to mean anything, there must be wide<br />\nthis is the statement of Senator Josh<br />\nModern warfare has shrunk all concepts of distance the old shotgun if you mention ligent enough for it?<br />\nHave you ever Lee<br />\nHopkins. It seems that. one of the.<br />\n'participation and serious consideration before actua<br />\nof Oli,lgtTs-in an interview with<br />\nNo physical vos .<br />\n, emintry; no part of<br />\n-seen anything monifelarCi<br />\nthan a<br />\nvoting. The three choices seem to us to be rather clear,<br />\nrepresentative of the Collegian<br />\ne population is safe: So it is not tOo difficult for us to H' boys went out there to attend \"a Jane Cowl's 'Twelfth<br />\nNight\" or the<br />\ndance last Halloween eve. That in<br />\nand the selection should be made with facility after imagine students like<br />\nReporter.<br />\n\"If those students who at<br />\nourselves, getting the foundations<br />\nLunts' \"Shrew.\"<br />\nweighing one's opinion.<br />\npresent are signing Oxford pledges<br />\nof an education or delving further into more intensive, itself would be considered in many<br />\nIn the second place \"The Firequarters a major calamity. But that<br />\nWe must obtain a sufficient number of votes in order specialized study, shaken radically<br />\nand opposing military training would<br />\nby the close impact<br />\nwasn't all. He brought a friend along brand\", ',Seven Keys To Baldpate\" use their energies<br />\nto draw any conclusions concerning the Campus opinion. of a war--especially an<br />\non the passage of<br />\ninvasion. We can perhaps feel<br />\n—a beautiful little skunk that and \"What, Price Glory\", were not worthwhile peace<br />\nWe are aware that it is apparently early in the year the distraction of bursting<br />\nlegislation they<br />\nshells to carrying on educapromptly went to•York in a business- written by Shakespeare.<br />\nto take a test, but at least three classes have already tional work.<br />\nwould be increasing immensely their<br />\nIn the third place Mr. Henrichs<br />\nseen the worth of the plan. The removal of gate receipts<br />\nis effectiveness in furthering peace\".<br />\nMaybe the letter sent to the head of our Student like way. After they cleared away<br />\nthe wreckage they wanted to lynch a former member of the Barnstorm- Because we quote<br />\nis merely a further step in the new,athletic policy begun Council by<br />\nM. Lee's statement<br />\na Chinese student will serve to bring 'closer<br />\nhim but instead they slapped him in era and in fact one of its .original does not mean<br />\nyears ago. The freshmen as well as other have seen the to home the situation in China.<br />\nthat we are in favor<br />\nHere, a peaceful country<br />\n-the'fug where he remained until his members.<br />\nfirst football game under the new system. They have —slowly awakening from<br />\nof<br />\nmilitary<br />\ntraining—quite<br />\nthe slumber of. backward civon the<br />\nIn the last place your article<br />\ndad bailed him.out the next morning.<br />\nalso been participating in the intramural program, an ilization—is brazenly invaded<br />\nlost contrary, We are opposed to it. What<br />\nby an aggressive enemr<br />\nall purpose when you signed it Hecieursd ohsaiwt-tIntegral part of the new athletic policy.<br />\nwe are urging is that students in<br />\nwho is mercilessly endeavoring to bring the attached<br />\ntor. If you will look in Winstons dicSo let us make this poll a significant indication of our country under her domination. Caught<br />\ntheir work for peace, instead of conup in the conTeachers' Bright Sayings<br />\ntionary \"hector\" is interpreted as<br />\nopinion towards these athletic problems. Fill out your fused social maelstrom—that results<br />\na fining their actions merely to negafrom the war are • Platonic love is a<br />\nblustering<br />\ndistinterested<br />\nfellow<br />\nbaflots now!<br />\native acts that will do nothing more<br />\nthese students like us- across the sea.<br />\nfriendship with somebody else's wife<br />\nA \"'Stormer\"<br />\n(Continued on Page 4, Col. 5)<br /><br />\n7937<br /><br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br /><br />\nAnent The Poll<br /><br />\nSuccessful<br /><br />\n..Book<br /><br />\nFribble<br /><br />\n, - War and Students<br /><br />\nby<br /><br />\nMake It'Worthwhile<br /><br />\nSI<br /><br />\nWi<br /><br />\nPol<br /><br />\nIr<br />\nexist<br />\nion<br />\ntoda<br /><br />\nLET<br />\ndent<br /><br />\nShal<br />\npoll(<br /><br />\nSi<br />\ncolic<br />\nand(<br />\nDr. •<br />\nmen<br />\nners<br /><br />\nthat<br />\nh<br />\nself<br /><br />\nof<br />\ncityi,<br />\nably<br />\nin tl<br />\nTele<br />\nto b<br />\nsappr<br />\nam<br />\nh<br />\nelicecoi<br />\nc<br />\nre<br /><br />\n,Yorl<br /><br />\nProic<br />\nthe<br />\ngrad<br />\nmatt<br />\nton<br /><br />\nOr<br />\nunde<br /><br />\nachei<br />\nHopi<br />\ncan't<br />\nnavei<br />\nthird+<br />\nwhic<br />\nuate<br />\nball<br />\nuate<br />\nFi<br />\neyes<br />\nera,<br />\nUpor<br />\nwast<br />\nthe<br />\nswea<br />\nstrip<br />\nthe<br />\nwher<br />\ntime<br />\nwhet<br />\nThis<br />\nthem<br /><br />\ncolle<br />\nthen<br />\ncryst<br />\ngrad<br />\nShaf<br />\nwith<br />\nthat<br />\nsqua<br />\nard (<br />\niful<br />\ncorm<br />\nores:<br />\nmeat<br />\nsenti<br />\nW,<br />\n,iate<br />\nI acry<br />\noff f<br />\nyou<br />\nture<br />\nence<br /><br />\nin<br />\nappr<br />\nif y<br />\nbette<br />\nthroi<br />\nsped<br />\nfoott<br />\na a<br />\nores(<br />\nter c<br />\ntire ,<br />\nFridi<br />\n0111131<br /><br />\nnext<br />\ndid,<br />\nbeim<br />\nmy /<br />\nembr<br />\nTh<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, NO<br /><br />\n5 1937<br /><br />\nSPEAKING OF...<br /><br />\nSPORT<br /><br />\n. . . RUBINGAIR, GIVE HIM ANOTHER<br />\nSHOT IN THE ARM<br />\nBy LEN RUBINGER<br /><br />\nSPORTS STAFF RECEIVES COMMENT SPIKED SHOE HOLDS BOOTERS TO BATTLE<br />\nUPON TODAY'S ATHLETIC ISSUE MEETING MONDAY; TOWSON TEACHERS<br />\nWill The Undergraduates<br />\nFollow Hopkins Tradition Of Yore?<br />\nPolicy Threw Bombshell Into<br />\nCollegiate 'Athletic<br />\nCircles<br /><br />\nO'NEILL ELECTED AND ALSO BLUE RIDGERS<br /><br />\nIntercollegiate Schedule<br /><br />\nJoe O'Neill, Former Vice\" Bluejay<br />\nSoccerites Set Back<br />\nPresident, Is Now<br />\nTeachers 1-0 List<br />\nNew Head<br />\nMonth<br />\nArt Lankford, Captain Of<br />\nMountaineers Have Poor<br />\nTrack team, Voted<br />\nRecord Among State<br />\nVice-President<br /><br />\nSoccer? Today<br />\nfans Hopkins vs.. Towson State<br />\nTeachers College at Towson<br />\nSoccer, November 6<br />\nJohns Hopkins vs. Blue Ridge<br />\nCollege at Homewood<br />\nFootball, November 6<br />\n• Johns Hopkins vs. Swarthmore<br />\nCollege at Swartlynore<br />\nCross Country, November 6<br />\nJohns Hopkins vs. Drexel Institute at Homewood ,<br /><br />\nousims,<br />\n.01.fr<br /><br />\nEvery columnist, sometime or other, is faced with the rather embarassMg realization that there isn't a thing to write about which hasn't already<br />\nbeen mentioned, more or less, in some way by some one. When such is<br />\nthe case.—and it is so with this writer (if he may be permitted to class<br />\nhimself among the columnist's; If only out of the consideration that he is<br />\nattempting to write a column), he usually resorts to a form of ridiculousness;—an endeavor to make something out of , nothing, so that he may<br />\n\"mate'1 something; whereas, if he didn't write anything .he would \"make\"<br />\nyou 'know what I me).<br />\nmean).<br />\nnothing<br />\nA gobd starting point in this campaign of seeming absurdities would<br />\nbe the Teachers' College—and more specifically, the female division of that<br />\ncollege (every body picks on the poor women). One who'has been around<br />\nHomewood for a number of years has noticed the definite increase in the<br />\nnumber of fair sex on the campus. We know that they are assigned a<br />\ncouple of nights a week up at the Gym,so that they-may at least experience<br /><br />\nBy ARTY LACHMAN,<br />\na bit of athletic enjoyment. But that's as far as it goes. They have no<br />\nIn our eyes, the most important<br />\nLast Monday evening the Spiked<br />\nteams, and no coaches, and hence they can never expect to represent the<br />\nexpression of undergraduate opinShoe, honorary track fraternity, held<br />\nThe 'Blue Jay booters face a busy Johns Hopkins University in competition against<br />\nion in recent years is being rendered<br />\nother schools. Wouldn't<br />\nan important meeting in Levering<br />\ntoday at the Hopkins. The NEWSweek-end when they face the Tow- it be wonderful if they'd organize a field-hockey<br />\nteam, or a swimming team,<br />\nHall. The/ attendance was 100 pe<br />\npoll<br />\nwill<br />\nLETrER<br />\nreveal how the stucent Pant Castelle, president of the son State Teachers' College eleven to or some such thing? Yes, it would be!<br />\ndent body feels about Dr. Wilson<br />\nclub, had left school and new elec- day and the Blue Ridge College bootBut more wonderful still would be the inauguration of a new activity<br />\nShaffer's<br />\nultra-amateur<br />\nathletic<br />\ntions were held. Joe O'Neill, former ers on the following day. '<br />\nfor men, which holds its place among the oldest of sports at any institupolicy.<br />\nVice-President,. was elected PresiThe clash with the Towson lays tion:—that is, crew. We have here in Baltimore the'<br />\nBombshell Explodes<br />\nPatapsco river, which •<br />\ndent. Arthur Lankford, captain of<br />\nWill mark the second encounter be- river is easily comparable to any<br />\nSince it exploded under our very<br />\nother body of water that is now being<br />\nthe Blue Jay's track team, was made<br />\ncollective noses,• it is hard for us to<br />\ntween<br />\nthe<br />\ntwo. In the previous tilt used by oarsmen. All we have to do is steal a couple<br />\nthe new Vice-President.<br />\nof shells and start<br />\nunderstand the fat-reaching force of<br />\nthe Lyonsmen emerged victorious building he-men; and as a first step in achieving the<br />\nPlans Made<br />\nlatter, we can do away<br />\nDr. Shaffer's bombshell. Its fragAfter dinner, discussions were over the last year's State Champions with Dormitory fare, which food seems to be Shrinking men instead of exments hurled themselves to all cor- FLASH<br />\nSeveral prisoners at Alcatraz held and plans were made for the by a 1-0 score. It was a hard-!ought panding them.'<br />\nners of the athletic world. What<br />\ndoes it mean? It cannot be denied 1,rison, which houses the toughest event sponsored .by the Spiked Shoe. contest with outstanding playing on<br />\nOr perhaps we might be interested in renewing the ancient demand for<br />\nthat the Hopkins once more set it- Federal criminals, are' taking corres- The date of the meet is the twentieth both sides. The visitors were unable la swimming pool somewhere<br />\non the campus, so that Coach Hambleton might<br />\ncommittee<br />\nof<br />\nNovember.<br />\nwas<br />\nA<br />\npondence<br />\ncourses<br />\nfrom<br />\nthe<br />\nUniversity<br />\nself aside from its fellow institutions<br />\nto penetrate the Black and Blue le- not have to spend all that mouey in traveling to<br />\nCity'College pool. If we're<br />\nformed to, carry out the plans of the<br />\nof learning on March 2 last. Publi- of California.<br />\ntense<br />\ndue<br />\nto<br />\nthe<br />\nbrilliant<br />\nplaying<br />\nof<br />\nreally serious, we might even get the student body out with picks and<br />\ncity, which we have been remarkIt would take 563 years for one club, and to manage the meet. MilGoalie<br />\nCy<br />\nRomanofsky<br />\nand<br />\nhis<br />\nHerman<br />\nwas<br />\nfullmade<br />\nFranklin<br />\nton<br />\nSaul<br />\nshovels, digging a big ditch, and praying for a good long rain. But that<br />\nably adept at avoiding, was gained person to complete all the courses<br />\nin the widely-read New York World now being offered by Yale Univer- Chairman of the group. Other mem- backs. The Jays made the lone tally would mean another flood in Cumberland, which town is supplying us with<br />\nare<br />\nDriscoll<br />\nhis<br />\ncommittee<br />\nbers<br />\nof,<br />\nsity.<br />\n. It's O.K. for Methuselah.<br />\n,of the conteq in the first period on 4n awful lot of students these days.<br />\nTelegram column of Daniel. We are<br />\nand Gwinn.<br />\nto be admired for not falling to the<br />\nThere are more part time students<br />\na well-placed lick by Briggs, center<br />\n,Finally, we must recognize the suggestion of several students that we<br />\nMeet Was Success<br />\ncheap publicity-seeking level of other enrolled at New York University than<br />\nforward, and then played well to pro- establish an ice-hockey team. It seems that some of<br />\nthe boys have brought<br />\nLast year this meet was a great<br />\nschools. The spectacular but favorable there are full time students at any<br />\n• their skates to school and cannot hear to, see them rust away. But those<br />\nsuccess. There were a great many tect this tally..<br />\nrecognition of our plan by the New other college excepting California!<br />\nThe Hopkins chances of increasing Ideas may quickly be dispelled from their minds by<br />\nhigh schools that competed and the<br />\n• York paper is, to our minds, tacit<br />\ntheir witnessing of<br />\nJohnny Maulbetsch, Michigan's<br />\nHigh School the total was hindered when Hartke some of our Basketball<br />\nmeet was'wen by Curtiss<br />\napproval of the Hopkins' pioneering greatest plunging<br />\ngames, a few of which combine the elements of<br />\n•<br />\nfullback, gained<br />\nof New York. This year the success sustained a leg injury in the first<br />\nproject, and almost, in itself, justifies 350 yards against<br />\nhockey, wrestling, and rugby into one grand performance Of a modified<br />\nHarvard in 1913<br />\nOf the meet is already assured as it<br />\nthe plan. Further, Princeton's under- without scoring . . . Each time<br />\nstanza. His presence in this coming type of football, which all goes to show that we don't<br />\nhe<br />\nneed ice-hockey<br />\nis certain that at least six 'teams<br />\ngraduate-daily -has-seen IR to inti- took the ball to the Crimson goal<br />\nline,<br />\ncontest<br />\nwill<br />\nbe of the greatest bene- when Basketball is going on. What about the ice-skates? Well,<br />\nsuppose<br />\nmate that that a like plan at Prince- the quarterback called some other will participate. Among the schools<br />\nton would not hurt her enrollment. back to carry the ball over. All failed interested is Nott Terrace, from fit and necessity to the Hopkins we trade them in for a ticket to a professional hockey game<br />\nSchenectady, whose team has been booters.<br />\nPoor Athletic Record<br />\nand Harvard scored a 7-0,victory.<br />\namong the first three high school<br />\nOn the other hand, the Hopkins'<br />\nThe Jay teara faces an easier as\"Snooks\" Dowd ran 210 yards for<br />\nN cI RTH IN<br />\ncross country teams in the country. signment when it meets the<br />\nto<br />\nsee<br />\nhis<br />\nundergraduate is forced<br />\nBlue<br />\na touchdown, Lehigh vs. Lafayette.<br />\nE. NORTH AVE. I<br />\nignominously defeated by<br />\nOthers Interested<br />\nRidge team, for the visitors have<br />\nHe ran in tfla Wrong direction cirTHE RENDEZVOUS OF<br />\nschools in every respect inferior to<br />\n'<br />\nThere are a number of other high,<br />\ncled the goal-pasta, and ran back<br />\nbeen<br />\ndefeated<br />\nby<br />\nan<br />\n8-1<br />\ncount<br />\nby<br />\nCOLLEGE FRIENDS<br />\nHopkins. He asks himself why we<br />\nschools with above, average teams<br />\nagain the length of the field!<br />\nOur Prices are Lower Than Ever<br />\ncan't have a team worthy, of our<br />\nwho are interested in the meet. Olney Towson.<br />\nThe line-up for Friday's tilt:<br />\nname. He registers chagrin as he • Coach A. A. Stagg, the grand old High School from Philadelphia and<br />\nthinks of his alumni days i n man of football was an end on,the Chester High have expressed a deHOPKINS<br />\nTOWSON<br />\nwhich the main tie between a grad- first All-American team in 1889!<br />\nsire to participate. From Baltimore, Romanofsky<br />\ng<br />\nWilde<br />\nMichigan's<br />\nfamed<br />\nWillie<br />\nHeston City, Poly and Mt. St. Joe are sure<br />\nuate and his alma mater is the footGon'gh<br />\nr. f.<br />\nL. Cox<br />\nball team. How cap.the undergrad- scored over 110 touchdowns from entrees with Central High and Mc1f<br />\nCernik<br />\n1901 to 1905.<br />\nuate react?<br />\nKinley Tech from Washington as Stout<br />\nc.h. •<br />\nWheeler<br />\n\"Skivy Davis\", Oklahoma Uni- probable starters. This encounter is Hartke<br />\nFirst he Must realize that in the<br />\neyes of many college football play- versity, kicked 23 goals after touch-' on its way to becoming one of the Hoops<br />\nW. Cox<br />\n1h<br />\ners, the \"do or die\" spirit is dead. downs in one game, September 29, outstanding high school meets in this Kephart<br />\nr. h<br />\nBennett<br />\nUpon serious reflection, it does seem 1917.<br />\nsection, and it is felt sure that those Briggs<br />\ncf... Garamerncen<br />\nwasteful for a young, map to spend<br />\nWorld's Largest Schoolhouse: Pitts- who turn out to watch the competiStern<br />\n• i. r<br />\nthe major part of four years in a burgh's Cathedral of Learning is 42 tion will be amply rewarded by the Brayshaw<br />\n1.1<br />\nShock<br />\nsweaty locker room or on the chalk- stories high, contains 375 rooms, 67 keen competition of the races and Linthicum<br />\nstriped \"green pastures\" while in labs, 52 Research labs, 91 classrooms, by the high caliber of the contestants. Price<br />\nOr<br />\nGordon'<br />\nthe shadow of academic buildings 8 large Lecture Halls, 15 DepartIndoor Track Team<br />\nLoenstein<br />\n0.1<br />\nPhillips<br />\nwhere he could spend some of that ment Studies, 5 Theatres, 18 offices,<br />\nAmong other things discussed at<br />\ntime fitting himself for the days 3 floors of Library, a Fine Arts Li- the meeting wart the prospect of an<br />\nthere every day and so. is Dick<br />\nwhen he is fretting, fat and forty. brary, Club and Lounge rooms!!<br />\nindoor track team for Hopkins. There<br />\nGwinn, one of the greatest runners<br />\nThis is not opinionated; the players<br />\nThe University of Denver celebrates are a number of indoor meets that<br />\never developed at Hopkini.<br />\nthemselves are adopting this attitude. Adam and Eve day in January,<br />\nEach the team could participate in, and<br />\nIn the meantime, don't .forget No- Don't Scrap Football<br />\nstudent receives an apple from the efforts are being made to form a<br />\nWe don't call for a scrapping Of Chancellor!<br />\nrelay team. Dick Gwira, Coach Ham- vember the twentieth. Come out to<br />\nis,<br />\npoint<br />\nThe<br />\nat<br />\nall.<br />\nfootball<br />\ncollege<br />\n'<br />\nbleton's assistant, will be 'in charge see some of the best high school runA trio of local Gamblers secured<br />\nthere is a trend afoot and we have<br />\nof early practice, as the latter will<br />\nning, and some of the future college<br />\nthe land for the First building of the<br />\ncrystallized it. The Hopkins underbe busy with the swimming team<br />\nUniversity of Arizona.<br />\ngreats. It will be well worth your<br />\ngraduate should realize that Dr.<br />\nduring the winter. For all those who<br />\nwhile.<br />\nShaffer's plan is merely in keeping<br />\nare interested, a notice will be in- 1with the same indomitable spirit This prevailing idea of the alumnus serted in the NEWS-LETTER when the<br />\nthat caused Hopkins •to rise from a tearing his heart out because his call for candidates is issued. EveryROETH•<br />\n, body who.has._ any ability<br />\nsqualid group of buildings on How- boys are on the short end every Sat<br />\nto run<br />\nJeweler<br />\nard or some such street to the beaut- urday. is the bunk., It may be claimed ;should come out, as the positions are<br />\n3120 Greenmount Ave.<br />\niful Homewood site, that saw us that we are losing a large source of wide open, and the, prospects are<br />\nWath Repairing<br />\ncome through that \"ole debbil de- alumni revenue because we don't bright for a few good trips.<br />\npression\" in one piece. We don't get out and win consistently. We<br />\nThose who are interested may start<br />\nHopkins.<br />\nfeel<br />\nalumni<br />\nthat<br />\nthe<br />\nare<br />\nmean to appeal to the undergraduate<br />\nconditioning themselves now by<br />\nmade of sterner stuff on both counts. working out<br />\nsentimental nature.<br />\nwith the cross country<br />\nWe feel the losing, team does not team. Equipment<br />\nHopkins Unsentimental<br />\nmay be secured<br />\nWe realize the Hopkins undergrad- aggravate them but rather they, are any'llay from the manager at 400<br />\namateurism.<br />\n(Time<br />\nits<br />\nrank<br />\nelated<br />\nby<br />\nuate is more cold, hard reality,than<br />\nat the gym. Coach Hambletottls.up<br />\nlacrymose sentiment and is better prevented us from speaking to any<br />\noff for it. We want to say that if alumni on this point so strictly speaki<br />\nWhen you stop and consider<br />\n•<br />\nBILLIARDS<br />\nyou believe in the Hopkins, its ma- ing this is mostly prediction). More<br />\nthat Schloss' creations are the<br />\nPing Pong<br />\nthey<br />\nsee<br />\nfeel<br />\nthat<br />\nif<br />\nwe<br />\nImportant,<br />\n• Even under duress Arrow'shorts will maintain their<br />\nture academic approach, its insistlatest; that Schloss' materials<br />\nManaged by Maryland',<br />\nplacid dignity without sawing, binding or creeping.<br />\nence on the truth of things, its place fit to loosen the purse strings, eleven<br />\nare the finest; that' Schloss'<br />\nState Champions<br />\nin Universal education, then your men in blue being soundly thrashed<br />\n'They'll wearwell too, without shrinking, and dutifully<br />\nexpert tailors take greater<br />\nFinest Tablea—Reaaonable Prices<br />\ncause a tightening of said<br />\napproval is,etterly consistent. 1110,.<br />\npains with their work — then<br />\nserve you in aorzirTI- crow Shorts—seamless crotch<br />\nGreenmount Ave &amp; 31st St.<br />\nif you firmly believe Hopkins can purse strings. We feel that if any \\syou understand why Schloss'<br />\n—Sanforized Shrunk 65c. up. Undershirts 50c.<br />\nHomewood,<br />\nneed<br />\nat<br />\nthe<br />\nsees<br />\nalumnus<br />\nperhaps<br />\nbetter itself in some way,<br />\nprices are reasonable.<br />\nthrough publicity, or through a re- he'll contribute, if he can afford it.<br />\nGet To Know Us<br />\nDistinguished Sui t s,<br />\nspectful standing in intercollegiate We feel he realizes that the HopYOUR CREDIT IS GOOD!<br />\nfootball circles, you are expressing kins is based on productive laboraTopcoats, Overcoats<br />\nEXPERT HAIRCUTTING, 40c<br />\non<br />\nproductnot<br />\nlibraries,<br />\ntories<br />\nand<br />\na conscientious disapproval to the<br />\nrooms.<br />\nlocker<br />\nive<br />\nmata<br />\njust<br />\npresent plan. Maybe it is<br />\nTHEODORE'S<br />\n' Mature Outlook<br />\nter of pride. We ran through the enHaving a broad vision, it seems to<br />\nBARBER SHOP<br />\ntire gamut of profanity that hor bI<br />\nthat the undergraduate should<br />\nFriday night some weeks ago.,(<br />\nS. W. Cor, St. Paul and 33rd Sta.<br />\nlook at the question from its broader<br />\nourselves, of course—We had dat<br />\n1st Floor, next to Drug Store<br />\nWe Carry A Full Line Of<br />\nnext to us) We know many others aspects. t,,swalloW his pride and then<br />\nArrow Shirts And Collars<br />\nHours: 8 a. m. to.7:30 p. m. Sat.<br />\ndid, silently or otherwise; the latter watch the plan catch on. It's difficult<br />\n8 a. m. to 930 p. m. Manicuring<br />\nbeing the case not infrequently in to place yourself behind an experimy section of the stand, much to my ment defying the prevailing mode of Individual Brush and Comb For<br />\nthings. Seventy years of Hopkins'<br />\n(nowhere Asa)<br />\nEvery Customer<br />\nembarrassment.<br />\n11 East Baltimore Street<br />\nThe alumni question is important. history should' 'allay such doubt.<br />\nAININIMMIMINMW<br /><br />\nCOLLEGLATE<br />\nODDITIES<br /><br />\n1<br /><br />\neYVING IT!<br /><br />\nWhen You Stop<br />\nAnd Consider<br /><br />\nArrow'Shorts can take it!<br />\nCan you?<br /><br />\nii<br /><br />\n,ARROW UNDERWEAR<br /><br />\nFrom $35<br /><br />\nJ os.<br /><br />\nSchloss<br />\n&amp; Son<br /><br />\n5 East Lexington St.<br /><br />\n-<br /><br />\nMcPherson's<br /><br />\n4<br /><br />\nHOMEVVOOD, BALTIMORE, FRIDAY, NOVEMBER 5, 1937<br /><br />\nWILLIAM RUSSEL I<br />\nOF CAPIOLIC U.<br />\nTO SPEAK MONDAY<br /><br />\nSpeaker On Catholicism<br /><br />\nrONTEMPORARY PANEL DISCUSSION<br />\nvOMMENT<br /><br />\n'Stormers Promise Production<br />\nPleasing To Hopkins Audience<br />\nReviewer Claims \"Boy Meets Girl,\" To Be Funnier Than<br />\n\"Once In A Lifetime\"; Story Centers Around<br />\nAntics Of Two Scenario Wr3,ers<br /><br />\n_ (Continued from Page 2, Col. 6)<br />\nthan keep them personally from going<br />\nto war should work positively for<br /><br />\nAT FIRST FORUM<br />\nLED BY ALUMNI<br /><br />\npeace and its promotio,n in society.<br />\nThis is the realistic or adult attitude<br />\nViews Presented On Subject<br />\nBy WILLIAM L. SNYDER<br />\nthe mother and her foetal burden as far as the individual is<br />\nconcerned.<br />\nLast year the Barnstormers pro- under contract.<br />\nOf Return To Freshman<br />\nIt also is the adult attitude as far as<br />\nduced Once In a Lifetime, a rollickAs soon as the baby, Happy is his<br />\nStatus<br />\ning comedy about. Hollywood. Due name, is born the cameras begin America is concerned. America, in its<br />\nSTUDENTS AND<br />\nto that complete success, the group grinding and in no time he is adopted peace legislation should aim not mereDR.<br />\nABEL WOLMAN<br />\nhas decided that the first preduction into the hearts of the entire nation. ly at a negative neutrality<br />\nPUBLIC INVITED<br />\nat any<br />\nSTARTS DISCUSSION<br />\nfor this year will be a play in the Everything is going imoothly when cost, but<br />\nrather at an aggressive plan<br />\nsame vein, Boy Meets Girl.<br />\nan actor's agedt discover.<br />\nthe of peace promotion throughout<br />\nDr. Russel Is Frequent Conthe Sanitary Engineering AssociThis light comedy by Bella and two writers have neglected to haw<br />\ntributor To Various ReSamuel Spewack was the most no- their power of attorney for Happy entire world.<br />\nate Recommends Liberal<br />\ntorious success of the 1935 season.<br />\nCollegian Reporter<br />\nligious Journals<br />\nrenewed, and signs the infant tip<br />\nEducation<br />\nBoy Meets Girl is a satirical car- before the boys know what'S coming<br />\nMorningside College •<br />\nProfessor William H. Russel, of<br />\ntoon of the moving picture industry off. •<br />\nBy JOHN P. DODGE<br />\nkeenly observed, truthfully reported<br />\nthe Catholic University of America,<br />\nThe two indulge in several brazen<br />\nThe first Freshman Forum at LevDR. WILLIAM H. RUSSEL<br />\nand expertly transferred•to the stage. schemes, mischief in a hospital and<br />\nWashington, D. C., will open the<br />\nering Hall on Tuesday proved to be a<br />\nThe authors are well equipped to general skulduggery in an effort to<br />\nsecond series of lectures on religion<br />\n\"bull session,\" led by the five alumni<br />\nhandle the type is this particular way regain control of the gold mine, all<br />\nat the Hopkins, sponsored jointly by<br />\nfor they are reporters as well as of which is very enlivening to the<br />\npresent with' the audience of five<br />\nthe National Conference of Jews and<br />\nplaywrights.<br />\naudience.<br />\nfreshmen and four upperclassmen<br />\nThe comedy is based on the mti,cs<br />\nChristians and the University. Dr.<br />\nThroughout the story the, Spewaks Police Commissioner<br />\nOf Bal- (members of the committee) joining<br />\nof two Hollywood script writers un- conduct the usual farcical burlesque<br />\n\"Russel's three lectures, on three sucmore Speaker Informally In. Dr. Abel Wolman called on Mr.<br />\nder contract to the Royal Sti.dios in about Hollywood studios. Through'<br />\ncessive Mondays, beginning NovemGuy Hollyday to start by telling what<br />\nthe cinema city. Privately, the two the practical jokes of the two insane<br />\nAt Latrobe Hall<br />\n. are.funnier<br />\nber 8th, at 8:15 in Latrobe Hall, will Invited By Carnegie Corporchanges he would make in his colthan the plays Which they script writers serve as a way to<br />\n(Continued from Page 1, Col, 21<br />\nation To Study Australian write.<br />\ndeal with the \"Historical Aspects of<br />\nattack with good humour many<br />\nlege life if he could livg it over again.<br />\nCatholicism.\"<br />\nWhile they are reluctantly at- widely known peculiarities of the moRadio System<br />\nArbitration System<br />\nMeditatively stroking a little brown<br />\ntempting to throw' together,any sort tion picture industry. For example,<br />\nThe commissioner described the<br />\nA graduate of Columbia College,<br />\nkitten which came with one of the<br />\nof a script for the studio's cowboy they persist, incessantly that the plot new two-way<br />\n(Continued from Page 1, Col. 4)<br />\nof Iowa, Dr. Russel has his Master's<br />\nradio system which<br />\nfreshmen Guy Hollyday said that he<br />\nstar, a waitress Who is an expectant for Any play is the age old formula;<br />\nis in the process of installation in<br />\nand Doctor's degrees from the Cath- ett is well equipped to make a study<br />\nwould do just the same things as<br />\nbut unwed mother faints in the office \"Boy meets girl, boy loses girl, boy<br />\nall Baltimore radio cars. He deolic University. He is et present In- which may throw some<br />\nlight on the of the producer. She tells of, her gets girl.\"<br />\nwhen he was here; namely; enter into<br />\nseribed<br />\nstructor in Religion at that instituthe<br />\ngiant<br />\ncondition<br />\nmaster switchboard<br />\nand the writers are seized<br />\nOn the basis of my brief experisolutions of American labor problems.<br />\nas many extracurricular activities as<br />\nwith a great idea. They believe they ence with the type of audience be- from • which the movements of the<br />\ntion. He is, the author of Your Religpossible.<br />\nIt appears that the United States is can have a great story<br />\nbuilt<br />\naround<br />\nfore<br />\nwhom<br />\nBarnstorme<br />\nradio<br />\nthe<br />\nion, Bible and Character, Life of<br />\ncars are directed, mentioned<br />\nrs perBacked up by D. H. Johnston, electhe career of the foundling that is form, \"Boy Meets Girl\" should prove<br />\nnow<br />\nattempting<br />\nto<br />\nput<br />\ninto<br />\npractice<br />\nthe auxiliary system which may imJesus, and Christ the Leader. He is<br />\ntrical engineer, Dr. Wolman struck<br />\nsoon to arrive. They immediately put to be a very successfel fail offering.<br />\nwhat<br />\nAustralia has already succeedmediately be put in service in case of<br />\nalso a frequent contributor, to religthe keynote of the discussion by saytrouble with the main system, and ing that<br />\nious journals, and is active -in Cath- ed in doing.<br />\nhe thought it was better to,<br />\nascertained the value of two-way come to college without trying to<br />\nolic Social Organizations.<br />\nProfessor Barnett, a native of<br />\n•<br />\nradio communication in speeding up work for any career. Dr. Wolman recSecos4-1=itrieif<br />\nCambridge, Maryland, earned his A.<br />\nommended a general college educapolice action.<br />\nDr. hunsel's lectures mark the secB. degree it Randolph-Macon College'<br />\ntion in arts and sciences with specond series, in a series of three, nine<br />\nWhen coeds at the University of 'Oh, nuts!'\" .<br />\nStatiatice<br />\n.<br />\nialization beginning only in postin 1891, and received his doctorate VVIashingkon are through renovating<br />\n\"The boys who do all the formulatlectures all together for the first<br />\nCommissioner Lawson stated the graduate work. He<br />\nsaid that the modthe<br />\nmanners<br />\nof<br />\nmasculine<br />\nthe<br />\ncontin-'<br />\nfrom<br />\ning<br />\nour<br />\nOf<br />\nJohns<br />\nplans.\"<br />\nHopkins<br />\nin 1902. Presemester, dealing wan the history of<br />\nfollowing facts: More fatal accidents ern world is so intricate that postgency on the campus, there won't be NEW YORK AT LARGE<br />\ngraduate<br />\nwork is necessary for any<br />\nvarious religiens groups. Later in vious to that, he had bene an inoccur in homes than in automobiles,<br />\na man who will dare to keep a girl<br />\nBy Fred Wittner and Mel Adams<br />\nprofessional work. Wolman Stated<br />\nthe fall, Dr. Cyril C. Richardson, of structor in a North Carolina High , talking on the telephone<br />\nmore than (Associated Colelgiate Press Cor- approximately 20 per cent more. In- that<br />\nthere was more to be gotten from<br />\nthe Union Theological Seminary, will School for a number of years. At five minutes when she should be<br />\ndustries account for just about twice<br />\n• respondents)<br />\ncollege years than mere training for<br />\ndeal with the Protestant Historical Hopkins, he was instructor, associate studying.<br />\nOne of the brightest productions to as many fatalities as motor vehicle one's occupation.<br />\nHe, said that the<br />\nThe<br />\ncoeds are being subtle about• illuminate the floodlights this season a9cidents.<br />\nand associate professor of political<br />\nAspects.<br />\nApproximately 95 per cent arts and allied subjects make life<br />\nthe thing though. \"It Is Done\", new Is George Abboott's production of<br />\nmore<br />\nfull<br />\nand<br />\nThe lectures are open to the stu- economy from 1901 to 1911. In 1911<br />\npleasant<br />\nof<br />\nall<br />\nand that these<br />\ncars'<br />\nfound<br />\nmissing in Balti1937 edition of the campus etiquette \"Angel Island,\" a comedy-mys<br />\ntery<br />\nadvantages could only be gotten durdents and general public.<br />\nhe was appointed a professor, and book, is going to be a part<br />\nmore, are recovered.<br />\nof every written by Bernie Angus. . . the mysing the first years work of college<br />\nfrom that time has specialized in man's library if coed sales-girls have terious elements are insignificant<br />\nCommissioner Lawson completed<br />\n, but<br />\nlife. Mr. McLean '35, agreed that<br />\nanything to say about it.<br />\nAmerican labor probblems.<br />\nthe comic routine following the usual his address with a number of depart- post-gr<br />\naduate work should be taken<br />\nAmong the<br />\nun-Emily<br />\nPost<br />\nan<br />\nf<br />\nAbbott<br />\nformula<br />\nmakes<br />\nfor swelegant mental ancedotes. He told about an by students and that for<br />\nDr. Barnett is a member of the<br />\nthe first<br />\nthings Joe College will have called entertainment. . . Two West<br />\nCoastInebriated gentleman, who was so four years one should try to get a<br />\nAmerican Statistical Association, the<br />\nto his attention is the habit of monop- ers visiting here this wek are Tyrone<br />\nbroad<br />\neducation.<br />\nconfused by the similar blocks Of,<br />\nAmerican Economic Association, and olizing the sorority's only davenport, Power<br />\nAnd Alice Faye, the latter va(Continued from Page 1, Col. 6)<br />\nHeretofore the discussion has cenwere the \"channels through which the the American Association for Labor, breaking blind dates and letting frail cationing from the Hal Kemp show houses in Baltimore that he had to' tered on professional<br />\ntraining, and<br />\nArabic learning flowed into Barbar- Legislation, and has written many coeds open heavy campus doors all for a few weeks. . . Ben Marden's call up the police department for aid Guy Hollyday gave<br />\nthe busineess stuby themselves.<br />\nRiviera is making a drive for the out- in reaching home.<br />\nian Europe\". They lforged the link books in regard to his<br />\ndent's<br />\ncase. He said that business-men<br />\nfield. Among<br />\nPet peeves of coeds at Duquesne of-town trade by staying open<br />\nbetween the learning of the East and them<br />\nall winneed only ET;ordinary four yeartourse<br />\nare: Mediation, investigation, University:<br />\nQuiz Section<br />\nter.. . Success story of the week conthe ignorance of ,the West.\"<br />\nand should take more college work<br />\nand Arbitration in Industrial DisAfter the address the audience<br />\n\"My pet peeve as far- as boys are cerns Vincent Price, star of ''The<br />\nIn a few powerful concluding stateonly if they can afford it. Mr. Stuart<br />\nments, Dr. Finkelstein prophesied putes, State Banking in the United concerned are those who flash a quar- Lady Has a Heart, who first achieved quizzed. the Commissioner on various Smith opposed<br />\nWolman's view by<br />\nter<br />\nand<br />\nexpect<br />\nyour<br />\neyes to glitter\". fame as Price Albert in \"Victoria subjects concerning<br />\nthat \"what is happening before our States, and The Printers. .<br />\nthe police de- stating that one ougra to be able to<br />\n\"The one thing that makes me see Regina\" ... Son of a St. Louis-candy<br />\neyes today in the countries of the<br />\n- partment and police regulations.<br />\nDuring pr. Barnett'a absence, his<br />\nselect<br />\nhis<br />\noccupation<br />\nearly so that he<br />\nMany<br />\nred is the boy who is suffering from bar manufacturer, Price<br />\nworld makes' certain the breakdown course<br />\nwent through<br />\nin corporation finances and in- over-expans<br />\ncontroversial subjects were discussed, can take all courses related to the<br />\nion of the head.<br />\nYale, preferring the tours offered by<br />\nof Western civilization, a world of<br />\nsufbject. He agreed, however, that<br />\nvestments will be taught by Dr. \"Imagine the fellow who goes off the<br />\nGlee Club to the more dogged notably the need for cooperation be- the<br />\nrising darkness,, which .only two<br />\nstudent who comes from high<br />\nforces can resist, Judaism and Christ- George H. Evans, associate professor Into a spiel such as \"Your eyes are work offered by campus dramatics so- tween police in different sections, and school with<br />\na definite end in view<br />\nof political economy at the Hopkins. like stars, your lips like rubies, your cieties. . . now packing them in as the problem cd colored<br />\nianity.\"<br />\npolicemen and and works solely toward that ob•<br />\nteeth like pearls. Oh joy! Oh bliss! one of the more popular<br />\nHe advised that 'the hope of the His remaining courses will not<br />\nmantinee<br />\npolicewomen. Commissioner Lawson jective is unwise. Wolman said that<br />\nbe And all the while the<br />\ngirl is thinking, idols of the day. . . the stock market<br />\nworld for a vigorous intellectual and given<br />\nthis academic year.<br />\nHe<br />\nstated that he believed that colored such a student is deplorable.<br />\nartistic growth for the goodwill of<br />\nwas backed up by Bill Harrunaker<br />\npolicemen and women would be much<br />\nmen lies in the houses of worship in<br />\nwho said that the man with a single<br />\nmore valuable in colored districts aim<br />\nreligion. What the world needs is<br />\nwhich he has always worked for<br />\nsome approach to God to bring back<br />\nthan white officers.<br />\nends up as a \"no good\" man, despite<br />\nthe spirit of love which is fast losSunday morning at 1 a. in. freshCommissioner Lamson announced his knowledge of his specialty. He<br />\ning ground.\"<br />\n(Continued from Page 1, Col. 1)<br />\nmen being'rushed by affiliates of the<br />\nthat the police department would be was sorry for such an inbred bookDr. Louis Finkelstein, at present<br />\nis a sincere interest in photography,<br />\nworm.<br />\nTo<br />\nSpeak<br />\nIn<br />\nopened to the public ip the near fuRemsen<br />\nHall Interfraternity Board will retire exProfessor of Theology and Provost<br />\nTo Group To-Night<br />\nhausted by as strenuous an ordeal of and an enthusiastic - desire to meet ture, and invited his audience to,see<br />\nthe University and the Baltimore<br />\nAt 7.30 P. M.<br />\nwith others equally interested. Those<br />\nActivity as isgesl<br />\nONLY DOWN TOWN STAGE SHOW<br />\nwas the first of the lecturers to ap.!:.een.n.a_ the Hopthe place.<br />\npear under the joint sponsorship of<br />\nkins campus. Hopeful freshmen and who cross their fingers and snap the<br />\nDr. Alan F. Guttr_nacher, associate<br />\nthe University and the Baltimoree<br />\nshutter<br />\nare<br />\njust<br />\nas<br />\nwelcome<br />\nas those<br />\nlikewise hopeful fraternity men will<br />\nRound Table of the National Confer- in Obstetrics at the Johns Hopkins<br />\nwho can turn out salon prints. A<br />\nI Medical School, will be the guest not greet each other in any way,<br />\nence of Jews and Christians.<br />\nON SCREEN<br />\ncourse<br />\ninstruction<br />\nof<br />\nfor those who<br />\nspeaker at the regular meeting of the shape, or form until 3 p. m., when<br />\nIRENE DUNNE<br />\nhave never had the extra thrill of debids<br />\nwill<br />\npresented.<br />\nbe<br />\nJohns Hopkins Science Club, tonight<br />\nCARY GRANT<br />\n. Tonight the last of the Open House veloping and printing their own picat 7:30 p.m*. in Remsen.301.<br />\nIN<br />\nPAUL AT 33RD STREET<br />\nparties will be held by Delta Phi-and tures is being arranged.<br />\nLecturing at the University last<br />\nMembership cards will be ex- Prescripti<br />\n(Continued from Pag 1, Col. 4)-_,<br />\nKappa<br />\nAlpha<br />\nwho<br />\nare entertaining<br />\nons—School Supplies<br />\nSpring under the sponsorship of the<br />\npartment, and the new athletic polON STAGE<br />\nrushees at luncheon today. Members changed for cash in the very near<br />\n.Sandwiches<br />\nAMERICA'S GREATEST<br />\nicy of the University. Articles of American Student Union, Dr. Guttfuture,<br />\nand<br />\nit<br />\nis<br />\nhoped<br />\nthat<br />\nanyone<br />\nof each fraternity will not divulge<br />\nAQUATIC SPECTACLE!<br />\ngeneril interest are the establish- macher became well known to the<br />\ntheir plans, but they expect to stimu- who was unable to attend the meetLOTTIB MAYER'S<br />\nUnexcelled Fountain Service<br />\nment of the twelve thousand volume student body. He will speak on some<br />\nlate jaded first yearmen to their way ing or who wishes to join will cone.; ,<br />\nDisappearing<br />\nMackall. Library;; the death of Dr. particular phase of<br />\nmunicate<br />\nimmediately<br />\nwith one of<br />\nhis field of re- of thipcing<br />\nWater Ballet<br />\n'<br />\n,<br />\n°'-ank Morley, professiar,-..,lritus of<br />\n'jhe<br />\no<br />\nsearch.<br />\n-0tfliA,<br />\nTomorrow freshmen we Visit<br />\nlarsaTzansknf$1:5:43:43rOASIII:a.i44<br />\n12 HOLLYWOOD DANCING<br />\nmathematias at the Hopkins; the<br />\nhouses<br />\nAND<br />\nof<br />\nDIVING BEAUTIES<br />\ntheir<br />\nchoice<br />\nor those they<br />\nLater in the season, Dr. James<br />\nchange in editorship of the Hopkins<br />\nwent national .last fall.<br />\nChristmas Seals!<br />\nI are considering \"No entertaining<br />\nPLUS—OTHER BIG ACTS<br />\nAlumni Magazine; and the naming Franck, Nobel Prize winner, and ProThe Betas, Phi Psis, S. P. E Kap- ,<br />\nt<br />\noutside the house\" will be tolerated in<br />\nof Dr. Charles S. Singleton as asso- fessor of Physics; Dr. John C. Hobpa Sigs, and IS. P. Es held parties,<br />\nthese last stages of the game,\" a<br />\nwhich are now pleasant memories to l4<br />\nciate in the Department of Romance bard, Head of the. Undergradu<br />\nate prominent member of the Interfrag<br />\nfuture Modern Greks.<br />\nLanguages.<br />\nti,,ft?...„,<br />\nW<br />\nPhysics Department, and Dr. Walter ternity Board asserted.<br />\nSo far the•rushing season has been<br />\nThe article on scholarships anKIBLER'S<br />\nAlpha Delta treated their fresh.<br />\nDandy, brain specialist at the HopARA —<br />\nfree from major violations, the D. W<br />\nnounces the establishment of five<br />\n-men to luncheon, a banquet at oix p.<br />\nJewelers and Opticians<br />\nnew scholarships--three of them in kins Medical School, will be speakers<br />\nm. and a formal dance at the house U.'s and the Alpha Delta being pen- ili ,<br />\nBey and Use Them<br />\nParker Pens and Pencils<br />\nthe Medical School—amounting to for the group.<br />\nalined for minor infractions.<br />\nof Page Edmunds, '39. AccOrding<br />\ntSmmrsacYsairssEssmEzaMEMrszmeI<br />\ng<br />\nalmost $70,000. Besides the new<br />\nThe 'Science Club is open to all , reports, Everad Lamed, '41, a<br />\nJewelry and Watches<br />\nDelta<br />\nscholarships, two scholarships alEyes Examined<br />\nundergraduate students interested in Phi legacy, was not equal to leatimg<br />\nready endowed have been increased<br />\nLens Repaired<br />\nScience. It is not necessary to have a the Big Apple more than three times.<br />\nby their donors. The Gazette has<br />\nAlpha Chi Rho entertained at a<br />\npublished the only statistical chart special knowledge of science, or to<br />\nluncheon and dance at their house<br />\nand study of new scholarships which be majoring in Science, to be a mem3222 Greenmount Ave. !<br />\nlast night They were enteetaming<br />\nhas been made.<br />\nber.<br />\nfreshmen for the first time since they<br /><br />\nSeries Of Addresses To Deal<br />\nWith The \"History<br />\nOf Catholicism.\"<br /><br />\n•,<br /><br />\n3<br />\n1<br /><br />\nLAWSON EMPHASIZES<br />\nNEED OF KNOWLEDGE 1<br /><br />\nDR. G. E. BARN Eli<br />\nTAKES YEAR'S LEAVE<br /><br />\nII<br /><br />\nSi<br /><br />\nSo<br />\nCh<br /><br />\nCAMPUS CAVORTINGS<br /><br />\nam<br /><br />\noff<br /><br />\ndal<br />\nof<br /><br />\nten<br /><br />\n1<br /><br />\nsec<br /><br />\nthe<br /><br />\nstu<br /><br />\neat<br /><br />\nthe<br /><br />\nDR LOUIS FINKELSTEIN<br />\nCLOSES LECTURE SERIES<br /><br />\nOR ALAN GUTTMACHER<br />\nSCIENSE CLUB SPEAKER<br /><br />\nvid<br />\nalu<br />\nId<br /><br />\ned :<br /><br />\ni<br />\nlini<br /><br />\nFrats' Rushing Ends<br />\nCamera Club Elects<br />\nSunday At 1 A. M.<br />\nOfficers_For Season<br /><br />\nBIREI,EY'S<br /><br />\nHIPPODROME--NOW<br /><br />\nPHARMACY<br /><br />\nHopkins Gazette<br />\nPublishes First Issue<br /><br />\nthi<br />\ntra<br /><br />\n1ST.<br /><br />\nThe Awful Truth<br /><br />\n„. .„<br />\nr*<br /><br />\nPatronize Our Advertisers<br /><br />\ne<br /><br />\nnot<br />\ngra<br />\n'38,<br />\niel<br />\nLai<br />\nton<br />\n•<br />\nthe<br />\nsta<br />\npre<br />\nstu<br />\nligi<br />\npar<br />\nan,<br />\nval<br /><br />\nCFI<br />\nthe<br />\ntw<br />\nspl<br />\n{..11<br />\nthe<br />\non<br />\nTh<br />\npul<br />\nAs<br />\nde;<br />\nde<br /><br />\nwil<br /><br />"}], "field_media_file": [{"target_id": 39128, "display": null, "description": null, "target_type": "file", "target_uuid": "5d05a881-072f-49e7-8373-2d00c196cf2f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12804-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12804, "target_type": "node", "target_uuid": "3d83b8b3-eaf2-4ba5-9631-999699bd8795", "url": "/node/12804"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "6a4ec928-2e1a-42c7-86e9-55bf1d29dcb3"}]}